*** crates/vo-core/src/admission/check.rs:32:5: replace check_admission -> Result<(), AdmissionError> with Ok(())

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace check_admission -> Result<(), AdmissionError> with Ok(())
@@ -24,22 +24,17 @@
 /// - `AdmissionError::InvalidAdmissionContext` if operation spans multiple actors
 /// - `AdmissionError::WriterQueueDepthExceeded` if write queue over threshold
 /// - `AdmissionError::BatchCommitLatencyExceeded` if commit latency over threshold
 /// - `AdmissionError::BlobQueueDepthExceeded` if blob queue over threshold
 /// - `AdmissionError::CompactionStallActive` if compaction is stalled
 /// - `AdmissionError::StorageStallActive` if storage is stalled
 /// - `AdmissionError::MultiplePressureIndicators` if multiple indicators exceeded
 pub fn check_admission(state: &WritePressureState) -> Result<(), AdmissionError> {
-    let thresholds = AdmissionThresholds {
-        writer_queue_depth_threshold: 100,
-        batch_commit_latency_ms_threshold: 1000,
-        blob_queue_depth_threshold: 50,
-    };
-    check_admission_with_thresholds(state, &thresholds)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Check admission with explicit thresholds (for testing and configuration).
 pub fn check_admission_with_thresholds(
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
     let mut indicators = Vec::new();

---- admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first stdout ----

thread 'admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first' (329565) panicked at crates/vo-core/src/admission/check_tests.rs:292:14:
Expected MultiplePressureIndicators, got Ok(())

---- admission::check_tests::check_admission_boundary_writer_just_above_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_above_threshold' (329563) panicked at crates/vo-core/src/admission/check_tests.rs:549:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(WriterQueueDepthExceeded { current_depth: 101, threshold: 100 })

---- admission::check_tests::check_admission_rejects_max_u64_values stdout ----

thread 'admission::check_tests::check_admission_rejects_max_u64_values' (329568) panicked at crates/vo-core/src/admission/check_tests.rs:339:18:
Expected MultiplePressureIndicators, got Ok(())

failures:
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_compaction_stall_active_when_indicator_true
    admission::check_tests::check_admission_returns_error_just_over_threshold
    admission::check_tests::check_admission_returns_multiple_pressure_indicato

test result: FAILED. 282 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
