*** crates/vo-core/src/admission/check.rs:45:5: replace check_admission_with_thresholds -> Result<(), AdmissionError> with Ok(())

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace check_admission_with_thresholds -> Result<(), AdmissionError> with Ok(())
@@ -37,49 +37,10 @@
     check_admission_with_thresholds(state, &thresholds)
 }
 
 /// Check admission with explicit thresholds (for testing and configuration).
 pub fn check_admission_with_thresholds(
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
-    let mut indicators = Vec::new();
-
-    if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
-        indicators.push(PressureIndicator::WriterQueueDepth);
-    }
-    if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
-        indicators.push(PressureIndicator::BatchCommitLatency);
-    }
-    if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
-        indicators.push(PressureIndicator::BlobQueueDepth);
-    }
-    if state.compaction_stall_active {
-        indicators.push(PressureIndicator::CompactionStall);
-    }
-    if state.storage_stall_active {
-        indicators.push(PressureIndicator::StorageStall);
-    }
-
-    match indicators.len() {
-        0 => Ok(()),
-        1 => match indicators[0] {
-            PressureIndicator::WriterQueueDepth => Err(AdmissionError::WriterQueueDepthExceeded {
-                current_depth: state.writer_queue_depth,
-                threshold: thresholds.writer_queue_depth_threshold,
-            }),
-            PressureIndicator::BatchCommitLatency => {
-                Err(AdmissionError::BatchCommitLatencyExceeded {
-                    current_latency_ms: state.batch_commit_latency_ms,
-                    threshold_ms: thresholds.batch_commit_latency_ms_threshold,
-                })
-            }
-            PressureIndicator::BlobQueueDepth => Err(AdmissionError::BlobQueueDepthExceeded {
-                current_depth: state.blob_queue_depth,
-                threshold: thresholds.blob_queue_depth_threshold,
-            }),
-            PressureIndicator::CompactionStall => Err(AdmissionError::CompactionStallActive),
-            PressureIndicator::StorageStall => Err(AdmissionError::StorageStallActive),
-        },
-        _ => Err(AdmissionError::MultiplePressureIndicators { indicators }),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first stdout ----

thread 'admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first' (333042) panicked at crates/vo-core/src/admission/check_tests.rs:292:14:
Expected MultiplePressureIndicators, got Ok(())

---- admission::check_tests::check_admission_boundary_writer_just_above_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_above_threshold' (333040) panicked at crates/vo-core/src/admission/check_tests.rs:549:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(WriterQueueDepthExceeded { current_depth: 101, threshold: 100 })

---- admission::check_tests::check_admission_detects_threshold_swap_mutation stdout ----

thread 'admission::check_tests::check_admission_detects_threshold_swap_mutation' (333043) panicked at crates/vo-core/src/admission/check_tests.rs:474:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(WriterQueueDepthExceeded { current_depth: 150, threshold: 100 })

failures:
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first
    admission::check_tests::check_admission_detects_threshold_swap_mutation
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_compaction_stall_active_when_indicator_true
    admission::check_tests::check_admission_returns_error_just_over_threshold

test result: FAILED. 277 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
