*** crates/vo-core/src/admission/check.rs:47:33: replace > with == in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with == in check_admission_with_thresholds
@@ -39,17 +39,17 @@
 
 /// Check admission with explicit thresholds (for testing and configuration).
 pub fn check_admission_with_thresholds(
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
     let mut indicators = Vec::new();
 
-    if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
+    if state.writer_queue_depth == /* ~ changed by cargo-mutants ~ */ thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
     if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
     if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }

---- admission::check_tests::check_admission_boundary_writer_just_above_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_above_threshold' (335723) panicked at crates/vo-core/src/admission/check_tests.rs:549:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(WriterQueueDepthExceeded { current_depth: 101, threshold: 100 })

---- admission::check_tests::check_admission_boundary_writer_exactly_at_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_exactly_at_threshold' (335722) panicked at crates/vo-core/src/admission/check_tests.rs:536:5:
assertion `left == right` failed
  left: Err(WriterQueueDepthExceeded { current_depth: 100, threshold: 100 })
 right: Ok(())

---- admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first stdout ----

thread 'admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first' (335725) panicked at crates/vo-core/src/admission/check_tests.rs:292:14:
Expected MultiplePressureIndicators, got Err(BatchCommitLatencyExceeded { current_latency_ms: 1500, threshold_ms: 1000 })

failures:
    admission::check_tests::check_admission_boundary_writer_exactly_at_threshold
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first
    admission::check_tests::check_admission_detects_threshold_swap_mutation
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_error_just_over_threshold
    admission::check_tests::check_admission_returns_multiple_pressure_indicators_all_five_exceeded
    admission::check_tests::check_admission_returns_multiple_pressure_indicators_when_multiple_exceeded
    admission::check_tests::check_admission_returns_ok_at_exact_threshold
    admission::check_tests::check_admission_returns_writer_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admiss

test result: FAILED. 282 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
