*** crates/vo-core/src/admission/check.rs:50:38: replace > with == in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with == in check_admission_with_thresholds
@@ -42,17 +42,17 @@
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
     let mut indicators = Vec::new();
 
     if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
-    if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
+    if state.batch_commit_latency_ms == /* ~ changed by cargo-mutants ~ */ thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
     if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }

---- admission::check_tests::check_admission_rejects_max_u64_values stdout ----

thread 'admission::check_tests::check_admission_rejects_max_u64_values' (343739) panicked at crates/vo-core/src/admission/check_tests.rs:334:13:
assertion failed: indicators.contains(&PressureIndicator::BatchCommitLatency)

---- admission::check_tests::check_admission_returns_multiple_pressure_indicators_all_five_exceeded stdout ----

thread 'admission::check_tests::check_admission_returns_multiple_pressure_indicators_all_five_exceeded' (343760) panicked at crates/vo-core/src/admission/check_tests.rs:309:13:
assertion failed: indicators.contains(&PressureIndicator::BatchCommitLatency)

---- admission::check_tests::check_admission_returns_multiple_pressure_indicators_when_multiple_exceeded stdout ----

thread 'admission::check_tests::check_admission_returns_multiple_pressure_indicators_when_multiple_exceeded' (343761) panicked at crates/vo-core/src/admission/check_tests.rs:273:18:
Expected MultiplePressureIndicators, got Err(WriterQueueDepthExceeded { current_depth: 150, threshold: 100 })

failures:
    admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_multiple_pressure_indicators_all_five_exceeded
    admission::check_tests::check_admission_returns_multiple_pressure_indicators_when_multiple_exceeded
    admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold
    admission::check_tests::check_admission_with_zero_thresholds_accepts_zero_values
    admission::check_tests::check_admission_with_zero_thresholds_rejects_nonzero_values

test result: FAILED. 286 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
