*** crates/vo-core/src/admission/check.rs:50:38: replace > with < in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with < in check_admission_with_thresholds
@@ -42,17 +42,17 @@
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
     let mut indicators = Vec::new();
 
     if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
-    if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
+    if state.batch_commit_latency_ms < /* ~ changed by cargo-mutants ~ */ thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
     if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }

---- admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first stdout ----

thread 'admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first' (346446) panicked at crates/vo-core/src/admission/check_tests.rs:292:14:
Expected MultiplePressureIndicators, got Err(WriterQueueDepthExceeded { current_depth: 150, threshold: 100 })

---- admission::check_tests::check_admission_detects_threshold_swap_mutation stdout ----

thread 'admission::check_tests::check_admission_detects_threshold_swap_mutation' (346447) panicked at crates/vo-core/src/admission/check_tests.rs:474:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [WriterQueueDepth, BatchCommitLatency] })
 right: Err(WriterQueueDepthExceeded { current_depth: 150, threshold: 100 })

---- admission::check_tests::check_admission_boundary_writer_just_below_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_below_threshold' (346445) panicked at crates/vo-core/src/admission/check_tests.rs:523:5:
assertion `left == right` failed
  left: Err(BatchCommitLatencyExceeded { current_latency_ms: 50, threshold_ms: 1000 })
 right: Ok(())

failures:
    admission::check_tests::check_admission_boundary_writer_exactly_at_threshold
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_boundary_writer_just_below_threshold
    admission::check_tests::check_admission_collects_all_failed_indicators_not_just_first
    admission::check_tests::check_admission_detects_threshold_swap_mutation
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission:

test result: FAILED. 269 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
