*** crates/vo-core/src/admission/check.rs:50:38: replace > with >= in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with >= in check_admission_with_thresholds
@@ -42,17 +42,17 @@
     state: &WritePressureState,
     thresholds: &AdmissionThresholds,
 ) -> Result<(), AdmissionError> {
     let mut indicators = Vec::new();
 
     if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
-    if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
+    if state.batch_commit_latency_ms >= /* ~ changed by cargo-mutants ~ */ thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
     if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }

---- admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold stdout ----

thread 'admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold' (352637) panicked at crates/vo-core/src/admission/check_tests.rs:143:5:
assertion `left == right` failed
  left: Err(BatchCommitLatencyExceeded { current_latency_ms: 1000, threshold_ms: 1000 })
 right: Ok(())

---- admission::check_tests::check_admission_with_zero_thresholds_rejects_nonzero_values stdout ----

thread 'admission::check_tests::check_admission_with_zero_thresholds_rejects_nonzero_values' (352651) panicked at crates/vo-core/src/admission/check_tests.rs:444:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [WriterQueueDepth, BatchCommitLatency] })
 right: Err(WriterQueueDepthExceeded { current_depth: 1, threshold: 0 })

---- admission::check_tests::check_admission_with_zero_thresholds_accepts_zero_values stdout ----

thread 'admission::check_tests::check_admission_with_zero_thresholds_accepts_zero_values' (352650) panicked at crates/vo-core/src/admission/check_tests.rs:426:5:
assertion `left == right` failed
  left: Err(BatchCommitLatencyExceeded { current_latency_ms: 0, threshold_ms: 0 })
 right: Ok(())

failures:
    admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold
    admission::check_tests::check_admission_with_zero_thresholds_accepts_zero_values
    admission::check_tests::check_admission_with_zero_thresholds_rejects_nonzero_values

test result: FAILED. 292 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
