*** crates/vo-core/src/admission/check.rs:53:31: replace > with == in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with == in check_admission_with_thresholds
@@ -45,17 +45,17 @@
     let mut indicators = Vec::new();
 
     if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
     if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
-    if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
+    if state.blob_queue_depth == /* ~ changed by cargo-mutants ~ */ thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }
     if state.storage_stall_active {
         indicators.push(PressureIndicator::StorageStall);
     }

---- admission::check_tests::check_admission_rejects_max_u64_values stdout ----

thread 'admission::check_tests::check_admission_rejects_max_u64_values' (354007) panicked at crates/vo-core/src/admission/check_tests.rs:335:13:
assertion failed: indicators.contains(&PressureIndicator::BlobQueueDepth)

---- admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold stdout ----

thread 'admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold' (354010) panicked at crates/vo-core/src/admission/check_tests.rs:178:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(BlobQueueDepthExceeded { current_depth: 51, threshold: 50 })

---- admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold stdout ----

thread 'admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold' (354011) panicked at crates/vo-core/src/admission/check_tests.rs:158:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(BlobQueueDepthExceeded { current_depth: 100, threshold: 50 })

failures:
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_multiple_pressure_indicators_all_five_exceeded
    admission::check_tests::check_admission_returns_ok_at_exact_blob_threshold
    admission::check_tests::check_admission_with_custom_thresholds_rejects_over_blob_threshold
    admission::check_tests::check_admission_with_thresholds_detects_blob_threshold_swap
    admission::check_tests::check_admission_with_zero_thresholds_accepts_zero_values
    admission::check_tests::check_admission_with_zero_thresholds_rejects_nonzero_values

test result: FAILED. 286 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
