*** crates/vo-core/src/admission/check.rs:53:31: replace > with < in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ replace > with < in check_admission_with_thresholds
@@ -45,17 +45,17 @@
     let mut indicators = Vec::new();
 
     if state.writer_queue_depth > thresholds.writer_queue_depth_threshold {
         indicators.push(PressureIndicator::WriterQueueDepth);
     }
     if state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold {
         indicators.push(PressureIndicator::BatchCommitLatency);
     }
-    if state.blob_queue_depth > thresholds.blob_queue_depth_threshold {
+    if state.blob_queue_depth < /* ~ changed by cargo-mutants ~ */ thresholds.blob_queue_depth_threshold {
         indicators.push(PressureIndicator::BlobQueueDepth);
     }
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }
     if state.storage_stall_active {
         indicators.push(PressureIndicator::StorageStall);
     }

---- admission::check_tests::check_admission_boundary_writer_exactly_at_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_exactly_at_threshold' (355363) panicked at crates/vo-core/src/admission/check_tests.rs:536:5:
assertion `left == right` failed
  left: Err(BlobQueueDepthExceeded { current_depth: 5, threshold: 50 })
 right: Ok(())

---- admission::check_tests::check_admission_boundary_writer_just_above_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_above_threshold' (355364) panicked at crates/vo-core/src/admission/check_tests.rs:549:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [WriterQueueDepth, BlobQueueDepth] })
 right: Err(WriterQueueDepthExceeded { current_depth: 101, threshold: 100 })

---- admission::check_tests::check_admission_boundary_writer_just_below_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_below_threshold' (355365) panicked at crates/vo-core/src/admission/check_tests.rs:523:5:
assertion `left == right` failed
  left: Err(BlobQueueDepthExceeded { current_depth: 5, threshold: 50 })
 right: Ok(())

failures:
    admission::check_tests::check_admission_boundary_writer_exactly_at_threshold
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_boundary_writer_just_below_threshold
    admission::check_tests::check_admission_detects_threshold_swap_mutation
    admission::check_tests::check_admission_rejects_max_u64_values
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_compaction_stall_active_when_indicator_true
    admi

test result: FAILED. 270 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
