*** crates/vo-core/src/admission/check.rs:64:9: delete match arm 0 in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ delete match arm 0 in check_admission_with_thresholds
@@ -56,17 +56,17 @@
     if state.compaction_stall_active {
         indicators.push(PressureIndicator::CompactionStall);
     }
     if state.storage_stall_active {
         indicators.push(PressureIndicator::StorageStall);
     }
 
     match indicators.len() {
-        0 => Ok(()),
+         /* ~ changed by cargo-mutants ~ */
         1 => match indicators[0] {
             PressureIndicator::WriterQueueDepth => Err(AdmissionError::WriterQueueDepthExceeded {
                 current_depth: state.writer_queue_depth,
                 threshold: thresholds.writer_queue_depth_threshold,
             }),
             PressureIndicator::BatchCommitLatency => {
                 Err(AdmissionError::BatchCommitLatencyExceeded {
                     current_latency_ms: state.batch_commit_latency_ms,

---- admission::check_tests::check_admission_boundary_writer_exactly_at_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_exactly_at_threshold' (362909) panicked at crates/vo-core/src/admission/check_tests.rs:536:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [] })
 right: Ok(())

---- admission::check_tests::check_admission_boundary_writer_just_below_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_below_threshold' (362913) panicked at crates/vo-core/src/admission/check_tests.rs:523:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [] })
 right: Ok(())

---- admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold stdout ----

thread 'admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold' (362932) panicked at crates/vo-core/src/admission/check_tests.rs:143:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [] })
 right: Ok(())

failures:
    admission::check_tests::check_admission_boundary_writer_exactly_at_threshold
    admission::check_tests::check_admission_boundary_writer_just_below_threshold
    admission::check_tests::check_admission_returns_ok_at_exact_blob_threshold
    admission::check_tests::check_admission_returns_ok_at_exact_latency_threshold
    admission::check_tests::check_admission_returns_ok_at_exact_threshold
    admission::check_tests::check_admission_returns_ok_when_all_indicators_within_thresholds
    admission::check_tests::check_admission_returns_ok_when_compaction_stall_false
    admission::check_tests::check_admission_returns_ok_when_storage_stall_false
    admission::check_tests::check_admission_returns_ok_with_all_zero_values
    admission::check_tests::check_admission_with_custom_thresholds_returns_ok_when_within_custom_limits
    admission::check_tests::check_admission_with_zero_thr

test result: FAILED. 284 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
