*** crates/vo-core/src/admission/check.rs:65:9: delete match arm 1 in check_admission_with_thresholds

*** mutation diff:
--- crates/vo-core/src/admission/check.rs
+++ delete match arm 1 in check_admission_with_thresholds
@@ -57,29 +57,12 @@
         indicators.push(PressureIndicator::CompactionStall);
     }
     if state.storage_stall_active {
         indicators.push(PressureIndicator::StorageStall);
     }
 
     match indicators.len() {
         0 => Ok(()),
-        1 => match indicators[0] {
-            PressureIndicator::WriterQueueDepth => Err(AdmissionError::WriterQueueDepthExceeded {
-                current_depth: state.writer_queue_depth,
-                threshold: thresholds.writer_queue_depth_threshold,
-            }),
-            PressureIndicator::BatchCommitLatency => {
-                Err(AdmissionError::BatchCommitLatencyExceeded {
-                    current_latency_ms: state.batch_commit_latency_ms,
-                    threshold_ms: thresholds.batch_commit_latency_ms_threshold,
-                })
-            }
-            PressureIndicator::BlobQueueDepth => Err(AdmissionError::BlobQueueDepthExceeded {
-                current_depth: state.blob_queue_depth,
-                threshold: thresholds.blob_queue_depth_threshold,
-            }),
-            PressureIndicator::CompactionStall => Err(AdmissionError::CompactionStallActive),
-            PressureIndicator::StorageStall => Err(AdmissionError::StorageStallActive),
-        },
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(AdmissionError::MultiplePressureIndicators { indicators }),
     }
 }

---- admission::check_tests::check_admission_detects_threshold_swap_mutation stdout ----

thread 'admission::check_tests::check_admission_detects_threshold_swap_mutation' (364482) panicked at crates/vo-core/src/admission/check_tests.rs:474:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [WriterQueueDepth] })
 right: Err(WriterQueueDepthExceeded { current_depth: 150, threshold: 100 })

---- admission::check_tests::check_admission_boundary_writer_just_above_threshold stdout ----

thread 'admission::check_tests::check_admission_boundary_writer_just_above_threshold' (364479) panicked at crates/vo-core/src/admission/check_tests.rs:549:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [WriterQueueDepth] })
 right: Err(WriterQueueDepthExceeded { current_depth: 101, threshold: 100 })

---- admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold stdout ----

thread 'admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold' (364488) panicked at crates/vo-core/src/admission/check_tests.rs:158:5:
assertion `left == right` failed
  left: Err(MultiplePressureIndicators { indicators: [BlobQueueDepth] })
 right: Err(BlobQueueDepthExceeded { current_depth: 100, threshold: 50 })

failures:
    admission::check_tests::check_admission_boundary_writer_just_above_threshold
    admission::check_tests::check_admission_detects_threshold_swap_mutation
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_batch_commit_latency_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_just_over_threshold
    admission::check_tests::check_admission_returns_blob_queue_depth_exceeded_when_over_threshold
    admission::check_tests::check_admission_returns_compaction_stall_active_when_indicator_true
    admission::check_tests::check_admission_returns_error_just_over_threshold
    admission::check_tests::check_admission_returns_storage_stall_active_when_indicator_true
    admission::check_tests::check_admission_returns_writer_queue_d

test result: FAILED. 281 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
