*** crates/vo-core/src/admission/check_verification.rs:106:41: replace <= with > in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ replace <= with > in verification::multiple_indicators_error_contains_exactly_failures
@@ -98,17 +98,17 @@
                     state.storage_stall_active,
                     "StorageStall in error must be active",
                 );
             }
 
             // CHECK 2: For each indicator NOT in the error, verify it does NOT exceed threshold (exclusion)
 
             // WriterQueueDepth NOT in error implies writer_queue_depth <= writer_threshold
-            if state.writer_queue_depth <= thresholds.writer_queue_depth_threshold {
+            if state.writer_queue_depth > /* ~ changed by cargo-mutants ~ */ thresholds.writer_queue_depth_threshold {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::WriterQueueDepth),
                     "WriterQueueDepth should not be in error if within threshold",
                 );
             }
 
             // BatchCommitLatency NOT in error implies batch_commit_latency_ms <= latency_threshold
             if state.batch_commit_latency_ms <= thresholds.batch_commit_latency_ms_threshold {

*** result: Success
