*** crates/vo-core/src/admission/check_verification.rs:122:39: replace <= with > in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ replace <= with > in verification::multiple_indicators_error_contains_exactly_failures
@@ -114,17 +114,17 @@
             if state.batch_commit_latency_ms <= thresholds.batch_commit_latency_ms_threshold {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::BatchCommitLatency),
                     "BatchCommitLatency should not be in error if within threshold",
                 );
             }
 
             // BlobQueueDepth NOT in error implies blob_queue_depth <= blob_threshold
-            if state.blob_queue_depth <= thresholds.blob_queue_depth_threshold {
+            if state.blob_queue_depth > /* ~ changed by cargo-mutants ~ */ thresholds.blob_queue_depth_threshold {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::BlobQueueDepth),
                     "BlobQueueDepth should not be in error if within threshold",
                 );
             }
 
             // CompactionStall NOT in error implies compaction_stall_active == false
             if !state.compaction_stall_active {

*** result: Success
