*** crates/vo-core/src/admission/check_verification.rs:124:21: delete ! in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ delete ! in verification::multiple_indicators_error_contains_exactly_failures
@@ -116,17 +116,17 @@
                     !indicators.contains(&PressureIndicator::BatchCommitLatency),
                     "BatchCommitLatency should not be in error if within threshold",
                 );
             }
 
             // BlobQueueDepth NOT in error implies blob_queue_depth <= blob_threshold
             if state.blob_queue_depth <= thresholds.blob_queue_depth_threshold {
                 kani::assert(
-                    !indicators.contains(&PressureIndicator::BlobQueueDepth),
+                     /* ~ changed by cargo-mutants ~ */indicators.contains(&PressureIndicator::BlobQueueDepth),
                     "BlobQueueDepth should not be in error if within threshold",
                 );
             }
 
             // CompactionStall NOT in error implies compaction_stall_active == false
             if !state.compaction_stall_active {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::CompactionStall),

*** result: Success
