*** crates/vo-core/src/admission/check_verification.rs:130:16: delete ! in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ delete ! in verification::multiple_indicators_error_contains_exactly_failures
@@ -122,17 +122,17 @@
             if state.blob_queue_depth <= thresholds.blob_queue_depth_threshold {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::BlobQueueDepth),
                     "BlobQueueDepth should not be in error if within threshold",
                 );
             }
 
             // CompactionStall NOT in error implies compaction_stall_active == false
-            if !state.compaction_stall_active {
+            if  /* ~ changed by cargo-mutants ~ */state.compaction_stall_active {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::CompactionStall),
                     "CompactionStall should not be in error if not active",
                 );
             }
 
             // StorageStall NOT in error implies storage_stall_active == false
             if !state.storage_stall_active {

*** result: Success
