*** crates/vo-core/src/admission/check_verification.rs:132:21: delete ! in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ delete ! in verification::multiple_indicators_error_contains_exactly_failures
@@ -124,17 +124,17 @@
                     !indicators.contains(&PressureIndicator::BlobQueueDepth),
                     "BlobQueueDepth should not be in error if within threshold",
                 );
             }
 
             // CompactionStall NOT in error implies compaction_stall_active == false
             if !state.compaction_stall_active {
                 kani::assert(
-                    !indicators.contains(&PressureIndicator::CompactionStall),
+                     /* ~ changed by cargo-mutants ~ */indicators.contains(&PressureIndicator::CompactionStall),
                     "CompactionStall should not be in error if not active",
                 );
             }
 
             // StorageStall NOT in error implies storage_stall_active == false
             if !state.storage_stall_active {
                 kani::assert(
                     !indicators.contains(&PressureIndicator::StorageStall),

*** result: Success
