*** crates/vo-core/src/admission/check_verification.rs:18:9: replace verification::check_admission_never_panics with ()

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ replace verification::check_admission_never_panics with ()
@@ -10,32 +10,17 @@
     /// `WritePressureState` where all `u64` fields are in valid range `[0, u64::MAX]`
     /// and boolean fields are `true` or `false`.
     ///
     /// Rationale: This is critical hot-path code. An unchecked panic in `check_admission`
     /// could cause process death and loss of in-flight writes. Formal verification
     /// ensures no panic possible for any input combination.
     #[kani::proof]
     fn check_admission_never_panics() {
-        let writer_queue_depth: u64 = kani::any();
-        let batch_commit_latency_ms: u64 = kani::any();
-        let blob_queue_depth: u64 = kani::any();
-        let compaction_stall_active: bool = kani::any();
-        let storage_stall_active: bool = kani::any();
-
-        let state = WritePressureState {
-            writer_queue_depth,
-            batch_commit_latency_ms,
-            blob_queue_depth,
-            compaction_stall_active,
-            storage_stall_active,
-        };
-
-        // This should never panic - all inputs are valid
-        let _ = check_admission(&state);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Kani proof: MultiplePressureIndicators error contains exactly the failing indicators.
     ///
     /// Property: When `check_admission` returns `MultiplePressureIndicators`, the
     /// `indicators` vector contains exactly those (and only those) pressure indicators
     /// whose thresholds are exceeded.
     ///

*** result: Success
