*** crates/vo-core/src/admission/check_verification.rs:49:9: replace verification::multiple_indicators_error_contains_exactly_failures with ()

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ replace verification::multiple_indicators_error_contains_exactly_failures with ()
@@ -41,106 +41,11 @@
     ///
     /// Rationale: Logic error in composite error construction could silently drop some
     /// failure indicators or add spurious ones, causing the system to believe pressure
     /// is lower than it actually is. This is a silent correctness failure mode.
     ///
     /// COMPLETE HARNESS — all 5 indicators checked for both inclusion AND exclusion.
     #[kani::proof]
     fn multiple_indicators_error_contains_exactly_failures() {
-        let state = WritePressureState {
-            writer_queue_depth: kani::any(),
-            batch_commit_latency_ms: kani::any(),
-            blob_queue_depth: kani::any(),
-            compaction_stall_active: kani::any(),
-            storage_stall_active: kani::any(),
-        };
-
-        let thresholds = AdmissionThresholds::default();
-        let result = check_admission_with_thresholds(&state, &thresholds);
-
-        if let Err(AdmissionError::MultiplePressureIndicators { indicators }) = result {
-            // CHECK 1: For each indicator IN the error, verify it actually exceeds threshold (inclusion)
-
-            // WriterQueueDepth in error implies writer_queue_depth > writer_threshold
-            if indicators.contains(&PressureIndicator::WriterQueueDepth) {
-                kani::assert(
-                    state.writer_queue_depth > thresholds.writer_queue_depth_threshold,
-                    "WriterQueueDepth in error must exceed threshold",
-                );
-            }
-
-            // BatchCommitLatency in error implies batch_commit_latency_ms > latency_threshold
-            if indicators.contains(&PressureIndicator::BatchCommitLatency) {
-                kani::assert(
-                    state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold,
-                    "BatchCommitLatency in error must exceed threshold",
-                );
-            }
-
-            // BlobQueueDepth in error implies blob_queue_depth > blob_threshold
-            if indicators.contains(&PressureIndicator::BlobQueueDepth) {
-                kani::assert(
-                    state.blob_queue_depth > thresholds.blob_queue_depth_threshold,
-                    "BlobQueueDepth in error must exceed threshold",
-                );
-            }
-
-            // CompactionStall in error implies compaction_stall_active == true
-            if indicators.contains(&PressureIndicator::CompactionStall) {
-                kani::assert(
-                    state.compaction_stall_active,
-                    "CompactionStall in error must be active",
-                );
-            }
-
-            // StorageStall in error implies storage_stall_active == true
-            if indicators.contains(&PressureIndicator::StorageStall) {
-                kani::assert(
-                    state.storage_stall_active,
-                    "StorageStall in error must be active",
-                );
-            }
-
-            // CHECK 2: For each indicator NOT in the error, verify it does NOT exceed threshold (exclusion)
-
-            // WriterQueueDepth NOT in error implies writer_queue_depth <= writer_threshold
-            if state.writer_queue_depth <= thresholds.writer_queue_depth_threshold {
-                kani::assert(
-                    !indicators.contains(&PressureIndicator::WriterQueueDepth),
-                    "WriterQueueDepth should not be in error if within threshold",
-                );
-            }
-
-            // BatchCommitLatency NOT in error implies batch_commit_latency_ms <= latency_threshold
-            if state.batch_commit_latency_ms <= thresholds.batch_commit_latency_ms_threshold {
-                kani::assert(
-                    !indicators.contains(&PressureIndicator::BatchCommitLatency),
-                    "BatchCommitLatency should not be in error if within threshold",
-                );
-            }
-
-            // BlobQueueDepth NOT in error implies blob_queue_depth <= blob_threshold
-            if state.blob_queue_depth <= thresholds.blob_queue_depth_threshold {
-                kani::assert(
-                    !indicators.contains(&PressureIndicator::BlobQueueDepth),
-                    "BlobQueueDepth should not be in error if within threshold",
-                );
-            }
-
-            // CompactionStall NOT in error implies compaction_stall_active == false
-            if !state.compaction_stall_active {
-                kani::assert(
-                    !indicators.contains(&PressureIndicator::CompactionStall),
-                    "CompactionStall should not be in error if not active",
-                );
-            }
-
-            // StorageStall NOT in error implies storage_stall_active == false
-            if !state.storage_stall_active {
-                kani::assert(
-                    !indicators.contains(&PressureIndicator::StorageStall),
-                    "StorageStall should not be in error if not active",
-                );
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
