*** crates/vo-core/src/admission/check_verification.rs:66:46: replace > with < in verification::multiple_indicators_error_contains_exactly_failures

*** mutation diff:
--- crates/vo-core/src/admission/check_verification.rs
+++ replace > with < in verification::multiple_indicators_error_contains_exactly_failures
@@ -58,17 +58,17 @@
         let result = check_admission_with_thresholds(&state, &thresholds);
 
         if let Err(AdmissionError::MultiplePressureIndicators { indicators }) = result {
             // CHECK 1: For each indicator IN the error, verify it actually exceeds threshold (inclusion)
 
             // WriterQueueDepth in error implies writer_queue_depth > writer_threshold
             if indicators.contains(&PressureIndicator::WriterQueueDepth) {
                 kani::assert(
-                    state.writer_queue_depth > thresholds.writer_queue_depth_threshold,
+                    state.writer_queue_depth < /* ~ changed by cargo-mutants ~ */ thresholds.writer_queue_depth_threshold,
                     "WriterQueueDepth in error must exceed threshold",
                 );
             }
 
             // BatchCommitLatency in error implies batch_commit_latency_ms > latency_threshold
             if indicators.contains(&PressureIndicator::BatchCommitLatency) {
                 kani::assert(
                     state.batch_commit_latency_ms > thresholds.batch_commit_latency_ms_threshold,

*** result: Success
