*** crates/vo-core/src/admission/control.rs:82:9: replace <impl fmt::Display for RejectionReason>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-core/src/admission/control.rs
+++ replace <impl fmt::Display for RejectionReason>::fmt -> fmt::Result with Ok(Default::default())
@@ -74,35 +74,17 @@
     /// No active lease exists for the (instance_id, step_id) pair.
     NoActiveLease,
     /// A generic admission policy violation with a human-readable message.
     PolicyViolation(String),
 }
 
 impl fmt::Display for RejectionReason {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            RejectionReason::MissingDedupeKey => write!(f, "missing dedupe key"),
-            RejectionReason::DedupeKeyTooLong {
-                max_length,
-                actual_length,
-            } => {
-                write!(
-                    f,
-                    "dedupe key too long: {actual_length} characters exceeds maximum of {max_length}"
-                )
-            }
-            RejectionReason::FenceTokenMismatch { expected, actual } => {
-                write!(f, "fence token mismatch: expected {expected}, got {actual}")
-            }
-            RejectionReason::NoActiveLease => {
-                write!(f, "no active lease for the given instance and step")
-            }
-            RejectionReason::PolicyViolation(msg) => write!(f, "policy violation: {msg}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for RejectionReason {}
 
 // ============================================================================
 // AdmissionResult
 // ============================================================================

---- admission::control_tests::rejection_reason_dedupe_key_too_long stdout ----

thread 'admission::control_tests::rejection_reason_dedupe_key_too_long' (379609) panicked at crates/vo-core/src/admission/control_tests.rs:117:5:
assertion failed: display.contains("300")

---- admission::control_tests::rejection_reason_fence_token_mismatch stdout ----

thread 'admission::control_tests::rejection_reason_fence_token_mismatch' (379610) panicked at crates/vo-core/src/admission/control_tests.rs:134:5:
assertion failed: display.contains("5")

---- admission::control_tests::rejection_reason_no_active_lease stdout ----

thread 'admission::control_tests::rejection_reason_no_active_lease' (379614) panicked at crates/vo-core/src/admission/control_tests.rs:142:5:
assertion failed: format!("{reason}").contains("no active lease")

failures:
    admission::control_tests::rejection_reason_dedupe_key_too_long
    admission::control_tests::rejection_reason_fence_token_mismatch
    admission::control_tests::rejection_reason_missing_dedupe_key
    admission::control_tests::rejection_reason_no_active_lease
    admission::control_tests::rejection_reason_policy_violation

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
