*** crates/vo-core/src/circuit_breaker/failure_window.rs:36:9: replace FailureWindow::len -> usize with 0

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace FailureWindow::len -> usize with 0
@@ -28,17 +28,17 @@
         Self {
             records: Vec::new(),
         }
     }
 
     /// Returns the number of records in the window.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.records.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if the window has no records.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.records.is_empty()
     }

---- circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion' (420739) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 3

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired' (420749) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:225:5:
assertion `left == right` failed
  left: 0
 right: 3

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash' (420746) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:65:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_readds_expired_duplicate_as_fresh
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired

test result: FAILED. 288 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
