*** crates/vo-core/src/circuit_breaker/failure_window.rs:36:9: replace FailureWindow::len -> usize with 1

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace FailureWindow::len -> usize with 1
@@ -28,17 +28,17 @@
         Self {
             records: Vec::new(),
         }
     }
 
     /// Returns the number of records in the window.
     #[must_use]
     pub fn len(&self) -> usize {
-        self.records.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns true if the window has no records.
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.records.is_empty()
     }

---- circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion' (423131) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:94:5:
assertion `left == right` failed
  left: 1
 right: 3

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash' (423135) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:43:5:
assertion `left == right` failed
  left: 1
 right: 2

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired' (423139) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:259:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
