*** crates/vo-core/src/circuit_breaker/failure_window.rs:42:9: replace FailureWindow::is_empty -> bool with true

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace FailureWindow::is_empty -> bool with true
@@ -34,17 +34,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.records.len()
     }
 
     /// Returns true if the window has no records.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.records.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the records slice.
     #[must_use]
     pub fn records(&self) -> &[FailureRecord] {
         &self.records
     }
 }

*** result: Success
