*** crates/vo-core/src/circuit_breaker/failure_window.rs:42:9: replace FailureWindow::is_empty -> bool with false

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace FailureWindow::is_empty -> bool with false
@@ -34,17 +34,17 @@
     #[must_use]
     pub fn len(&self) -> usize {
         self.records.len()
     }
 
     /// Returns true if the window has no records.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.records.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a reference to the records slice.
     #[must_use]
     pub fn records(&self) -> &[FailureRecord] {
         &self.records
     }
 }

---- failure_window_new_is_empty stdout ----

thread 'failure_window_new_is_empty' (430558) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:746:5:
new FailureWindow should be empty

failures:
    failure_window_new_is_empty

test result: FAILED. 29 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
