*** crates/vo-core/src/circuit_breaker/failure_window.rs:48:9: replace FailureWindow::records -> &[FailureRecord] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace FailureWindow::records -> &[FailureRecord] with Vec::leak(Vec::new())
@@ -40,17 +40,17 @@
     #[must_use]
     pub fn is_empty(&self) -> bool {
         self.records.is_empty()
     }
 
     /// Returns a reference to the records slice.
     #[must_use]
     pub fn records(&self) -> &[FailureRecord] {
-        &self.records
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Add or update a failure record in the sliding window.
 ///
 /// # Invariants enforced
 /// - INV-004: duplicate hashes update timestamp, not count
 /// - INV-007: expired entries evicted before insertion

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash' (430990) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:22:16:
index out of bounds: the len is 0 but the index is 0

---- circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion' (430988) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:106:16:
index out of bounds: the len is 0 but the index is 0

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash' (430995) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:66:16:
index out of bounds: the len is 0 but the index is 0

failures:
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash

test result: FAILED. 292 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
