*** crates/vo-core/src/circuit_breaker/failure_window.rs:67:5: replace record_failure_in_window -> usize with 0

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace record_failure_in_window -> usize with 0
@@ -59,35 +59,17 @@
 /// Number of unique hashes in the window after insertion.
 pub fn record_failure_in_window(
     window: &mut FailureWindow,
     hash: BinaryHash,
     failed_at: Instant,
     window_duration: Duration,
 ) -> usize {
     // INV-007: evict expired entries first
-    window.records.retain(|r| {
-        let elapsed = failed_at.duration_since(r.failed_at);
-        elapsed <= window_duration
-    });
-
-    // INV-004: check for duplicate hash
-    if let Some(existing) = window.records.iter_mut().find(|r| r.hash == hash) {
-        // Duplicate: update timestamp only, no count change
-        existing.failed_at = failed_at;
-        // Re-sort to maintain ordering invariant
-        window.records.sort_by_key(|r| r.failed_at);
-    } else {
-        // Novel hash: insert in sorted position
-        let record = FailureRecord { hash, failed_at };
-        let pos = window.records.partition_point(|r| r.failed_at <= failed_at);
-        window.records.insert(pos, record);
-    }
-
-    window.records.len()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Count unique hashes in the failure window, evicting expired entries.
 ///
 /// Pure read with side-effect of eviction.
 pub fn unique_failures_in_window(
     window: &mut FailureWindow,
     now: Instant,

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash' (438719) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:20:5:
assertion `left == right` failed
  left: 0
 right: 1

---- circuit_breaker::failure_window::tests::record_failure_in_window_readds_expired_duplicate_as_fresh stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_readds_expired_duplicate_as_fresh' (438717) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:196:5:
assertion `left == right` failed
  left: 0
 right: 1

---- circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion' (438715) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_readds_expired_duplicate_as_fresh
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_1_when_first_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_4_when_duplicate_of_existing
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_5_when_fifth_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_windo

test result: FAILED. 284 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
