*** crates/vo-core/src/circuit_breaker/failure_window.rs:69:17: replace <= with > in record_failure_in_window

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace <= with > in record_failure_in_window
@@ -61,17 +61,17 @@
     window: &mut FailureWindow,
     hash: BinaryHash,
     failed_at: Instant,
     window_duration: Duration,
 ) -> usize {
     // INV-007: evict expired entries first
     window.records.retain(|r| {
         let elapsed = failed_at.duration_since(r.failed_at);
-        elapsed <= window_duration
+        elapsed > /* ~ changed by cargo-mutants ~ */ window_duration
     });
 
     // INV-004: check for duplicate hash
     if let Some(existing) = window.records.iter_mut().find(|r| r.hash == hash) {
         // Duplicate: update timestamp only, no count change
         existing.failed_at = failed_at;
         // Re-sort to maintain ordering invariant
         window.records.sort_by_key(|r| r.failed_at);

---- circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion' (437265) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:94:5:
assertion `left == right` failed
  left: 1
 right: 3

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live' (437268) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:173:5:
assertion `left == right` failed
  left: 1
 right: 2

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired' (437273) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:259:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_4_when_duplicate_of_existing
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_5_when_fifth_unique_hash
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired

test result: FAILED. 287 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
