*** crates/vo-core/src/circuit_breaker/failure_window.rs:73:71: replace == with != in record_failure_in_window

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace == with != in record_failure_in_window
@@ -65,17 +65,17 @@
 ) -> usize {
     // INV-007: evict expired entries first
     window.records.retain(|r| {
         let elapsed = failed_at.duration_since(r.failed_at);
         elapsed <= window_duration
     });
 
     // INV-004: check for duplicate hash
-    if let Some(existing) = window.records.iter_mut().find(|r| r.hash == hash) {
+    if let Some(existing) = window.records.iter_mut().find(|r| r.hash != /* ~ changed by cargo-mutants ~ */ hash) {
         // Duplicate: update timestamp only, no count change
         existing.failed_at = failed_at;
         // Re-sort to maintain ordering invariant
         window.records.sort_by_key(|r| r.failed_at);
     } else {
         // Novel hash: insert in sorted position
         let record = FailureRecord { hash, failed_at };
         let pos = window.records.partition_point(|r| r.failed_at <= failed_at);

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live' (445815) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:173:5:
assertion `left == right` failed
  left: 1
 right: 2

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_5_when_fifth_unique_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_5_when_fifth_unique_hash' (445818) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:124:5:
assertion `left == right` failed
  left: 1
 right: 5

---- circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash stdout ----

thread 'circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash' (445816) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:42:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::record_failure_in_window_evicts_expired_entries_before_insertion
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_mixed_expired_and_live
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_2_when_second_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_4_when_duplicate_of_existing
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_5_when_fifth_unique_hash
    circuit_breaker::failure_window::tests::record_failure_in_window_returns_same_count_when_duplicate_hash
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_wind

test result: FAILED. 286 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
