*** crates/vo-core/src/circuit_breaker/failure_window.rs:81:66: replace <= with > in record_failure_in_window

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace <= with > in record_failure_in_window
@@ -73,17 +73,17 @@
     if let Some(existing) = window.records.iter_mut().find(|r| r.hash == hash) {
         // Duplicate: update timestamp only, no count change
         existing.failed_at = failed_at;
         // Re-sort to maintain ordering invariant
         window.records.sort_by_key(|r| r.failed_at);
     } else {
         // Novel hash: insert in sorted position
         let record = FailureRecord { hash, failed_at };
-        let pos = window.records.partition_point(|r| r.failed_at <= failed_at);
+        let pos = window.records.partition_point(|r| r.failed_at > /* ~ changed by cargo-mutants ~ */ failed_at);
         window.records.insert(pos, record);
     }
 
     window.records.len()
 }
 
 /// Count unique hashes in the failure window, evicting expired entries.
 ///

---- circuit_breaker::failure_window::tests::proptests::failure_window_records_sorted_by_failed_at stdout ----

thread 'circuit_breaker::failure_window::tests::proptests::failure_window_records_sorted_by_failed_at' (449908) panicked at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:8:1:
Test failed: Records not sorted by failed_at ascending at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:105.
minimal failing input: num_insertions = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    circuit_breaker::failure_window::tests::proptests::failure_window_records_sorted_by_failed_at

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
