*** crates/vo-core/src/circuit_breaker/failure_window.rs:97:5: replace unique_failures_in_window -> usize with 0

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace unique_failures_in_window -> usize with 0
@@ -89,19 +89,14 @@
 ///
 /// Pure read with side-effect of eviction.
 pub fn unique_failures_in_window(
     window: &mut FailureWindow,
     now: Instant,
     window_duration: Duration,
 ) -> usize {
     // INV-007: evict expired entries
-    window.records.retain(|r| {
-        let elapsed = now.duration_since(r.failed_at);
-        elapsed <= window_duration
-    });
-
-    window.records.len()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[path = "failure_window_tests.rs"]
 mod tests;

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired' (447973) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:264:5:
assertion `left == right` failed
  left: 2
 right: 0

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired' (447975) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:230:5:
assertion `left == right` failed
  left: 0
 right: 2

---- circuit_breaker::failure_window::tests::proptests::expired_entries_always_evicted_after_unique_failures_call stdout ----

thread 'circuit_breaker::failure_window::tests::proptests::expired_entries_always_evicted_after_unique_failures_call' (447963) panicked at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:8:1:
Test failed: Found record outside window after eviction. Window: 1s at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:73.
minimal failing input: window_secs = 1, num_records = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::proptests::expired_entries_always_evicted_after_unique_failures_call
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired

test result: FAILED. 291 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
