*** crates/vo-core/src/circuit_breaker/failure_window.rs:97:5: replace unique_failures_in_window -> usize with 1

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace unique_failures_in_window -> usize with 1
@@ -89,19 +89,14 @@
 ///
 /// Pure read with side-effect of eviction.
 pub fn unique_failures_in_window(
     window: &mut FailureWindow,
     now: Instant,
     window_duration: Duration,
 ) -> usize {
     // INV-007: evict expired entries
-    window.records.retain(|r| {
-        let elapsed = now.duration_since(r.failed_at);
-        elapsed <= window_duration
-    });
-
-    window.records.len()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[path = "failure_window_tests.rs"]
 mod tests;

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired' (453436) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:263:5:
assertion `left == right` failed
  left: 1
 right: 0

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_empty stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_empty' (453437) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:239:5:
assertion `left == right` failed
  left: 1
 right: 0

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired' (453438) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:230:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::proptests::expired_entries_always_evicted_after_unique_failures_call
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_empty
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
