*** crates/vo-core/src/circuit_breaker/failure_window.rs:99:17: replace <= with > in unique_failures_in_window

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/failure_window.rs
+++ replace <= with > in unique_failures_in_window
@@ -91,17 +91,17 @@
 pub fn unique_failures_in_window(
     window: &mut FailureWindow,
     now: Instant,
     window_duration: Duration,
 ) -> usize {
     // INV-007: evict expired entries
     window.records.retain(|r| {
         let elapsed = now.duration_since(r.failed_at);
-        elapsed <= window_duration
+        elapsed > /* ~ changed by cargo-mutants ~ */ window_duration
     });
 
     window.records.len()
 }
 
 #[cfg(test)]
 #[path = "failure_window_tests.rs"]
 mod tests;

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired' (456901) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:263:5:
assertion `left == right` failed
  left: 2
 right: 0

---- circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired stdout ----

thread 'circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired' (456903) panicked at crates/vo-core/src/circuit_breaker/failure_window_tests.rs:230:5:
assertion `left == right` failed
  left: 1
 right: 2

---- circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count stdout ----

thread 'circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count' (456890) panicked at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:8:1:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at crates/vo-core/src/circuit_breaker/failure_window_proptests.rs:36.
minimal failing input: num_insertions = 1, pool_idx = [
    0,
]
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    circuit_breaker::failure_window::tests::proptests::duplicate_hashes_never_double_count
    circuit_breaker::failure_window::tests::proptests::expired_entries_always_evicted_after_unique_failures_call
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_0_when_all_expired
    circuit_breaker::failure_window::tests::unique_failures_in_window_returns_2_after_evicting_1_expired

test result: FAILED. 291 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
