*** crates/vo-core/src/circuit_breaker/mod.rs:125:5: replace record_failure -> Result<Option<QuarantineEvent>, CircuitBreakerError> with Ok(None)

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/mod.rs
+++ replace record_failure -> Result<Option<QuarantineEvent>, CircuitBreakerError> with Ok(None)
@@ -117,45 +117,17 @@
     workflow_name: &WorkflowName,
     binary_hash: &BinaryHash,
     config: &CircuitBreakerConfig,
     state: &CircuitBreakerState,
     now: Instant,
 ) -> Result<Option<QuarantineEvent>, CircuitBreakerError> {
     // CRIT-002: If workflow is already quarantined, return Ok(None) immediately.
     // Prevents duplicate QuarantineEvent emission and unbounded FailureWindow growth.
-    if state.get_status(workflow_name) == RegistrationStatus::Quarantined {
-        return Ok(None);
-    }
-
-    // Get or create the failure window for this workflow
-    let mut entry = state
-        .failure_tracker
-        .entry(workflow_name.clone())
-        .or_default();
-
-    // Record the failure in the window (handles INV-004 and INV-007)
-    let unique_count = failure_window::record_failure_in_window(
-        entry.value_mut(),
-        binary_hash.clone(),
-        now,
-        config.failure_window,
-    );
-
-    // Check if threshold breached (INV-001)
-    if unique_count >= usize::from(config.failure_threshold) {
-        // Transition to Quarantined
-        state.set_status(workflow_name.clone(), RegistrationStatus::Quarantined);
-
-        Ok(Some(QuarantineEvent {
-            workflow_name: workflow_name.clone(),
-        }))
-    } else {
-        Ok(None)
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Reset a quarantined workflow to Active status.
 ///
 /// # Postconditions (POST-003)
 /// - Status transitions Quarantined -> Active
 /// - `FailureWindow` cleared (0 entries)
 /// - Rate limiter entry removed

---- record_failure_returns_storage_error_when_fjall_write_fails stdout ----

thread 'record_failure_returns_storage_error_when_fjall_write_fails' (69937) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:385:5:
assertion `left == right` failed: threshold-reaching failure should return Ok(Some(QuarantineEvent))
  left: Ok(None)
 right: Ok(Some(QuarantineEvent { workflow_name: WorkflowName("deploy-prod") }))

---- record_failure_returns_quarantine_event_when_fifth_unique_hash stdout ----

thread 'record_failure_returns_quarantine_event_when_fifth_unique_hash' (69936) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:293:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some(QuarantineEvent { workflow_name: WorkflowName("deploy-prod") }))

---- record_failure_sets_quarantined_status_when_threshold_reached stdout ----

thread 'record_failure_sets_quarantined_status_when_threshold_reached' (69938) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:354:5:
assertion `left == right` failed
  left: None
 right: Some(Quarantined)

failures:
    record_failure_returns_quarantine_event_when_fifth_unique_hash
    record_failure_returns_storage_error_when_fjall_write_fails
    record_failure_sets_quarantined_status_when_threshold_reached

test result: FAILED. 27 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
