*** crates/vo-core/src/circuit_breaker/mod.rs:144:21: replace >= with < in record_failure

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/mod.rs
+++ replace >= with < in record_failure
@@ -136,17 +136,17 @@
     let unique_count = failure_window::record_failure_in_window(
         entry.value_mut(),
         binary_hash.clone(),
         now,
         config.failure_window,
     );
 
     // Check if threshold breached (INV-001)
-    if unique_count >= usize::from(config.failure_threshold) {
+    if unique_count < /* ~ changed by cargo-mutants ~ */ usize::from(config.failure_threshold) {
         // Transition to Quarantined
         state.set_status(workflow_name.clone(), RegistrationStatus::Quarantined);
 
         Ok(Some(QuarantineEvent {
             workflow_name: workflow_name.clone(),
         }))
     } else {
         Ok(None)

---- record_failure_returns_none_when_below_threshold stdout ----

thread 'record_failure_returns_none_when_below_threshold' (40634) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:330:5:
assertion `left == right` failed
  left: Quarantined
 right: Active

---- record_failure_returns_storage_error_when_fjall_write_fails stdout ----

thread 'record_failure_returns_storage_error_when_fjall_write_fails' (40636) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:378:9:
assertion `left == right` failed: pre-threshold failure should return Ok(None)
  left: Ok(Some(QuarantineEvent { workflow_name: WorkflowName("deploy-prod") }))
 right: Ok(None)

---- record_failure_returns_quarantine_event_when_fifth_unique_hash stdout ----

thread 'record_failure_returns_quarantine_event_when_fifth_unique_hash' (40635) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:288:9:
assertion `left == right` failed
  left: Ok(Some(QuarantineEvent { workflow_name: WorkflowName("deploy-prod") }))
 right: Ok(None)

failures:
    record_failure_returns_none_when_below_threshold
    record_failure_returns_quarantine_event_when_fifth_unique_hash
    record_failure_returns_storage_error_when_fjall_write_fails

test result: FAILED. 27 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
