*** crates/vo-core/src/circuit_breaker/mod.rs:184:23: replace != with == in unquarantine

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/mod.rs
+++ replace != with == in unquarantine
@@ -176,17 +176,17 @@
         .statuses
         .get(workflow_name)
         .map(|s| *s)
         .ok_or_else(|| CircuitBreakerError::WorkflowNotFound {
             workflow_name: workflow_name.to_string(),
         })?;
 
     // Must be Quarantined to unquarantine
-    if current_status != RegistrationStatus::Quarantined {
+    if current_status == /* ~ changed by cargo-mutants ~ */ RegistrationStatus::Quarantined {
         return Err(CircuitBreakerError::NotQuarantined {
             workflow_name: workflow_name.to_string(),
             current_status,
         });
     }
 
     // Count failures being cleared before we remove them
     let failures_cleared = state.get_failure_count(workflow_name);

---- unquarantine_persists_active_status stdout ----

thread 'unquarantine_persists_active_status' (49855) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:502:5:
assertion `left == right` failed
  left: Err(NotQuarantined { workflow_name: "ai-loop", current_status: Quarantined })
 right: Ok(UnquarantineResult { workflow_name: WorkflowName("ai-loop"), previous_status: Quarantined, new_status: Active, failures_cleared: 0 })

---- unquarantine_removes_rate_limiter_entry stdout ----

thread 'unquarantine_removes_rate_limiter_entry' (49856) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:466:5:
assertion `left == right` failed
  left: Err(NotQuarantined { workflow_name: "ai-loop", current_status: Quarantined })
 right: Ok(UnquarantineResult { workflow_name: WorkflowName("ai-loop"), previous_status: Quarantined, new_status: Active, failures_cleared: 0 })

---- unquarantine_returns_correct_result_when_no_failures_tracked stdout ----

thread 'unquarantine_returns_correct_result_when_no_failures_tracked' (49857) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:594:5:
assertion `left == right` failed
  left: Err(NotQuarantined { workflow_name: "ai-loop", current_status: Quarantined })
 right: Ok(UnquarantineResult { workflow_name: WorkflowName("ai-loop"), previous_status: Quarantined, new_status: Active, failures_cleared: 0 })

failures:
    unquarantine_persists_active_status
    unquarantine_removes_rate_limiter_entry
    unquarantine_returns_correct_result_when_no_failures_tracked
    unquarantine_returns_not_quarantined_when_active
    unquarantine_returns_not_quarantined_when_deactivated
    unquarantine_returns_result_with_cleared_failures_when_quarantined

test result: FAILED. 24 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
