*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:23:5: replace check_rate_limit -> Option<u64> with None

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace check_rate_limit -> Option<u64> with None
@@ -15,25 +15,17 @@
 ///
 /// Pure function: does not modify state.
 #[must_use]
 pub fn check_rate_limit(
     last_registration: Option<Instant>,
     rate_limit_window: Duration,
     now: Instant,
 ) -> Option<u64> {
-    let last = last_registration?;
-    let elapsed = now.duration_since(last);
-    if elapsed >= rate_limit_window {
-        None
-    } else {
-        let remaining = rate_limit_window.saturating_sub(elapsed);
-        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
-        Some(secs)
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update the rate limiter with the current timestamp for a workflow.
 ///
 /// Returns the new timestamp for storage.
 /// Called after a successful registration.
 #[must_use]
 pub fn update_rate_limit(now: Instant) -> Instant {

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered' (459701) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:99:9:
assertion `left == right` failed
  left: None
 right: Some(60)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds' (459706) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:72:9:
assertion `left == right` failed
  left: None
 right: Some(1)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining' (459707) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:54:9:
assertion `left == right` failed
  left: None
 right: Some(30)

failures:
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds
    circuit_breaker::rate_limiter::tests::update_rate_limit_sets_timestamp_so_check_returns_remaining

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
