*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:23:5: replace check_rate_limit -> Option<u64> with Some(0)

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace check_rate_limit -> Option<u64> with Some(0)
@@ -15,25 +15,17 @@
 ///
 /// Pure function: does not modify state.
 #[must_use]
 pub fn check_rate_limit(
     last_registration: Option<Instant>,
     rate_limit_window: Duration,
     now: Instant,
 ) -> Option<u64> {
-    let last = last_registration?;
-    let elapsed = now.duration_since(last);
-    if elapsed >= rate_limit_window {
-        None
-    } else {
-        let remaining = rate_limit_window.saturating_sub(elapsed);
-        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
-        Some(secs)
-    }
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Update the rate limiter with the current timestamp for a workflow.
 ///
 /// Returns the new timestamp for storage.
 /// Called after a successful registration.
 #[must_use]
 pub fn update_rate_limit(now: Instant) -> Instant {

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_no_prior_registration stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_no_prior_registration' (462900) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:45:9:
assertion `left == right` failed
  left: Some(0)
 right: None

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered' (462898) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:99:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(60)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_window_elapsed stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_window_elapsed' (462902) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:63:9:
assertion `left == right` failed
  left: Some(0)
 right: None

failures:
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_at_exactly_60_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_no_prior_registration
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_well_past_window
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_window_elapsed
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_none_when_elapsed_exceeds_window
    circuit

test result: FAILED. 285 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.13s

*** result: Failure(101)
