*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:25:16: replace >= with < in check_rate_limit

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace >= with < in check_rate_limit
@@ -17,17 +17,17 @@
 #[must_use]
 pub fn check_rate_limit(
     last_registration: Option<Instant>,
     rate_limit_window: Duration,
     now: Instant,
 ) -> Option<u64> {
     let last = last_registration?;
     let elapsed = now.duration_since(last);
-    if elapsed >= rate_limit_window {
+    if elapsed < /* ~ changed by cargo-mutants ~ */ rate_limit_window {
         None
     } else {
         let remaining = rate_limit_window.saturating_sub(elapsed);
         let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
         Some(secs)
     }
 }

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered' (468876) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:107:9:
assertion `left == right` failed
  left: None
 right: Some(60)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_at_exactly_60_seconds stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_at_exactly_60_seconds' (468877) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:89:9:
assertion `left == right` failed
  left: Some(0)
 right: None

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_well_past_window stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_well_past_window' (468879) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:116:9:
assertion `left == right` failed
  left: Some(0)
 right: None

failures:
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_at_exactly_60_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_well_past_window
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_none_when_window_elapsed
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_none_when_elapsed_exceeds_window
    circuit_breaker::rate_limiter::tests::update_rate_limit_sets_timestamp_so_check_returns_remaining

test result: FAILED. 286 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
