*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:29:40: replace + with - in check_rate_limit

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace + with - in check_rate_limit
@@ -21,17 +21,17 @@
     now: Instant,
 ) -> Option<u64> {
     let last = last_registration?;
     let elapsed = now.duration_since(last);
     if elapsed >= rate_limit_window {
         None
     } else {
         let remaining = rate_limit_window.saturating_sub(elapsed);
-        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
+        let secs = remaining.as_secs() - /* ~ changed by cargo-mutants ~ */ u64::from(remaining.subsec_nanos() > 0);
         Some(secs)
     }
 }
 
 /// Update the rate limiter with the current timestamp for a workflow.
 ///
 /// Returns the new timestamp for storage.
 /// Called after a successful registration.

---- circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds stdout ----

thread 'circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds' (471586) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:29:20:
attempt to subtract with overflow

thread 'circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds' (471586) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:124:9:
Test failed: attempt to subtract with overflow.
minimal failing input: elapsed_millis = 1, window_secs = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
