*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:29:40: replace + with * in check_rate_limit

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace + with * in check_rate_limit
@@ -21,17 +21,17 @@
     now: Instant,
 ) -> Option<u64> {
     let last = last_registration?;
     let elapsed = now.duration_since(last);
     if elapsed >= rate_limit_window {
         None
     } else {
         let remaining = rate_limit_window.saturating_sub(elapsed);
-        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
+        let secs = remaining.as_secs() * /* ~ changed by cargo-mutants ~ */ u64::from(remaining.subsec_nanos() > 0);
         Some(secs)
     }
 }
 
 /// Update the rate limiter with the current timestamp for a workflow.
 ///
 /// Returns the new timestamp for storage.
 /// Called after a successful registration.

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered' (476151) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:107:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(60)

---- circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds stdout ----

thread 'circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds' (476158) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:124:9:
Test failed: assertion failed: `(left == right)` 
  left: `Some(0)`,
 right: `Some(1)` at crates/vo-core/src/circuit_breaker/rate_limiter.rs:158.
minimal failing input: elapsed_millis = 0, window_secs = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining' (476157) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:62:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(30)

failures:
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds
    circuit_breaker::rate_limiter::tests::update_rate_limit_sets_timestamp_so_check_returns_remaining

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
