*** crates/vo-core/src/circuit_breaker/rate_limiter.rs:29:77: replace > with == in check_rate_limit

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/rate_limiter.rs
+++ replace > with == in check_rate_limit
@@ -21,17 +21,17 @@
     now: Instant,
 ) -> Option<u64> {
     let last = last_registration?;
     let elapsed = now.duration_since(last);
     if elapsed >= rate_limit_window {
         None
     } else {
         let remaining = rate_limit_window.saturating_sub(elapsed);
-        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() > 0);
+        let secs = remaining.as_secs() + u64::from(remaining.subsec_nanos() == /* ~ changed by cargo-mutants ~ */ 0);
         Some(secs)
     }
 }
 
 /// Update the rate limiter with the current timestamp for a workflow.
 ///
 /// Returns the new timestamp for storage.
 /// Called after a successful registration.

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered' (477784) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:107:9:
assertion `left == right` failed
  left: Some(61)
 right: Some(60)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds' (477789) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:80:9:
assertion `left == right` failed
  left: Some(2)
 right: Some(1)

---- circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining stdout ----

thread 'circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining' (477790) panicked at crates/vo-core/src/circuit_breaker/rate_limiter.rs:62:9:
assertion `left == right` failed
  left: Some(31)
 right: Some(30)

failures:
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_full_window_when_just_registered
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_1_at_59_seconds
    circuit_breaker::rate_limiter::tests::check_rate_limit_returns_some_30_when_30s_remaining
    circuit_breaker::rate_limiter::tests::proptests::check_rate_limit_returns_ceiling_of_remaining_seconds
    circuit_breaker::rate_limiter::tests::update_rate_limit_sets_timestamp_so_check_returns_remaining

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
