*** crates/vo-core/src/circuit_breaker/state.rs:70:9: replace CircuitBreakerState::set_status with ()

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::set_status with ()
@@ -62,17 +62,17 @@
     pub fn get_status(&self, workflow_name: &WorkflowName) -> RegistrationStatus {
         self.statuses
             .get(workflow_name)
             .map_or(RegistrationStatus::Active, |s| *s)
     }
 
     /// Insert or update a workflow's registration status.
     pub fn set_status(&self, workflow_name: WorkflowName, status: RegistrationStatus) {
-        self.statuses.insert(workflow_name, status);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Read the last registration timestamp for rate limiting.
     #[must_use]
     pub fn get_rate_limit(&self, workflow_name: &WorkflowName) -> Option<Instant> {
         self.rate_limiter.get(workflow_name).map(|r| *r)
     }

---- circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window stdout ----

thread 'circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window' (486913) panicked at crates/vo-core/src/circuit_breaker/state.rs:124:9:
assertion `left == right` failed
  left: Active
 right: Quarantined

failures:
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
