*** crates/vo-core/src/circuit_breaker/state.rs:76:9: replace CircuitBreakerState::get_rate_limit -> Option<Instant> with None

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::get_rate_limit -> Option<Instant> with None
@@ -68,17 +68,17 @@
     /// Insert or update a workflow's registration status.
     pub fn set_status(&self, workflow_name: WorkflowName, status: RegistrationStatus) {
         self.statuses.insert(workflow_name, status);
     }
 
     /// Read the last registration timestamp for rate limiting.
     #[must_use]
     pub fn get_rate_limit(&self, workflow_name: &WorkflowName) -> Option<Instant> {
-        self.rate_limiter.get(workflow_name).map(|r| *r)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Update the rate limiter timestamp for a workflow.
     pub fn set_rate_limit(&self, workflow_name: WorkflowName, timestamp: Instant) {
         self.rate_limiter.insert(workflow_name, timestamp);
     }
 
     /// Remove the rate limiter entry for a workflow.

---- circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window stdout ----

thread 'circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window' (490648) panicked at crates/vo-core/src/circuit_breaker/state.rs:125:9:
assertion `left == right` failed
  left: None
 right: Some(Instant { tv_sec: 28385, tv_nsec: 908191170 })

failures:
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
