*** crates/vo-core/src/circuit_breaker/state.rs:81:9: replace CircuitBreakerState::set_rate_limit with ()

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::set_rate_limit with ()
@@ -73,17 +73,17 @@
     /// Read the last registration timestamp for rate limiting.
     #[must_use]
     pub fn get_rate_limit(&self, workflow_name: &WorkflowName) -> Option<Instant> {
         self.rate_limiter.get(workflow_name).map(|r| *r)
     }
 
     /// Update the rate limiter timestamp for a workflow.
     pub fn set_rate_limit(&self, workflow_name: WorkflowName, timestamp: Instant) {
-        self.rate_limiter.insert(workflow_name, timestamp);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Remove the rate limiter entry for a workflow.
     pub fn remove_rate_limit(&self, workflow_name: &WorkflowName) {
         self.rate_limiter.remove(workflow_name);
     }
 
     /// Get the failure count for a workflow (guards dropped before return).

---- circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window stdout ----

thread 'circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window' (493334) panicked at crates/vo-core/src/circuit_breaker/state.rs:125:9:
assertion `left == right` failed
  left: None
 right: Some(Instant { tv_sec: 28386, tv_nsec: 318306416 })

failures:
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
