*** crates/vo-core/src/circuit_breaker/state.rs:86:9: replace CircuitBreakerState::remove_rate_limit with ()

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::remove_rate_limit with ()
@@ -78,17 +78,17 @@
 
     /// Update the rate limiter timestamp for a workflow.
     pub fn set_rate_limit(&self, workflow_name: WorkflowName, timestamp: Instant) {
         self.rate_limiter.insert(workflow_name, timestamp);
     }
 
     /// Remove the rate limiter entry for a workflow.
     pub fn remove_rate_limit(&self, workflow_name: &WorkflowName) {
-        self.rate_limiter.remove(workflow_name);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the failure count for a workflow (guards dropped before return).
     #[must_use]
     pub fn get_failure_count(&self, workflow_name: &WorkflowName) -> usize {
         self.failure_tracker
             .get(workflow_name)
             .map_or(0, |w| w.len())

---- circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window stdout ----

thread 'circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window' (494692) panicked at crates/vo-core/src/circuit_breaker/state.rs:128:9:
assertion `left == right` failed
  left: Some(Instant { tv_sec: 28386, tv_nsec: 362193329 })
 right: None

failures:
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
