*** crates/vo-core/src/circuit_breaker/state.rs:92:9: replace CircuitBreakerState::get_failure_count -> usize with 0

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::get_failure_count -> usize with 0
@@ -84,19 +84,17 @@
     /// Remove the rate limiter entry for a workflow.
     pub fn remove_rate_limit(&self, workflow_name: &WorkflowName) {
         self.rate_limiter.remove(workflow_name);
     }
 
     /// Get the failure count for a workflow (guards dropped before return).
     #[must_use]
     pub fn get_failure_count(&self, workflow_name: &WorkflowName) -> usize {
-        self.failure_tracker
-            .get(workflow_name)
-            .map_or(0, |w| w.len())
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for CircuitBreakerState {
     fn default() -> Self {
         Self::new()
     }
 }

---- unquarantine_returns_result_with_cleared_failures_when_quarantined stdout ----

thread 'unquarantine_returns_result_with_cleared_failures_when_quarantined' (502251) panicked at crates/vo-core/tests/circuit_breaker_integration.rs:427:5:
assertion `left == right` failed
  left: Ok(UnquarantineResult { workflow_name: WorkflowName("ai-loop"), previous_status: Quarantined, new_status: Active, failures_cleared: 0 })
 right: Ok(UnquarantineResult { workflow_name: WorkflowName("ai-loop"), previous_status: Quarantined, new_status: Active, failures_cleared: 5 })

failures:
    unquarantine_returns_result_with_cleared_failures_when_quarantined

test result: FAILED. 29 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
