*** crates/vo-core/src/circuit_breaker/state.rs:92:9: replace CircuitBreakerState::get_failure_count -> usize with 1

*** mutation diff:
--- crates/vo-core/src/circuit_breaker/state.rs
+++ replace CircuitBreakerState::get_failure_count -> usize with 1
@@ -84,19 +84,17 @@
     /// Remove the rate limiter entry for a workflow.
     pub fn remove_rate_limit(&self, workflow_name: &WorkflowName) {
         self.rate_limiter.remove(workflow_name);
     }
 
     /// Get the failure count for a workflow (guards dropped before return).
     #[must_use]
     pub fn get_failure_count(&self, workflow_name: &WorkflowName) -> usize {
-        self.failure_tracker
-            .get(workflow_name)
-            .map_or(0, |w| w.len())
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for CircuitBreakerState {
     fn default() -> Self {
         Self::new()
     }
 }

---- circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window stdout ----

thread 'circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window' (502470) panicked at crates/vo-core/src/circuit_breaker/state.rs:116:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    circuit_breaker::state::tests::circuit_breaker_state_tracks_status_rate_limit_and_failure_window

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
