*** crates/vo-core/src/db_writer_message.rs:80:9: replace SnapshotData::state_bytes -> &[u8] with Vec::leak(vec![1])

*** mutation diff:
--- crates/vo-core/src/db_writer_message.rs
+++ replace SnapshotData::state_bytes -> &[u8] with Vec::leak(vec![1])
@@ -72,17 +72,17 @@
 
     #[must_use]
     pub fn sequence_number(&self) -> SequenceNumber {
         self.sequence_number
     }
 
     #[must_use]
     pub fn state_bytes(&self) -> &[u8] {
-        &self.state_bytes
+        Vec::leak(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Messages sent to `DbWriterActor` for atomic batch commits.
 ///
 /// Per ADR-016: every control-plane transition must atomically update
 /// all touched partitions in the same batch.
 ///

*** result: Success
