*** crates/vo-core/src/debounce.rs:127:31: replace && with || in Debouncer::background_task

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace && with || in Debouncer::background_task
@@ -119,17 +119,17 @@
 
             for path in expired {
                 pending.remove(&path);
                 if ready_tx.send(Ok(path)).await.is_err() {
                     return;
                 }
             }
 
-            if channel_closed && pending.is_empty() {
+            if channel_closed || /* ~ changed by cargo-mutants ~ */ pending.is_empty() {
                 if ready_tx
                     .send(Err(Error::WatcherChannelClosed))
                     .await
                     .is_err()
                 {
                     // Receiver closed
                 }
                 return;

---- debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file stdout ----

thread 'debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file' (87343) panicked at crates/vo-core/src/debounce.rs:624:68:
called `Result::unwrap()` on an `Err` value: WatcherChannelClosed

thread 'debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file' (87343) panicked at crates/vo-core/src/debounce.rs:624:68:
called `Result::unwrap()` on an `Err` value: WatcherChannelClosed

thread 'debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file' (87343) panicked at crates/vo-core/src/debounce.rs:624:68:
called `Result::unwrap()` on an `Err` value: WatcherChannelClosed

thread 'debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file' (87343) panicked at crates/vo-core/src/debounce.rs:624:68:
called `Result::unwrap()

---- debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives stdout ----

thread 'debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives' (87417) panicked at crates/vo-core/src/debounce.rs:456:9:
assertion `left == right` failed
  left: Ready(Err(WatcherChannelClosed))
 right: Pending

---- debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events stdout ----

thread 'debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events' (87420) panicked at crates/vo-core/src/debounce.rs:495:9:
assertion `left == right` failed
  left: Ready(Err(WatcherChannelClosed))
 right: Pending

failures:
    debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file
    debounce::tests::next_debounced_event_collapses_multiple_events_for_same_file_into_single_yield
    debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives
    debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events
    debounce::tests::next_debounced_event_yields_pending_events_before_returning_channel_closed_error

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
