*** crates/vo-core/src/debounce.rs:160:9: replace Debouncer::process_single_event_sync -> Result<(), Error> with Ok(())

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::process_single_event_sync -> Result<(), Error> with Ok(())
@@ -152,26 +152,17 @@
     }
 
     fn process_single_event_sync(
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         event: FileEvent,
         now: Instant,
     ) -> Result<(), Error> {
-        match event {
-            FileEvent::Modify(path) => {
-                let deadline = now.checked_add(duration).ok_or(Error::DebouncerInternal)?;
-                pending.insert(path, deadline);
-            }
-            FileEvent::Delete(path) => {
-                pending.remove(&path);
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn handle_event_or_fail(
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         event: FileEvent,
         ready_tx: &Sender<Result<PathBuf, Error>>,
     ) -> Result<(), ()> {

*** result: Timeout
