*** crates/vo-core/src/debounce.rs:191:9: replace Debouncer::calculate_deadlines -> (Vec<PathBuf>, Option<Instant>) with (vec![Default::default()], None)

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::calculate_deadlines -> (Vec<PathBuf>, Option<Instant>) with (vec![Default::default()], None)
@@ -183,33 +183,17 @@
         } else {
             Ok(())
         }
     }
 
     fn calculate_deadlines(
         pending: &mut HashMap<PathBuf, Instant>,
     ) -> (Vec<PathBuf>, Option<Instant>) {
-        let now = Instant::now();
-        let mut next_deadline = None;
-        let mut expired = Vec::new();
-
-        for (path, &deadline) in pending.iter() {
-            if deadline <= now {
-                expired.push(path.clone());
-            } else {
-                next_deadline = Some(match next_deadline {
-                    Some(d) => std::cmp::min(d, deadline),
-                    None => deadline,
-                });
-            }
-        }
-
-        expired.sort();
-        (expired, next_deadline)
+        (vec![Default::default()], None) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn drain_channel(
         event_rx: &mut Receiver<FileEvent>,
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         ready_tx: &Sender<Result<PathBuf, Error>>,
         channel_closed: &mut bool,

*** result: Timeout
