*** crates/vo-core/src/debounce.rs:217:9: replace Debouncer::drain_channel -> Result<(), ()> with Ok(())

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::drain_channel -> Result<(), ()> with Ok(())
@@ -209,32 +209,17 @@
 
     async fn drain_channel(
         event_rx: &mut Receiver<FileEvent>,
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         ready_tx: &Sender<Result<PathBuf, Error>>,
         channel_closed: &mut bool,
     ) -> Result<(), ()> {
-        if *channel_closed {
-            return Ok(());
-        }
-        loop {
-            match event_rx.try_recv() {
-                Ok(event) => {
-                    Self::handle_event_or_fail(pending, duration, event, ready_tx).await?;
-                }
-                Err(TryRecvError::Empty) => break,
-                Err(TryRecvError::Disconnected) => {
-                    *channel_closed = true;
-                    break;
-                }
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn wait_for_events(
         event_rx: &mut Receiver<FileEvent>,
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         ready_tx: &Sender<Result<PathBuf, Error>>,
         channel_closed: &mut bool,

*** result: Success
