*** crates/vo-core/src/debounce.rs:243:9: replace Debouncer::wait_for_events -> Result<(), ()> with Ok(())

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::wait_for_events -> Result<(), ()> with Ok(())
@@ -235,36 +235,17 @@
     async fn wait_for_events(
         event_rx: &mut Receiver<FileEvent>,
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         ready_tx: &Sender<Result<PathBuf, Error>>,
         channel_closed: &mut bool,
         next_deadline: Option<Instant>,
     ) -> Result<(), ()> {
-        let sleep_fut = async {
-            if let Some(d) = next_deadline {
-                sleep_until(d).await;
-            } else {
-                std::future::pending::<()>().await;
-            }
-        };
-
-        tokio::select! {
-            () = sleep_fut => {}
-            event_opt = event_rx.recv(), if !*channel_closed => {
-                match event_opt {
-                    Some(event) => {
-                        Self::handle_event_or_fail(pending, duration, event, ready_tx).await?;
-                    }
-                    None => *channel_closed = true,
-                }
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use std::future::Future;
     use std::pin::Pin;

*** result: Timeout
