*** crates/vo-core/src/debounce.rs:36:23: replace == with != in <impl PartialEq for Debouncer>::eq

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace == with != in <impl PartialEq for Debouncer>::eq
@@ -28,17 +28,17 @@
 #[derive(Debug)]
 pub struct Debouncer {
     pub duration: Duration,
     ready_rx: Receiver<Result<PathBuf, Error>>,
 }
 
 impl PartialEq for Debouncer {
     fn eq(&self, other: &Self) -> bool {
-        self.duration == other.duration
+        self.duration != /* ~ changed by cargo-mutants ~ */ other.duration
     }
 }
 
 impl Debouncer {
     /// Creates a new debouncer.
     ///
     /// # Errors
     /// Returns `Error::InvalidDebounceDuration` if the duration is 0.

*** result: Success
