*** crates/vo-core/src/debounce.rs:649:41: replace - with / in verification::verify_event_tracking_state_bounds

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace - with / in verification::verify_event_tracking_state_bounds
@@ -641,12 +641,12 @@
         let count: u8 = kani::any();
         let added: u8 = kani::any();
         let removed: u8 = kani::any();
 
         kani::assume(count <= 5);
         kani::assume(added <= 5 - count);
         kani::assume(removed <= count + added);
 
-        let final_count = count + added - removed;
+        let final_count = count + added / /* ~ changed by cargo-mutants ~ */ removed;
         assert!(final_count <= 5);
     }
 }

*** result: Success
