*** crates/vo-core/src/debounce.rs:80:9: replace Debouncer::next_debounced_event -> Result<PathBuf, Error> with Ok(Default::default())

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::next_debounced_event -> Result<PathBuf, Error> with Ok(Default::default())
@@ -72,20 +72,17 @@
     }
 
     /// Waits for the next debounced file event.
     ///
     /// # Errors
     /// Returns `Error::WatcherChannelClosed` if the underlying watcher drops and all events are yielded.
     /// Returns `Error::DebouncerInternal` if an internal error occurs (e.g., timer overflow).
     pub async fn next_debounced_event(&mut self) -> Result<PathBuf, Error> {
-        self.ready_rx
-            .recv()
-            .await
-            .unwrap_or(Err(Error::WatcherChannelClosed))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn background_task(
         duration: Duration,
         mut event_rx: Receiver<FileEvent>,
         ready_tx: Sender<Result<PathBuf, Error>>,
         initial_event: Option<FileEvent>,
     ) {

---- debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files stdout ----

thread 'debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files' (80435) panicked at crates/vo-core/src/debounce.rs:544:9:
assertion `left == right` failed
  left: Ok("")
 right: Ok("file_1.bin")

---- debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives stdout ----

thread 'debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives' (80434) panicked at crates/vo-core/src/debounce.rs:453:9:
assertion `left == right` failed
  left: Ready(Ok(""))
 right: Pending

---- debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events stdout ----

thread 'debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events' (80436) panicked at crates/vo-core/src/debounce.rs:492:9:
assertion `left == right` failed
  left: Ready(Ok(""))
 right: Pending

failures:
    debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file
    debounce::tests::next_debounced_event_collapses_multiple_events_for_same_file_into_single_yield
    debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives
    debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files
    debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events
    debounce::tests::next_debounced_event_resets_timer_when_event_arrives_exactly_at_debounce_duration
    debounce::tests::next_debounced_event_returns_channel_closed_error_when_sender_dropped
    debounce::tests::next_debounced_event_returns_debouncer_internal_error_when_timer_fails
    debounce::tests::next_debounced_event_returns_internal_error_on_timer_overflow
    debounce::tests::next_debounced_event_yields_exact_path_when_debounce_duratio

test result: FAILED. 281 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
