*** crates/vo-core/src/debounce.rs:92:9: replace Debouncer::background_task with ()

*** mutation diff:
--- crates/vo-core/src/debounce.rs
+++ replace Debouncer::background_task with ()
@@ -84,76 +84,17 @@
     }
 
     async fn background_task(
         duration: Duration,
         mut event_rx: Receiver<FileEvent>,
         ready_tx: Sender<Result<PathBuf, Error>>,
         initial_event: Option<FileEvent>,
     ) {
-        let mut pending: HashMap<PathBuf, Instant> = HashMap::new();
-        let mut channel_closed = false;
-
-        if let Some(event) = initial_event {
-            if Self::handle_event_or_fail(&mut pending, duration, event, &ready_tx)
-                .await
-                .is_err()
-            {
-                return;
-            }
-        }
-
-        loop {
-            if Self::drain_channel(
-                &mut event_rx,
-                &mut pending,
-                duration,
-                &ready_tx,
-                &mut channel_closed,
-            )
-            .await
-            .is_err()
-            {
-                return;
-            }
-
-            let (expired, next_deadline) = Self::calculate_deadlines(&mut pending);
-
-            for path in expired {
-                pending.remove(&path);
-                if ready_tx.send(Ok(path)).await.is_err() {
-                    return;
-                }
-            }
-
-            if channel_closed && pending.is_empty() {
-                if ready_tx
-                    .send(Err(Error::WatcherChannelClosed))
-                    .await
-                    .is_err()
-                {
-                    // Receiver closed
-                }
-                return;
-            }
-
-            if Self::wait_for_events(
-                &mut event_rx,
-                &mut pending,
-                duration,
-                &ready_tx,
-                &mut channel_closed,
-                next_deadline,
-            )
-            .await
-            .is_err()
-            {
-                return;
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn process_single_event_sync(
         pending: &mut HashMap<PathBuf, Instant>,
         duration: Duration,
         event: FileEvent,
         now: Instant,
     ) -> Result<(), Error> {

---- debounce::tests::next_debounced_event_collapses_multiple_events_for_same_file_into_single_yield stdout ----

thread 'debounce::tests::next_debounced_event_collapses_multiple_events_for_same_file_into_single_yield' (83684) panicked at crates/vo-core/src/debounce.rs:329:56:
called `Result::unwrap()` on an `Err` value: SendError { .. }

---- debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files stdout ----

thread 'debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files' (83688) panicked at crates/vo-core/src/debounce.rs:488:9:
assertion `left == right` failed
  left: Err(WatcherChannelClosed)
 right: Ok("file_1.bin")

---- debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events stdout ----

thread 'debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events' (83689) panicked at crates/vo-core/src/debounce.rs:436:9:
assertion `left == right` failed
  left: Ready(Err(WatcherChannelClosed))
 right: Pending

failures:
    debounce::proptests::event_stream_deduplicates_multiple_events_for_same_file
    debounce::tests::next_debounced_event_collapses_multiple_events_for_same_file_into_single_yield
    debounce::tests::next_debounced_event_drops_pending_path_when_deletion_event_arrives
    debounce::tests::next_debounced_event_handles_multiple_concurrent_distinct_files
    debounce::tests::next_debounced_event_remains_pending_when_polled_with_no_events
    debounce::tests::next_debounced_event_resets_timer_when_event_arrives_exactly_at_debounce_duration
    debounce::tests::next_debounced_event_returns_debouncer_internal_error_when_timer_fails
    debounce::tests::next_debounced_event_returns_internal_error_on_timer_overflow
    debounce::tests::next_debounced_event_yields_empty_path_when_received
    debounce::tests::next_debounced_event_yields_exact_path_when_debounce_duration_elapses
    deb

test result: FAILED. 281 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
