*** crates/vo-core/src/replay.rs:148:34: replace != with == in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace != with == in ReplayEngine::replay
@@ -140,17 +140,17 @@
                 final_state: None,
                 events_applied: 0,
             });
         }
 
         // Validate instance_id consistency
         let expected_instance_id = &events[0].instance_id;
         for event in events.iter().skip(1) {
-            if event.instance_id != *expected_instance_id {
+            if event.instance_id == /* ~ changed by cargo-mutants ~ */ *expected_instance_id {
                 return Err(ReplayError::InstanceMismatch {
                     expected: expected_instance_id.clone(),
                     actual: event.instance_id.clone(),
                 });
             }
         }
 
         // Validate sequence ordering

---- replay::tests::replay_is_deterministic_same_events_produce_same_result stdout ----

thread 'replay::tests::replay_is_deterministic_same_events_produce_same_result' (158442) panicked at crates/vo-core/src/replay.rs:782:46:
first replay: InstanceMismatch { expected: "inst-1", actual: "inst-1" }

---- replay::tests::replay_maps_step_failed_to_fail_transition stdout ----

thread 'replay::tests::replay_maps_step_failed_to_fail_transition' (158446) panicked at crates/vo-core/src/replay.rs:512:45:
replay should succeed: InstanceMismatch { expected: "inst-1", actual: "inst-1" }

---- replay::tests::replay_failure_recovery_cycle stdout ----

thread 'replay::tests::replay_failure_recovery_cycle' (158438) panicked at crates/vo-core/src/replay.rs:875:45:
replay should succeed: InstanceMismatch { expected: "inst-1", actual: "inst-1" }

failures:
    replay::tests::replay_failure_recovery_cycle
    replay::tests::replay_full_lifecycle_pending_to_completed
    replay::tests::replay_full_lifecycle_with_timer_round_trip
    replay::tests::replay_is_deterministic_same_events_produce_same_result
    replay::tests::replay_maps_cancel_requested_to_cancel_transition
    replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition
    replay::tests::replay_maps_step_completed_to_complete_step_transition
    replay::tests::replay_maps_step_failed_to_fail_transition
    replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition
    replay::tests::replay_maps_step_started_to_execute_step_transition
    replay::tests::replay_maps_timer_fired_to_timer_fired_transition
    replay::tests::replay_maps_timer_set_to_wait_for_timer_transition

test result: FAILED. 273 passed; 22 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
