*** crates/vo-core/src/replay.rs:159:18: replace == with != in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace == with != in ReplayEngine::replay
@@ -151,17 +151,17 @@
                     actual: event.instance_id.clone(),
                 });
             }
         }
 
         // Validate sequence ordering
         let mut expected_seq = events[0].sequence;
         for (i, event) in events.iter().enumerate() {
-            if i == 0 {
+            if i != /* ~ changed by cargo-mutants ~ */ 0 {
                 expected_seq = event.sequence;
                 continue;
             }
             if event.sequence == expected_seq {
                 return Err(ReplayError::SequenceDuplicate {
                     sequence: event.sequence,
                     first_at_index: i - 1,
                     second_at_index: i,

---- replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition stdout ----

thread 'replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition' (160052) panicked at crates/vo-core/src/replay.rs:166:37:
attempt to subtract with overflow

---- replay::tests::replay_maps_step_failed_to_fail_transition stdout ----

thread 'replay::tests::replay_maps_step_failed_to_fail_transition' (160051) panicked at crates/vo-core/src/replay.rs:166:37:
attempt to subtract with overflow

---- replay::tests::replay_full_lifecycle_with_timer_round_trip stdout ----

thread 'replay::tests::replay_full_lifecycle_with_timer_round_trip' (160045) panicked at crates/vo-core/src/replay.rs:166:37:
attempt to subtract with overflow

failures:
    replay::tests::replay_failure_recovery_cycle
    replay::tests::replay_full_lifecycle_pending_to_completed
    replay::tests::replay_full_lifecycle_with_timer_round_trip
    replay::tests::replay_is_deterministic_same_events_produce_same_result
    replay::tests::replay_maps_cancel_requested_to_cancel_transition
    replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition
    replay::tests::replay_maps_step_completed_to_complete_step_transition
    replay::tests::replay_maps_step_failed_to_fail_transition
    replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition
    replay::tests::replay_maps_step_started_to_execute_step_transition
    replay::tests::replay_maps_timer_fired_to_timer_fired_transition
    replay::tests::replay_maps_timer_set_to_wait_for_timer_transition

test result: FAILED. 271 passed; 24 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
