*** crates/vo-core/src/replay.rs:163:31: replace == with != in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace == with != in ReplayEngine::replay
@@ -155,17 +155,17 @@
 
         // Validate sequence ordering
         let mut expected_seq = events[0].sequence;
         for (i, event) in events.iter().enumerate() {
             if i == 0 {
                 expected_seq = event.sequence;
                 continue;
             }
-            if event.sequence == expected_seq {
+            if event.sequence != /* ~ changed by cargo-mutants ~ */ expected_seq {
                 return Err(ReplayError::SequenceDuplicate {
                     sequence: event.sequence,
                     first_at_index: i - 1,
                     second_at_index: i,
                 });
             }
             if event.sequence != expected_seq + 1 {
                 return Err(ReplayError::SequenceGap {

---- replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition stdout ----

thread 'replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition' (165714) panicked at crates/vo-core/src/replay.rs:612:45:
replay should succeed: SequenceDuplicate { sequence: 2, first_at_index: 0, second_at_index: 1 }

---- replay::tests::replay_maps_timer_fired_to_timer_fired_transition stdout ----

thread 'replay::tests::replay_maps_timer_fired_to_timer_fired_transition' (165719) panicked at crates/vo-core/src/replay.rs:549:45:
replay should succeed: SequenceDuplicate { sequence: 2, first_at_index: 0, second_at_index: 1 }

---- replay::tests::replay_full_lifecycle_with_timer_round_trip stdout ----

thread 'replay::tests::replay_full_lifecycle_with_timer_round_trip' (165711) panicked at crates/vo-core/src/replay.rs:859:45:
replay should succeed: SequenceDuplicate { sequence: 2, first_at_index: 0, second_at_index: 1 }

failures:
    replay::tests::replay_failure_recovery_cycle
    replay::tests::replay_full_lifecycle_pending_to_completed
    replay::tests::replay_full_lifecycle_with_timer_round_trip
    replay::tests::replay_is_deterministic_same_events_produce_same_result
    replay::tests::replay_maps_cancel_requested_to_cancel_transition
    replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition
    replay::tests::replay_maps_step_completed_to_complete_step_transition
    replay::tests::replay_maps_step_failed_to_fail_transition
    replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition
    replay::tests::replay_maps_step_started_to_execute_step_transition
    replay::tests::replay_maps_timer_fired_to_timer_fired_transition
    replay::tests::replay_maps_timer_set_to_wait_for_timer_transition

test result: FAILED. 274 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
