*** crates/vo-core/src/replay.rs:166:39: replace - with / in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace - with / in ReplayEngine::replay
@@ -158,17 +158,17 @@
         for (i, event) in events.iter().enumerate() {
             if i == 0 {
                 expected_seq = event.sequence;
                 continue;
             }
             if event.sequence == expected_seq {
                 return Err(ReplayError::SequenceDuplicate {
                     sequence: event.sequence,
-                    first_at_index: i - 1,
+                    first_at_index: i / /* ~ changed by cargo-mutants ~ */ 1,
                     second_at_index: i,
                 });
             }
             if event.sequence != expected_seq + 1 {
                 return Err(ReplayError::SequenceGap {
                     expected: expected_seq + 1,
                     actual: event.sequence,
                     at_index: i,

---- replay::tests::replay_returns_sequence_duplicate_when_duplicate_sequence_found stdout ----

thread 'replay::tests::replay_returns_sequence_duplicate_when_duplicate_sequence_found' (167765) panicked at crates/vo-core/src/replay.rs:688:9:
assertion `left == right` failed
  left: SequenceDuplicate { sequence: 1, first_at_index: 1, second_at_index: 1 }
 right: SequenceDuplicate { sequence: 1, first_at_index: 0, second_at_index: 1 }

failures:
    replay::tests::replay_returns_sequence_duplicate_when_duplicate_sequence_found

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
