*** crates/vo-core/src/replay.rs:170:47: replace + with - in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace + with - in ReplayEngine::replay
@@ -162,17 +162,17 @@
             }
             if event.sequence == expected_seq {
                 return Err(ReplayError::SequenceDuplicate {
                     sequence: event.sequence,
                     first_at_index: i - 1,
                     second_at_index: i,
                 });
             }
-            if event.sequence != expected_seq + 1 {
+            if event.sequence != expected_seq - /* ~ changed by cargo-mutants ~ */ 1 {
                 return Err(ReplayError::SequenceGap {
                     expected: expected_seq + 1,
                     actual: event.sequence,
                     at_index: i,
                 });
             }
             expected_seq = event.sequence;
         }

---- replay::tests::replay_full_lifecycle_pending_to_completed stdout ----

thread 'replay::tests::replay_full_lifecycle_pending_to_completed' (176753) panicked at crates/vo-core/src/replay.rs:843:45:
replay should succeed: SequenceGap { expected: 2, actual: 2, at_index: 1 }

---- replay::tests::replay_failure_recovery_cycle stdout ----

thread 'replay::tests::replay_failure_recovery_cycle' (176752) panicked at crates/vo-core/src/replay.rs:875:45:
replay should succeed: SequenceGap { expected: 2, actual: 2, at_index: 1 }

---- replay::tests::replay_full_lifecycle_with_timer_round_trip stdout ----

thread 'replay::tests::replay_full_lifecycle_with_timer_round_trip' (176759) panicked at crates/vo-core/src/replay.rs:859:45:
replay should succeed: SequenceGap { expected: 2, actual: 2, at_index: 1 }

failures:
    replay::tests::replay_failure_recovery_cycle
    replay::tests::replay_full_lifecycle_pending_to_completed
    replay::tests::replay_full_lifecycle_with_timer_round_trip
    replay::tests::replay_is_deterministic_same_events_produce_same_result
    replay::tests::replay_maps_cancel_requested_to_cancel_transition
    replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition
    replay::tests::replay_maps_step_completed_to_complete_step_transition
    replay::tests::replay_maps_step_failed_to_fail_transition
    replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition
    replay::tests::replay_maps_step_started_to_execute_step_transition
    replay::tests::replay_maps_timer_fired_to_timer_fired_transition
    replay::tests::replay_maps_timer_set_to_wait_for_timer_transition

test result: FAILED. 276 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
