*** crates/vo-core/src/replay.rs:172:44: replace + with - in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace + with - in ReplayEngine::replay
@@ -164,17 +164,17 @@
                 return Err(ReplayError::SequenceDuplicate {
                     sequence: event.sequence,
                     first_at_index: i - 1,
                     second_at_index: i,
                 });
             }
             if event.sequence != expected_seq + 1 {
                 return Err(ReplayError::SequenceGap {
-                    expected: expected_seq + 1,
+                    expected: expected_seq - /* ~ changed by cargo-mutants ~ */ 1,
                     actual: event.sequence,
                     at_index: i,
                 });
             }
             expected_seq = event.sequence;
         }
 
         // Apply events through state machine

---- replay::tests::replay_returns_sequence_gap_when_sequence_numbers_have_gap stdout ----

thread 'replay::tests::replay_returns_sequence_gap_when_sequence_numbers_have_gap' (182778) panicked at crates/vo-core/src/replay.rs:666:9:
assertion `left == right` failed
  left: SequenceGap { expected: 0, actual: 3, at_index: 1 }
 right: SequenceGap { expected: 2, actual: 3, at_index: 1 }

failures:
    replay::tests::replay_returns_sequence_gap_when_sequence_numbers_have_gap

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
