*** crates/vo-core/src/replay.rs:195:32: replace += with *= in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace += with *= in ReplayEngine::replay
@@ -187,17 +187,17 @@
                     sequence: event.sequence,
                     source: e.to_string(),
                 }
             })?;
 
             // ContinuedAsNew is a lineage tracking event, not a state transition.
             // Count it as applied but do not change state.
             if matches!(payload, EventPayload::ContinuedAsNew { .. }) {
-                events_applied += 1;
+                events_applied *= /* ~ changed by cargo-mutants ~ */ 1;
                 continue;
             }
 
             let transition = payload_to_transition(&payload, event.sequence)?;
 
             // First event starts from Pending; subsequent events use accumulated state
             let state_for_apply = current_state.unwrap_or(LifecycleState::Pending);

---- replay::tests::replay_treats_continued_as_new_as_noop stdout ----

thread 'replay::tests::replay_treats_continued_as_new_as_noop' (191930) panicked at crates/vo-core/src/replay.rs:630:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    replay::tests::replay_treats_continued_as_new_as_noop

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
