*** crates/vo-core/src/replay.rs:207:36: replace += with -= in ReplayEngine::replay

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace += with -= in ReplayEngine::replay
@@ -199,17 +199,17 @@
             let transition = payload_to_transition(&payload, event.sequence)?;
 
             // First event starts from Pending; subsequent events use accumulated state
             let state_for_apply = current_state.unwrap_or(LifecycleState::Pending);
 
             match state::apply(state_for_apply, transition) {
                 Ok(new_state) => {
                     current_state = Some(new_state);
-                    events_applied += 1;
+                    events_applied -= /* ~ changed by cargo-mutants ~ */ 1;
 
                     // Stop processing after truly terminal states.
                     // Failed is NOT a stopping point — InstanceResumed can recover it.
                     if matches!(
                         new_state,
                         LifecycleState::Completed | LifecycleState::Cancelled
                     ) {
                         break;

---- replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition stdout ----

thread 'replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition' (194695) panicked at crates/vo-core/src/replay.rs:207:21:
attempt to subtract with overflow

---- replay::tests::replay_maps_cancel_requested_to_cancel_transition stdout ----

thread 'replay::tests::replay_maps_cancel_requested_to_cancel_transition' (194694) panicked at crates/vo-core/src/replay.rs:207:21:
attempt to subtract with overflow

---- replay::tests::replay_full_lifecycle_with_timer_round_trip stdout ----

thread 'replay::tests::replay_full_lifecycle_with_timer_round_trip' (194692) panicked at crates/vo-core/src/replay.rs:207:21:
attempt to subtract with overflow

failures:
    replay::tests::replay_failure_recovery_cycle
    replay::tests::replay_full_lifecycle_pending_to_completed
    replay::tests::replay_full_lifecycle_with_timer_round_trip
    replay::tests::replay_is_deterministic_same_events_produce_same_result
    replay::tests::replay_maps_cancel_requested_to_cancel_transition
    replay::tests::replay_maps_instance_resumed_to_instance_resumed_transition
    replay::tests::replay_maps_step_completed_to_complete_step_transition
    replay::tests::replay_maps_step_failed_to_fail_transition
    replay::tests::replay_maps_step_scheduled_to_step_scheduled_transition
    replay::tests::replay_maps_step_started_to_execute_step_transition
    replay::tests::replay_maps_timer_fired_to_timer_fired_transition
    replay::tests::replay_maps_timer_set_to_wait_for_timer_transition

test result: FAILED. 274 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
