*** crates/vo-core/src/replay.rs:53:9: replace <impl std::fmt::Display for ReplayError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-core/src/replay.rs
+++ replace <impl std::fmt::Display for ReplayError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -45,66 +45,17 @@
         reason: String,
     },
     /// Event payload variant has no mapping to a TransitionEvent.
     UnexpectedEventType { payload_type: String, sequence: u64 },
 }
 
 impl std::fmt::Display for ReplayError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            ReplayError::InstanceMismatch { expected, actual } => {
-                write!(
-                    f,
-                    "Instance ID mismatch: expected '{expected}', got '{actual}'"
-                )
-            }
-            ReplayError::SequenceGap {
-                expected,
-                actual,
-                at_index,
-            } => {
-                write!(
-                    f,
-                    "Sequence gap at index {at_index}: expected {expected}, got {actual}"
-                )
-            }
-            ReplayError::SequenceDuplicate {
-                sequence,
-                first_at_index,
-                second_at_index,
-            } => {
-                write!(
-                    f,
-                    "Duplicate sequence {sequence} at indices {first_at_index} and {second_at_index}"
-                )
-            }
-            ReplayError::PayloadDecodeFailed { sequence, source } => {
-                write!(f, "Payload decode failed at sequence {sequence}: {source}")
-            }
-            ReplayError::TransitionFailed {
-                sequence,
-                state,
-                reason,
-            } => {
-                write!(
-                    f,
-                    "Transition failed at sequence {sequence} in state {state:?}: {reason}"
-                )
-            }
-            ReplayError::UnexpectedEventType {
-                payload_type,
-                sequence,
-            } => {
-                write!(
-                    f,
-                    "Unexpected event type '{payload_type}' at sequence {sequence}"
-                )
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for ReplayError {}
 
 // ============================================================================
 // ReplayEngine
 // ============================================================================

*** result: Success
