*** crates/vo-core/src/snapshot_compat.rs:26:9: replace SnapshotCompat::is_compatible -> bool with true

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace SnapshotCompat::is_compatible -> bool with true
@@ -18,17 +18,17 @@
     /// Discard and rebuild from event log.
     Incompatible { snapshot: u16, engine: u16 },
 }
 
 impl SnapshotCompat {
     /// Returns `true` if this result is `Compatible`.
     #[must_use]
     pub fn is_compatible(self) -> bool {
-        matches!(self, Self::Compatible)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Returns `true` when the snapshot version exactly matches the engine version.
 ///
 /// For the full compatibility assessment (including upcast and incompatible
 /// cases), use [`check_snapshot_compat`].
 #[must_use]

*** result: Success
