*** crates/vo-core/src/snapshot_compat.rs:26:9: replace SnapshotCompat::is_compatible -> bool with false

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace SnapshotCompat::is_compatible -> bool with false
@@ -18,17 +18,17 @@
     /// Discard and rebuild from event log.
     Incompatible { snapshot: u16, engine: u16 },
 }
 
 impl SnapshotCompat {
     /// Returns `true` if this result is `Compatible`.
     #[must_use]
     pub fn is_compatible(self) -> bool {
-        matches!(self, Self::Compatible)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Returns `true` when the snapshot version exactly matches the engine version.
 ///
 /// For the full compatibility assessment (including upcast and incompatible
 /// cases), use [`check_snapshot_compat`].
 #[must_use]

---- snapshot_compat::tests::matching_versions_returns_compatible stdout ----

thread 'snapshot_compat::tests::matching_versions_returns_compatible' (202337) panicked at crates/vo-core/src/snapshot_compat.rs:70:9:
assertion failed: result.is_compatible()

failures:
    snapshot_compat::tests::matching_versions_returns_compatible

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
