*** crates/vo-core/src/snapshot_compat.rs:36:22: replace == with != in is_snapshot_compatible

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace == with != in is_snapshot_compatible
@@ -28,17 +28,17 @@
 }
 
 /// Returns `true` when the snapshot version exactly matches the engine version.
 ///
 /// For the full compatibility assessment (including upcast and incompatible
 /// cases), use [`check_snapshot_compat`].
 #[must_use]
 pub fn is_snapshot_compatible(snapshot_version: u16, engine_version: u16) -> bool {
-    snapshot_version == engine_version
+    snapshot_version != /* ~ changed by cargo-mutants ~ */ engine_version
 }
 
 /// Full compatibility assessment between a snapshot's schema version and the
 /// engine's current maximum supported schema version.
 #[must_use]
 pub fn check_snapshot_compat(snapshot_version: u16, engine_version: u16) -> SnapshotCompat {
     if snapshot_version == 0 || engine_version == 0 {
         return SnapshotCompat::Incompatible {

---- snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions stdout ----

thread 'snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions' (211542) panicked at crates/vo-core/src/snapshot_compat.rs:144:9:
assertion failed: is_snapshot_compatible(3, 3)

---- snapshot_compat::tests::is_snapshot_compatible_returns_false_for_mismatched_versions stdout ----

thread 'snapshot_compat::tests::is_snapshot_compatible_returns_false_for_mismatched_versions' (211540) panicked at crates/vo-core/src/snapshot_compat.rs:149:9:
assertion failed: !is_snapshot_compatible(1, 3)

failures:
    snapshot_compat::tests::is_snapshot_compatible_returns_false_for_mismatched_versions
    snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
