*** crates/vo-core/src/snapshot_compat.rs:36:5: replace is_snapshot_compatible -> bool with false

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace is_snapshot_compatible -> bool with false
@@ -28,17 +28,17 @@
 }
 
 /// Returns `true` when the snapshot version exactly matches the engine version.
 ///
 /// For the full compatibility assessment (including upcast and incompatible
 /// cases), use [`check_snapshot_compat`].
 #[must_use]
 pub fn is_snapshot_compatible(snapshot_version: u16, engine_version: u16) -> bool {
-    snapshot_version == engine_version
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Full compatibility assessment between a snapshot's schema version and the
 /// engine's current maximum supported schema version.
 #[must_use]
 pub fn check_snapshot_compat(snapshot_version: u16, engine_version: u16) -> SnapshotCompat {
     if snapshot_version == 0 || engine_version == 0 {
         return SnapshotCompat::Incompatible {

---- snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions stdout ----

thread 'snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions' (209992) panicked at crates/vo-core/src/snapshot_compat.rs:144:9:
assertion failed: is_snapshot_compatible(3, 3)

failures:
    snapshot_compat::tests::is_snapshot_compatible_returns_true_for_matching_versions

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
