*** crates/vo-core/src/snapshot_compat.rs:43:25: replace == with != in check_snapshot_compat

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace == with != in check_snapshot_compat
@@ -35,17 +35,17 @@
 pub fn is_snapshot_compatible(snapshot_version: u16, engine_version: u16) -> bool {
     snapshot_version == engine_version
 }
 
 /// Full compatibility assessment between a snapshot's schema version and the
 /// engine's current maximum supported schema version.
 #[must_use]
 pub fn check_snapshot_compat(snapshot_version: u16, engine_version: u16) -> SnapshotCompat {
-    if snapshot_version == 0 || engine_version == 0 {
+    if snapshot_version != /* ~ changed by cargo-mutants ~ */ 0 || engine_version == 0 {
         return SnapshotCompat::Incompatible {
             snapshot: snapshot_version,
             engine: engine_version,
         };
     }
 
     match snapshot_version.cmp(&engine_version) {
         std::cmp::Ordering::Equal => SnapshotCompat::Compatible,

---- snapshot_compat::tests::matching_versions_returns_compatible stdout ----

thread 'snapshot_compat::tests::matching_versions_returns_compatible' (219324) panicked at crates/vo-core/src/snapshot_compat.rs:70:9:
assertion failed: result.is_compatible()

---- snapshot_compat::tests::snapshot_older_than_engine_returns_needs_upcast stdout ----

thread 'snapshot_compat::tests::snapshot_older_than_engine_returns_needs_upcast' (219329) panicked at crates/vo-core/src/snapshot_compat.rs:76:9:
assertion `left == right` failed
  left: Incompatible { snapshot: 1, engine: 3 }
 right: NeedsUpcast { from: 1, to: 3 }

---- snapshot_compat::tests::version_zero_snapshot_is_incompatible stdout ----

thread 'snapshot_compat::tests::version_zero_snapshot_is_incompatible' (219331) panicked at crates/vo-core/src/snapshot_compat.rs:94:9:
assertion `left == right` failed
  left: NeedsUpcast { from: 0, to: 1 }
 right: Incompatible { snapshot: 0, engine: 1 }

failures:
    snapshot_compat::tests::matching_versions_returns_compatible
    snapshot_compat::tests::snapshot_older_than_engine_returns_needs_upcast
    snapshot_compat::tests::version_zero_snapshot_is_incompatible

test result: FAILED. 292 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
