*** crates/vo-core/src/snapshot_compat.rs:43:30: replace || with && in check_snapshot_compat

*** mutation diff:
--- crates/vo-core/src/snapshot_compat.rs
+++ replace || with && in check_snapshot_compat
@@ -35,17 +35,17 @@
 pub fn is_snapshot_compatible(snapshot_version: u16, engine_version: u16) -> bool {
     snapshot_version == engine_version
 }
 
 /// Full compatibility assessment between a snapshot's schema version and the
 /// engine's current maximum supported schema version.
 #[must_use]
 pub fn check_snapshot_compat(snapshot_version: u16, engine_version: u16) -> SnapshotCompat {
-    if snapshot_version == 0 || engine_version == 0 {
+    if snapshot_version == 0 && /* ~ changed by cargo-mutants ~ */ engine_version == 0 {
         return SnapshotCompat::Incompatible {
             snapshot: snapshot_version,
             engine: engine_version,
         };
     }
 
     match snapshot_version.cmp(&engine_version) {
         std::cmp::Ordering::Equal => SnapshotCompat::Compatible,

---- snapshot_compat::tests::version_zero_snapshot_is_incompatible stdout ----

thread 'snapshot_compat::tests::version_zero_snapshot_is_incompatible' (217672) panicked at crates/vo-core/src/snapshot_compat.rs:94:9:
assertion `left == right` failed
  left: NeedsUpcast { from: 0, to: 1 }
 right: Incompatible { snapshot: 0, engine: 1 }

failures:
    snapshot_compat::tests::version_zero_snapshot_is_incompatible

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
