*** crates/vo-core/src/upcaster/kani_harnesses.rs:156:9: replace verification::verify_version_bound_preservation with ()

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::verify_version_bound_preservation with ()
@@ -148,40 +148,17 @@
         fn max_supported_version(&self) -> u8 {
             self.max_version
         }
     }
 
     #[kani::proof]
     fn verify_version_bound_preservation() {
         // Create a registry with a simple upcaster v0 -> v1
-        let registry = MockRegistry::new();
-
-        // Create an arbitrary envelope with valid version
-        let envelope = EventEnvelope {
-            schema_version: kani::any(),
-            instance_id: "test".to_string(),
-            sequence: 1,
-            timestamp_ms: 1000,
-            payload: serde_json::json!({}),
-            metadata: serde_json::json!({}),
-        };
-
-        // Assume version is within valid range
-        kani::assume(envelope.schema_version <= MAX_SUPPORTED_VERSION);
-
-        // Execute upcast_envelope
-        let result = registry.upcast_envelope(envelope.clone());
-
-        // Verify the property
-        if result.is_ok() {
-            let upcasted = result.unwrap();
-            // In a real proof, we would verify:
-            // assert!(upcasted.version <= MAX_SUPPORTED_VERSION);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[kani::proof]
     fn verify_max_version_returns_unchanged() {
         let registry = MockRegistry::new();
 
         // Create an envelope at exactly MAX_VERSION
         let envelope = EventEnvelope {

*** result: Success
