*** crates/vo-core/src/upcaster/kani_harnesses.rs:169:46: replace <= with > in verification::verify_version_bound_preservation

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace <= with > in verification::verify_version_bound_preservation
@@ -161,17 +161,17 @@
             instance_id: "test".to_string(),
             sequence: 1,
             timestamp_ms: 1000,
             payload: serde_json::json!({}),
             metadata: serde_json::json!({}),
         };
 
         // Assume version is within valid range
-        kani::assume(envelope.schema_version <= MAX_SUPPORTED_VERSION);
+        kani::assume(envelope.schema_version > /* ~ changed by cargo-mutants ~ */ MAX_SUPPORTED_VERSION);
 
         // Execute upcast_envelope
         let result = registry.upcast_envelope(envelope.clone());
 
         // Verify the property
         if result.is_ok() {
             let upcasted = result.unwrap();
             // In a real proof, we would verify:

*** result: Success
