*** crates/vo-core/src/upcaster/kani_harnesses.rs:184:9: replace verification::verify_max_version_returns_unchanged with ()

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::verify_max_version_returns_unchanged with ()
@@ -176,38 +176,17 @@
             let upcasted = result.unwrap();
             // In a real proof, we would verify:
             // assert!(upcasted.version <= MAX_SUPPORTED_VERSION);
         }
     }
 
     #[kani::proof]
     fn verify_max_version_returns_unchanged() {
-        let registry = MockRegistry::new();
-
-        // Create an envelope at exactly MAX_VERSION
-        let envelope = EventEnvelope {
-            schema_version: MAX_SUPPORTED_VERSION,
-            instance_id: kani::any(),
-            sequence: kani::any(),
-            timestamp_ms: kani::any(),
-            payload: serde_json::json!({}),
-            metadata: serde_json::json!({}),
-        };
-
-        let result = registry.upcast_envelope(envelope.clone());
-
-        // If at MAX_VERSION, result should be Ok with unchanged envelope
-        assert_eq!(
-            result.as_ref().map(|e| e.schema_version),
-            Ok(envelope.schema_version),
-            "envelope at max version should return unchanged"
-        );
-        let upcasted = result.unwrap();
-        assert_eq!(upcasted.schema_version, envelope.schema_version);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // =============================================================================
 // Kani Proof: Circular chain detection terminates
 // =============================================================================
 
 /// Property: For any UpcasterRegistry with at most 255 registered upcasters,

*** result: Success
