*** crates/vo-core/src/upcaster/kani_harnesses.rs:45:13: replace verification::<impl Upcaster for MockUpcaster>::source_version -> u8 with 1

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::<impl Upcaster for MockUpcaster>::source_version -> u8 with 1
@@ -37,17 +37,17 @@
                 source_version: source,
                 target_version: target,
             })
         }
     }
 
     impl Upcaster for MockUpcaster {
         fn source_version(&self) -> u8 {
-            self.source_version
+            1 /* ~ changed by cargo-mutants ~ */
         }
 
         fn upcast(&self, input: &[u8]) -> Result<Vec<u8>, UpcasterError> {
             // Parse input envelope
             let json_str = std::str::from_utf8(input).unwrap();
             let value: serde_json::Value = serde_json::from_str(json_str).unwrap();
             let obj = value.as_object().unwrap().clone();

*** result: Success
