*** crates/vo-core/src/upcaster/kani_harnesses.rs:50:13: replace verification::<impl Upcaster for MockUpcaster>::upcast -> Result<Vec<u8>, UpcasterError> with Ok(vec![1])

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::<impl Upcaster for MockUpcaster>::upcast -> Result<Vec<u8>, UpcasterError> with Ok(vec![1])
@@ -42,28 +42,17 @@
 
     impl Upcaster for MockUpcaster {
         fn source_version(&self) -> u8 {
             self.source_version
         }
 
         fn upcast(&self, input: &[u8]) -> Result<Vec<u8>, UpcasterError> {
             // Parse input envelope
-            let json_str = std::str::from_utf8(input).unwrap();
-            let value: serde_json::Value = serde_json::from_str(json_str).unwrap();
-            let obj = value.as_object().unwrap().clone();
-
-            let mut new_obj = obj;
-            new_obj.insert(
-                "version".to_string(),
-                serde_json::json!(self.target_version),
-            );
-
-            let output = serde_json::to_vec(&new_obj).unwrap();
-            Ok(output)
+            Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
         }
     }
 
     struct MockRegistry {
         upcasters: std::collections::HashMap<u8, Box<dyn Upcaster>>,
         max_version: u8,
     }

*** result: Success
