*** crates/vo-core/src/upcaster/kani_harnesses.rs:81:13: replace verification::<impl UpcasterRegistry for MockRegistry>::register -> Result<(), UpcasterError> with Ok(())

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::<impl UpcasterRegistry for MockRegistry>::register -> Result<(), UpcasterError> with Ok(())
@@ -73,20 +73,17 @@
                 upcasters: std::collections::HashMap::new(),
                 max_version: MAX_SUPPORTED_VERSION,
             }
         }
     }
 
     impl UpcasterRegistry for MockRegistry {
         fn register(&self, upcaster: Box<dyn Upcaster>) -> Result<(), UpcasterError> {
-            let source_version = upcaster.source_version();
-            let mut upcasters = std::collections::HashMap::new();
-            upcasters.insert(source_version, upcaster);
-            Ok(())
+            Ok(()) /* ~ changed by cargo-mutants ~ */
         }
 
         fn upcast_envelope(&self, envelope: EventEnvelope) -> Result<EventEnvelope, UpcasterError> {
             if envelope.schema_version >= self.max_version {
                 return Ok(envelope);
             }
 
             let mut current_version = envelope.schema_version;

*** result: Success
