*** crates/vo-core/src/upcaster/kani_harnesses.rs:88:13: replace verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope -> Result<EventEnvelope, UpcasterError> with Ok(Default::default())

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope -> Result<EventEnvelope, UpcasterError> with Ok(Default::default())
@@ -80,74 +80,17 @@
         fn register(&self, upcaster: Box<dyn Upcaster>) -> Result<(), UpcasterError> {
             let source_version = upcaster.source_version();
             let mut upcasters = std::collections::HashMap::new();
             upcasters.insert(source_version, upcaster);
             Ok(())
         }
 
         fn upcast_envelope(&self, envelope: EventEnvelope) -> Result<EventEnvelope, UpcasterError> {
-            if envelope.schema_version >= self.max_version {
-                return Ok(envelope);
-            }
-
-            let mut current_version = envelope.schema_version;
-            let mut current_payload = envelope.payload.clone();
-
-            loop {
-                if current_version >= self.max_version {
-                    break;
-                }
-
-                let upcaster = match self.upcasters.get(&current_version) {
-                    Some(u) => u,
-                    None => return Err(UpcasterError::NoUpcasterRegistered(current_version)),
-                };
-
-                let mut envelope_json = serde_json::Map::new();
-                envelope_json.insert("version".to_string(), serde_json::json!(current_version));
-                envelope_json.insert(
-                    "instance_id".to_string(),
-                    serde_json::json!(envelope.instance_id.clone()),
-                );
-                envelope_json.insert("sequence".to_string(), serde_json::json!(envelope.sequence));
-                envelope_json.insert(
-                    "timestamp_ms".to_string(),
-                    serde_json::json!(envelope.timestamp_ms),
-                );
-                envelope_json.insert("payload".to_string(), current_payload);
-                envelope_json.insert("metadata".to_string(), envelope.metadata.clone());
-
-                let input_bytes = serde_json::to_vec(&envelope_json).unwrap();
-                let output_bytes = upcaster.upcast(&input_bytes).unwrap();
-
-                let output_json: serde_json::Value = serde_json::from_slice(&output_bytes).unwrap();
-                let output_obj = output_json.as_object().unwrap();
-
-                let new_version = output_obj.get("version").and_then(|v| v.as_u64()).unwrap() as u8;
-
-                if new_version > self.max_version {
-                    return Err(UpcasterError::InvalidTargetVersion(new_version));
-                }
-
-                current_version = new_version;
-                current_payload = output_obj
-                    .get("payload")
-                    .cloned()
-                    .unwrap_or(serde_json::Value::Null);
-            }
-
-            Ok(EventEnvelope {
-                schema_version: current_version,
-                instance_id: envelope.instance_id,
-                sequence: envelope.sequence,
-                timestamp_ms: envelope.timestamp_ms,
-                payload: current_payload,
-                metadata: envelope.metadata,
-            })
+            Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
         }
 
         fn max_supported_version(&self) -> u8 {
             self.max_version
         }
     }
 
     #[kani::proof]

*** result: Success
