*** crates/vo-core/src/upcaster/kani_harnesses.rs:88:40: replace >= with < in verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace >= with < in verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope
@@ -80,17 +80,17 @@
         fn register(&self, upcaster: Box<dyn Upcaster>) -> Result<(), UpcasterError> {
             let source_version = upcaster.source_version();
             let mut upcasters = std::collections::HashMap::new();
             upcasters.insert(source_version, upcaster);
             Ok(())
         }
 
         fn upcast_envelope(&self, envelope: EventEnvelope) -> Result<EventEnvelope, UpcasterError> {
-            if envelope.schema_version >= self.max_version {
+            if envelope.schema_version < /* ~ changed by cargo-mutants ~ */ self.max_version {
                 return Ok(envelope);
             }
 
             let mut current_version = envelope.schema_version;
             let mut current_payload = envelope.payload.clone();
 
             loop {
                 if current_version >= self.max_version {

*** result: Success
