*** crates/vo-core/src/upcaster/kani_harnesses.rs:96:36: replace >= with < in verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope

*** mutation diff:
--- crates/vo-core/src/upcaster/kani_harnesses.rs
+++ replace >= with < in verification::<impl UpcasterRegistry for MockRegistry>::upcast_envelope
@@ -88,17 +88,17 @@
             if envelope.schema_version >= self.max_version {
                 return Ok(envelope);
             }
 
             let mut current_version = envelope.schema_version;
             let mut current_payload = envelope.payload.clone();
 
             loop {
-                if current_version >= self.max_version {
+                if current_version < /* ~ changed by cargo-mutants ~ */ self.max_version {
                     break;
                 }
 
                 let upcaster = match self.upcasters.get(&current_version) {
                     Some(u) => u,
                     None => return Err(UpcasterError::NoUpcasterRegistered(current_version)),
                 };

*** result: Success
