*** crates/vo-core/src/upcaster/registry.rs:118:32: replace >= with < in <impl UpcasterRegistry for UpcasterRegistryImpl>::upcast_envelope

*** mutation diff:
--- crates/vo-core/src/upcaster/registry.rs
+++ replace >= with < in <impl UpcasterRegistry for UpcasterRegistryImpl>::upcast_envelope
@@ -110,17 +110,17 @@
 
         loop {
             // Check for circular chain - if we've seen this version before, error
             if visited.get(&current_version) == Some(&true) {
                 return Err(UpcasterError::CircularChain(current_version));
             }
 
             // If we've reached max version, we're done
-            if current_version >= self.max_version {
+            if current_version < /* ~ changed by cargo-mutants ~ */ self.max_version {
                 break;
             }
 
             let upcaster = upcasters
                 .get(&current_version)
                 .ok_or(UpcasterError::NoUpcasterRegistered(current_version))?;
 
             // Serialize current state as envelope JSON for upcaster input

*** result: Success
