*** crates/vo-core/src/upcaster/registry.rs:208:9: replace <impl UpcasterRegistry for UpcasterRegistryImpl>::max_supported_version -> u8 with 0

*** mutation diff:
--- crates/vo-core/src/upcaster/registry.rs
+++ replace <impl UpcasterRegistry for UpcasterRegistryImpl>::max_supported_version -> u8 with 0
@@ -200,17 +200,17 @@
             timestamp_ms: envelope.timestamp_ms,
             payload: current_payload,
             metadata: envelope.metadata,
         })
     }
 
     /// Get the current maximum supported version.
     fn max_supported_version(&self) -> u8 {
-        self.max_version
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // =============================================================================
 // Builder Implementation: DefaultUpcasterRegistryBuilder
 // =============================================================================
 
 /// Builder for constructing an UpcasterRegistryImpl.

*** result: Success
