*** crates/vo-core/src/upcaster/registry.rs:58:9: replace <impl UpcasterRegistry for UpcasterRegistryImpl>::register -> Result<(), UpcasterError> with Ok(())

*** mutation diff:
--- crates/vo-core/src/upcaster/registry.rs
+++ replace <impl UpcasterRegistry for UpcasterRegistryImpl>::register -> Result<(), UpcasterError> with Ok(())
@@ -50,35 +50,17 @@
     /// # Errors
     ///
     /// Returns `UpcasterError::InvalidTargetVersion` if the source version exceeds
     /// the maximum supported version.
     ///
     /// Returns `UpcasterError::NoUpcasterRegistered` if an upcaster is already
     /// registered for the given source version.
     fn register(&self, upcaster: Box<dyn Upcaster>) -> Result<(), UpcasterError> {
-        let source_version = upcaster.source_version();
-
-        // Reject upcasters whose source version is at or above max
-        // (since upcasters produce source_version + 1, this would exceed max)
-        if source_version >= self.max_version {
-            return Err(UpcasterError::InvalidTargetVersion(source_version));
-        }
-
-        let mut upcasters = self
-            .upcasters
-            .lock()
-            .map_err(|_| UpcasterError::UpcastingFailed("lock poisoned".to_string()))?;
-
-        if upcasters.contains_key(&source_version) {
-            return Err(UpcasterError::NoUpcasterRegistered(source_version));
-        }
-
-        upcasters.insert(source_version, upcaster);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolve the upcaster chain and apply all necessary transforms.
     ///
     /// # Errors
     ///
     /// Returns `UpcasterError::NoUpcasterRegistered` if no upcaster is registered
     /// for the current envelope version.

*** result: Success
