*** crates/vo-core/src/upcaster/registry.rs:62:27: replace >= with < in <impl UpcasterRegistry for UpcasterRegistryImpl>::register

*** mutation diff:
--- crates/vo-core/src/upcaster/registry.rs
+++ replace >= with < in <impl UpcasterRegistry for UpcasterRegistryImpl>::register
@@ -54,17 +54,17 @@
     ///
     /// Returns `UpcasterError::NoUpcasterRegistered` if an upcaster is already
     /// registered for the given source version.
     fn register(&self, upcaster: Box<dyn Upcaster>) -> Result<(), UpcasterError> {
         let source_version = upcaster.source_version();
 
         // Reject upcasters whose source version is at or above max
         // (since upcasters produce source_version + 1, this would exceed max)
-        if source_version >= self.max_version {
+        if source_version < /* ~ changed by cargo-mutants ~ */ self.max_version {
             return Err(UpcasterError::InvalidTargetVersion(source_version));
         }
 
         let mut upcasters = self
             .upcasters
             .lock()
             .map_err(|_| UpcasterError::UpcastingFailed("lock poisoned".to_string()))?;

*** result: Success
