*** crates/vo-core/src/workflow_version.rs:52:9: replace WorkflowVersion::binary_path -> &str with ""

*** mutation diff:
--- crates/vo-core/src/workflow_version.rs
+++ replace WorkflowVersion::binary_path -> &str with ""
@@ -44,17 +44,17 @@
             registered_at,
             binary_path,
         })
     }
 
     /// Returns the binary path for this version.
     #[must_use]
     pub fn binary_path(&self) -> &str {
-        &self.binary_path
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn name(&self) -> &WorkflowName {
         &self.name
     }
 
     #[must_use]

---- workflow_version::tests::binary_path_returns_string_starting_with_prefix stdout ----

thread 'workflow_version::tests::binary_path_returns_string_starting_with_prefix' (225578) panicked at crates/vo-core/src/workflow_version.rs:155:9:
assertion failed: path.starts_with("/var/wtf/versions/")

---- workflow_version::tests::new_creates_version_with_correct_binary_path_format stdout ----

thread 'workflow_version::tests::new_creates_version_with_correct_binary_path_format' (225579) panicked at crates/vo-core/src/workflow_version.rs:92:9:
assertion `left == right` failed
  left: ""
 right: "/var/wtf/versions/aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa/my-workflow"

failures:
    workflow_version::tests::binary_path_returns_string_starting_with_prefix
    workflow_version::tests::new_creates_version_with_correct_binary_path_format

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
