*** crates/vo-core/src/workflow_version.rs:73:9: replace WorkflowVersion::schema_version -> u16 with 0

*** mutation diff:
--- crates/vo-core/src/workflow_version.rs
+++ replace WorkflowVersion::schema_version -> u16 with 0
@@ -65,17 +65,17 @@
     #[must_use]
     pub fn registered_at(&self) -> TimestampMs {
         self.registered_at
     }
 
     /// Returns the schema version for serialization compatibility.
     #[must_use]
     pub const fn schema_version(&self) -> u16 {
-        self.schema_version
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use vo_types::{BinaryHash, TimestampMs, WorkflowName};
 
     #[test]

---- workflow_version::tests::new_sets_schema_version_to_one stdout ----

thread 'workflow_version::tests::new_sets_schema_version_to_one' (233171) panicked at crates/vo-core/src/workflow_version.rs:105:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    workflow_version::tests::new_sets_schema_version_to_one

test result: FAILED. 294 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
