*** crates/vo-core/src/workflow_version.rs:73:9: replace WorkflowVersion::schema_version -> u16 with 1

*** mutation diff:
--- crates/vo-core/src/workflow_version.rs
+++ replace WorkflowVersion::schema_version -> u16 with 1
@@ -65,17 +65,17 @@
     #[must_use]
     pub fn registered_at(&self) -> TimestampMs {
         self.registered_at
     }
 
     /// Returns the schema version for serialization compatibility.
     #[must_use]
     pub const fn schema_version(&self) -> u16 {
-        self.schema_version
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use vo_types::{BinaryHash, TimestampMs, WorkflowName};
 
     #[test]

*** result: Success
