*** crates/vo-core/src/write_class.rs:100:13: delete match arm "bulk_blob" in WriteClass::parse

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ delete match arm "bulk_blob" in WriteClass::parse
@@ -92,17 +92,17 @@
     ///
     /// # Errors
     /// Returns `Err(Error::UnknownWriteClass)` for any other string,
     /// including empty strings and case-mismatched variants.
     pub fn parse(s: &str) -> Result<WriteClass, Error> {
         match s {
             "critical_control_plane" => Ok(WriteClass::CriticalControlPlane),
             "operator_projection" => Ok(WriteClass::OperatorProjection),
-            "bulk_blob" => Ok(WriteClass::BulkBlob),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(Error::UnknownWriteClass(s.to_string())),
         }
     }
 
     /// Returns the canonical name of the write class.
     ///
     /// # Returns
     /// - `"critical_control_plane"` for `CriticalControlPlane`

---- write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-veloxide-lTWIsz.tmp/crates/vo-core/proptest-regressions/write_class.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc c47d07b4a51e1353952a0ef5176c9300d3fe0941fb0d09f8b8a2e476450ae3e9

thread 'write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str' (253790) panicked at crates/vo-core/src/write_class.rs:595:5:
Test failed: assertion failed: `(left == right)` 
  left: `Err(UnknownWriteClass("bulk_blob"))`,
 right: `Ok(BulkBlob)` at crates/vo-core/src/write_class.rs:604.
minimal failing input: variant = BulkBlob
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_class_parses_bulk_blob_from_str stdout ----

thread 'write_class::write_class_tests::write_class_parses_bulk_blob_from_str' (253947) panicked at crates/vo-core/src/write_class.rs:300:9:
assertion `left == right` failed
  left: Err(UnknownWriteClass("bulk_blob"))
 right: Ok(BulkBlob)

failures:
    write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str
    write_class::write_class_tests::write_class_parses_bulk_blob_from_str

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
