*** crates/vo-core/src/write_class.rs:112:9: replace WriteClass::as_str -> &'static str with ""

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteClass::as_str -> &'static str with ""
@@ -104,21 +104,17 @@
 
     /// Returns the canonical name of the write class.
     ///
     /// # Returns
     /// - `"critical_control_plane"` for `CriticalControlPlane`
     /// - `"operator_projection"` for `OperatorProjection`
     /// - `"bulk_blob"` for `BulkBlob`
     pub fn as_str(self) -> &'static str {
-        match self {
-            WriteClass::CriticalControlPlane => "critical_control_plane",
-            WriteClass::OperatorProjection => "operator_projection",
-            WriteClass::BulkBlob => "bulk_blob",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for WriteClass {
     type Err = Error;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         WriteClass::parse(s)

---- write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str stdout ----

thread 'write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str' (259919) panicked at crates/vo-core/src/write_class.rs:591:5:
Test failed: assertion failed: `(left == right)` 
  left: `Err(UnknownWriteClass(""))`,
 right: `Ok(CriticalControlPlane)` at crates/vo-core/src/write_class.rs:600.
minimal failing input: variant = CriticalControlPlane
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_class_as_str_returns_bulk_blob_when_bulk_blob stdout ----

thread 'write_class::write_class_tests::write_class_as_str_returns_bulk_blob_when_bulk_blob' (259945) panicked at crates/vo-core/src/write_class.rs:342:9:
assertion `left == right` failed
  left: ""
 right: "bulk_blob"

---- write_class::write_class_tests::write_class_as_str_returns_critical_control_plane_when_critical_control_plane stdout ----

thread 'write_class::write_class_tests::write_class_as_str_returns_critical_control_plane_when_critical_control_plane' (259947) panicked at crates/vo-core/src/write_class.rs:330:9:
assertion `left == right` failed
  left: ""
 right: "critical_control_plane"

failures:
    write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str
    write_class::write_class_tests::write_class_as_str_returns_bulk_blob_when_bulk_blob
    write_class::write_class_tests::write_class_as_str_returns_critical_control_plane_when_critical_control_plane
    write_class::write_class_tests::write_class_as_str_returns_operator_projection_when_operator_projection

test result: FAILED. 291 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
