*** crates/vo-core/src/write_class.rs:175:9: replace WriteBudget::remaining -> u64 with 1

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteBudget::remaining -> u64 with 1
@@ -167,25 +167,17 @@
     /// Returns the remaining budget for a given class.
     ///
     /// # Arguments
     /// * `class` - The write class to query
     ///
     /// # Returns
     /// The number of bytes remaining in the budget for that class.
     pub fn remaining(&self, class: WriteClass) -> u64 {
-        match class {
-            WriteClass::CriticalControlPlane => self
-                .critical_limit
-                .saturating_sub(*self.critical_used.borrow()),
-            WriteClass::OperatorProjection => self
-                .projection_limit
-                .saturating_sub(*self.projection_used.borrow()),
-            WriteClass::BulkBlob => self.blob_limit.saturating_sub(*self.blob_used.borrow()),
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checks if a write of the given class would exceed available budget.
     ///
     /// # Arguments
     /// * `class` - The write class to check
     /// * `size_bytes` - The size of the write in bytes
     ///

---- write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted' (269551) panicked at crates/vo-core/src/write_class.rs:432:9:
assertion failed: !budget.can_write(WriteClass::CriticalControlPlane, 1)

---- write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit' (269554) panicked at crates/vo-core/src/write_class.rs:405:9:
assertion failed: budget.can_write(WriteClass::CriticalControlPlane, 50)

---- write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit' (269553) panicked at crates/vo-core/src/write_class.rs:411:9:
assertion failed: budget.can_write(WriteClass::CriticalControlPlane, 100)

failures:
    write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted
    write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit
    write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit
    write_class::write_class_tests::write_budget_creates_with_given_limits
    write_class::write_class_tests::write_budget_creates_with_max_limits
    write_class::write_class_tests::write_budget_creates_with_zero_limits
    write_class::write_class_tests::write_budget_remaining_returns_correct_initial_values
    write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion
    write_class::write_class_tests::write_budget_remaining_unchanged_after_failed_reserve
    write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success
    write_class::write_class_tests::write_budget

test result: FAILED. 281 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
