*** crates/vo-core/src/write_class.rs:196:9: replace WriteBudget::can_write -> bool with false

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteBudget::can_write -> bool with false
@@ -188,17 +188,17 @@
     /// # Arguments
     /// * `class` - The write class to check
     /// * `size_bytes` - The size of the write in bytes
     ///
     /// # Returns
     /// `true` if the write would fit within the remaining budget for that class.
     /// Zero-byte writes always return `true`.
     pub fn can_write(&self, class: WriteClass, size_bytes: u64) -> bool {
-        self.remaining(class) >= size_bytes
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reserves budget for a write.
     ///
     /// # Arguments
     /// * `class` - The write class
     /// * `size_bytes` - The size of the write in bytes
     ///

---- write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent stdout ----

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (275588) panicked at crates/vo-core/src/write_class.rs:653:5:
Test failed: assertion failed: `(left == right)` 
  left: `false`, 
 right: `true`: can_write returned false but reserve returned Ok(()) at crates/vo-core/src/write_class.rs:667.
minimal failing input: critical = 791, _projection = 1, _blob = 1, size = 0
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit' (275608) panicked at crates/vo-core/src/write_class.rs:419:9:
assertion failed: budget.can_write(WriteClass::CriticalControlPlane, 100)

---- write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit' (275609) panicked at crates/vo-core/src/write_class.rs:413:9:
assertion failed: budget.can_write(WriteClass::CriticalControlPlane, 50)

failures:
    write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent
    write_class::write_class_tests::write_budget_can_write_returns_true_when_at_exact_limit
    write_class::write_class_tests::write_budget_can_write_returns_true_when_under_limit
    write_class::write_class_tests::write_budget_can_write_returns_true_when_zero_bytes

test result: FAILED. 291 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
