*** crates/vo-core/src/write_class.rs:209:9: replace WriteBudget::reserve -> Result<(), Error> with Ok(())

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteBudget::reserve -> Result<(), Error> with Ok(())
@@ -201,39 +201,17 @@
     /// # Arguments
     /// * `class` - The write class
     /// * `size_bytes` - The size of the write in bytes
     ///
     /// # Errors
     /// Returns `Err(Error::BudgetExceeded)` if the write would exceed
     /// the available budget for that class.
     pub fn reserve(&self, class: WriteClass, size_bytes: u64) -> Result<(), Error> {
-        let remaining = self.remaining(class);
-        if remaining < size_bytes {
-            return Err(Error::BudgetExceeded {
-                class,
-                requested: size_bytes,
-                available: remaining,
-            });
-        }
-
-        // Mutate internal state via RefCell
-        match class {
-            WriteClass::CriticalControlPlane => {
-                *self.critical_used.borrow_mut() += size_bytes;
-            }
-            WriteClass::OperatorProjection => {
-                *self.projection_used.borrow_mut() += size_bytes;
-            }
-            WriteClass::BulkBlob => {
-                *self.blob_used.borrow_mut() += size_bytes;
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Unit Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]

---- write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted' (281320) panicked at crates/vo-core/src/write_class.rs:418:9:
assertion failed: !budget.can_write(WriteClass::CriticalControlPlane, 1)

---- write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent stdout ----

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (281289) panicked at crates/vo-core/src/write_class.rs:631:5:
Test failed: assertion failed: `(left == right)` 
  left: `false`, 
 right: `true`: can_write returned false but reserve returned Ok(()) at crates/vo-core/src/write_class.rs:645.
minimal failing input: critical = 1, _projection = 1, _blob = 1, size = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion stdout ----

thread 'write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion' (281335) panicked at crates/vo-core/src/write_class.rs:490:9:
assertion `left == right` failed
  left: 100
 right: 0

failures:
    write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent
    write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted
    write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion
    write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success
    write_class::write_class_tests::write_budget_reserve_returns_budget_exceeded_when_exhausted_plus_one
    write_class::write_class_tests::write_budget_reserve_returns_budget_exceeded_when_over_limit
    write_class::write_class_tests::write_budget_reserve_succeeds_when_at_exact_limit

test result: FAILED. 288 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
