*** crates/vo-core/src/write_class.rs:221:50: replace += with -= in WriteBudget::reserve

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace += with -= in WriteBudget::reserve
@@ -213,17 +213,17 @@
                 requested: size_bytes,
                 available: remaining,
             });
         }
 
         // Mutate internal state via RefCell
         match class {
             WriteClass::CriticalControlPlane => {
-                *self.critical_used.borrow_mut() += size_bytes;
+                *self.critical_used.borrow_mut() -= /* ~ changed by cargo-mutants ~ */ size_bytes;
             }
             WriteClass::OperatorProjection => {
                 *self.projection_used.borrow_mut() += size_bytes;
             }
             WriteClass::BulkBlob => {
                 *self.blob_used.borrow_mut() += size_bytes;
             }
         }

---- write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent stdout ----

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (293289) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (293289) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (293289) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent' (293289) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt t

---- write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining stdout ----

thread 'write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining' (293290) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining' (293290) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining' (293290) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

thread 'write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining' (293290) panicked at crates/vo-core/src/write_c

---- write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion stdout ----

thread 'write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion' (293309) panicked at crates/vo-core/src/write_class.rs:221:17:
attempt to subtract with overflow

failures:
    write_class::proptest_write_class_invariants::write_budget_can_write_and_reserve_are_consistent
    write_class::proptest_write_class_invariants::write_budget_reserve_never_produces_negative_remaining
    write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted
    write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion
    write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success
    write_class::write_class_tests::write_budget_reserve_returns_budget_exceeded_when_exhausted_plus_one
    write_class::write_class_tests::write_budget_reserve_succeeds_when_at_exact_limit

test result: FAILED. 288 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
