*** crates/vo-core/src/write_class.rs:221:50: replace += with *= in WriteBudget::reserve

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace += with *= in WriteBudget::reserve
@@ -213,17 +213,17 @@
                 requested: size_bytes,
                 available: remaining,
             });
         }
 
         // Mutate internal state via RefCell
         match class {
             WriteClass::CriticalControlPlane => {
-                *self.critical_used.borrow_mut() += size_bytes;
+                *self.critical_used.borrow_mut() *= /* ~ changed by cargo-mutants ~ */ size_bytes;
             }
             WriteClass::OperatorProjection => {
                 *self.projection_used.borrow_mut() += size_bytes;
             }
             WriteClass::BulkBlob => {
                 *self.blob_used.borrow_mut() += size_bytes;
             }
         }

---- write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted stdout ----

thread 'write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted' (295708) panicked at crates/vo-core/src/write_class.rs:440:9:
assertion failed: !budget.can_write(WriteClass::CriticalControlPlane, 1)

---- write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion stdout ----

thread 'write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion' (295724) panicked at crates/vo-core/src/write_class.rs:512:9:
assertion `left == right` failed
  left: 100
 right: 0

---- write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success stdout ----

thread 'write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success' (295728) panicked at crates/vo-core/src/write_class.rs:450:9:
assertion `left == right` failed
  left: 100
 right: 70

failures:
    write_class::write_class_tests::write_budget_can_write_returns_false_when_exhausted
    write_class::write_class_tests::write_budget_remaining_returns_zero_after_exhaustion
    write_class::write_class_tests::write_budget_reserve_deducts_bytes_on_success
    write_class::write_class_tests::write_budget_reserve_returns_budget_exceeded_when_exhausted_plus_one
    write_class::write_class_tests::write_budget_reserve_succeeds_when_at_exact_limit

test result: FAILED. 290 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
