*** crates/vo-core/src/write_class.rs:224:52: replace += with *= in WriteBudget::reserve

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace += with *= in WriteBudget::reserve
@@ -216,17 +216,17 @@
         }
 
         // Mutate internal state via RefCell
         match class {
             WriteClass::CriticalControlPlane => {
                 *self.critical_used.borrow_mut() += size_bytes;
             }
             WriteClass::OperatorProjection => {
-                *self.projection_used.borrow_mut() += size_bytes;
+                *self.projection_used.borrow_mut() *= /* ~ changed by cargo-mutants ~ */ size_bytes;
             }
             WriteClass::BulkBlob => {
                 *self.blob_used.borrow_mut() += size_bytes;
             }
         }
 
         Ok(())
     }

---- write_budget_multiple_reserves_across_classes stdout ----

thread 'write_budget_multiple_reserves_across_classes' (306721) panicked at crates/vo-core/tests/write_class_integration.rs:80:5:
assertion `left == right` failed
  left: 200
 right: 150

failures:
    write_budget_multiple_reserves_across_classes

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
