*** crates/vo-core/src/write_class.rs:71:9: replace WriteClass::tier -> u8 with 0

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteClass::tier -> u8 with 0
@@ -63,21 +63,17 @@
 impl WriteClass {
     /// Returns the QoS tier number (1=critical, 2=projection, 3=blob).
     ///
     /// # Returns
     /// - `1` for `CriticalControlPlane`
     /// - `2` for `OperatorProjection`
     /// - `3` for `BulkBlob`
     pub fn tier(self) -> u8 {
-        match self {
-            WriteClass::CriticalControlPlane => 1,
-            WriteClass::OperatorProjection => 2,
-            WriteClass::BulkBlob => 3,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     ///
     /// Only `CriticalControlPlane` returns `true`.
     pub fn never_drops(self) -> bool {
         matches!(self, WriteClass::CriticalControlPlane)
     }

---- write_class::proptest_write_class_invariants::write_class_tier_always_returns_1_2_or_3 stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-veloxide-v6pbSE.tmp/crates/vo-core/proptest-regressions/write_class.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc b5c06ec3d3887a53f7c8ca48bcf511f661b136e9d841f0da9572524de2ddcee0

thread 'write_class::proptest_write_class_invariants::write_class_tier_always_returns_1_2_or_3' (237011) panicked at crates/vo-core/src/write_class.rs:562:5:
Test failed: tier() must be 1, 2, or 3, got 0 at crates/vo-core/src/write_class.rs:570.
minimal failing input: variant = CriticalControlPlane
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_class_returns_tier_1_when_critical_control_plane stdout ----

thread 'write_class::write_class_tests::write_class_returns_tier_1_when_critical_control_plane' (237082) panicked at crates/vo-core/src/write_class.rs:244:9:
assertion `left == right` failed
  left: 0
 right: 1

---- write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection stdout ----

thread 'write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection' (237085) panicked at crates/vo-core/src/write_class.rs:250:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    write_class::proptest_write_class_invariants::write_class_tier_always_returns_1_2_or_3
    write_class::write_class_tests::write_class_returns_tier_1_when_critical_control_plane
    write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection
    write_class::write_class_tests::write_class_returns_tier_3_when_bulk_blob

test result: FAILED. 291 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
