*** crates/vo-core/src/write_class.rs:71:9: replace WriteClass::tier -> u8 with 1

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteClass::tier -> u8 with 1
@@ -63,21 +63,17 @@
 impl WriteClass {
     /// Returns the QoS tier number (1=critical, 2=projection, 3=blob).
     ///
     /// # Returns
     /// - `1` for `CriticalControlPlane`
     /// - `2` for `OperatorProjection`
     /// - `3` for `BulkBlob`
     pub fn tier(self) -> u8 {
-        match self {
-            WriteClass::CriticalControlPlane => 1,
-            WriteClass::OperatorProjection => 2,
-            WriteClass::BulkBlob => 3,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     ///
     /// Only `CriticalControlPlane` returns `true`.
     pub fn never_drops(self) -> bool {
         matches!(self, WriteClass::CriticalControlPlane)
     }

---- write_class::write_class_tests::write_class_returns_tier_3_when_bulk_blob stdout ----

thread 'write_class::write_class_tests::write_class_returns_tier_3_when_bulk_blob' (241344) panicked at crates/vo-core/src/write_class.rs:256:9:
assertion `left == right` failed
  left: 1
 right: 3

---- write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection stdout ----

thread 'write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection' (241343) panicked at crates/vo-core/src/write_class.rs:250:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    write_class::write_class_tests::write_class_returns_tier_2_when_operator_projection
    write_class::write_class_tests::write_class_returns_tier_3_when_bulk_blob

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
