*** crates/vo-core/src/write_class.rs:82:9: replace WriteClass::never_drops -> bool with true

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteClass::never_drops -> bool with true
@@ -74,17 +74,17 @@
             WriteClass::BulkBlob => 3,
         }
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     ///
     /// Only `CriticalControlPlane` returns `true`.
     pub fn never_drops(self) -> bool {
-        matches!(self, WriteClass::CriticalControlPlane)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parses a string into a `WriteClass`.
     ///
     /// # Arguments
     /// * `s` - The string to parse. Must be one of:
     ///   - `"critical_control_plane"` → `Ok(WriteClass::CriticalControlPlane)`
     ///   - `"operator_projection"` → `Ok(WriteClass::OperatorProjection)`

---- write_class::write_class_tests::write_class_never_drops_returns_false_when_operator_projection stdout ----

thread 'write_class::write_class_tests::write_class_never_drops_returns_false_when_operator_projection' (244582) panicked at crates/vo-core/src/write_class.rs:274:9:
assertion failed: !wc.never_drops()

---- write_class::write_class_tests::write_class_never_drops_returns_false_when_bulk_blob stdout ----

thread 'write_class::write_class_tests::write_class_never_drops_returns_false_when_bulk_blob' (244581) panicked at crates/vo-core/src/write_class.rs:280:9:
assertion failed: !wc.never_drops()

---- write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane stdout ----

thread 'write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane' (244547) panicked at crates/vo-core/src/write_class.rs:579:5:
Test failed: assertion failed: `(left == right)` 
  left: `true`, 
 right: `false`: never_drops() should be false for OperatorProjection, got true at crates/vo-core/src/write_class.rs:588.
minimal failing input: variant = OperatorProjection
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane
    write_class::write_class_tests::write_class_never_drops_returns_false_when_bulk_blob
    write_class::write_class_tests::write_class_never_drops_returns_false_when_operator_projection

test result: FAILED. 292 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
