*** crates/vo-core/src/write_class.rs:82:9: replace WriteClass::never_drops -> bool with false

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ replace WriteClass::never_drops -> bool with false
@@ -74,17 +74,17 @@
             WriteClass::BulkBlob => 3,
         }
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     ///
     /// Only `CriticalControlPlane` returns `true`.
     pub fn never_drops(self) -> bool {
-        matches!(self, WriteClass::CriticalControlPlane)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Parses a string into a `WriteClass`.
     ///
     /// # Arguments
     /// * `s` - The string to parse. Must be one of:
     ///   - `"critical_control_plane"` → `Ok(WriteClass::CriticalControlPlane)`
     ///   - `"operator_projection"` → `Ok(WriteClass::OperatorProjection)`

---- write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-veloxide-lTWIsz.tmp/crates/vo-core/proptest-regressions/write_class.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc c160b7c6effb27e513e36c67a75cb192f24d589365da2d4982d128a164973950

thread 'write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane' (246059) panicked at crates/vo-core/src/write_class.rs:579:5:
Test failed: assertion failed: `(left == right)` 
  left: `false`, 
 right: `true`: never_drops() should be true for CriticalControlPlane, got false at crates/vo-core/src/write_class.rs:588.
minimal failing input: variant = CriticalControlPlane
	succes

---- write_class::write_class_tests::write_class_never_drops_returns_true_when_critical_control_plane stdout ----

thread 'write_class::write_class_tests::write_class_never_drops_returns_true_when_critical_control_plane' (246087) panicked at crates/vo-core/src/write_class.rs:268:9:
assertion failed: wc.never_drops()

failures:
    write_class::proptest_write_class_invariants::write_class_never_drops_true_only_for_critical_control_plane
    write_class::write_class_tests::write_class_never_drops_returns_true_when_critical_control_plane

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
