*** crates/vo-core/src/write_class.rs:98:13: delete match arm "critical_control_plane" in WriteClass::parse

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ delete match arm "critical_control_plane" in WriteClass::parse
@@ -90,17 +90,17 @@
     ///   - `"operator_projection"` → `Ok(WriteClass::OperatorProjection)`
     ///   - `"bulk_blob"` → `Ok(WriteClass::BulkBlob)`
     ///
     /// # Errors
     /// Returns `Err(Error::UnknownWriteClass)` for any other string,
     /// including empty strings and case-mismatched variants.
     pub fn parse(s: &str) -> Result<WriteClass, Error> {
         match s {
-            "critical_control_plane" => Ok(WriteClass::CriticalControlPlane),
+             /* ~ changed by cargo-mutants ~ */
             "operator_projection" => Ok(WriteClass::OperatorProjection),
             "bulk_blob" => Ok(WriteClass::BulkBlob),
             _ => Err(Error::UnknownWriteClass(s.to_string())),
         }
     }
 
     /// Returns the canonical name of the write class.
     ///

---- write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-veloxide-v6pbSE.tmp/crates/vo-core/proptest-regressions/write_class.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc c90603db176be800940d431b6b4bbaf65fd1bd2666b731803aa15b71c0228f4a

thread 'write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str' (252288) panicked at crates/vo-core/src/write_class.rs:595:5:
Test failed: assertion failed: `(left == right)` 
  left: `Err(UnknownWriteClass("critical_control_plane"))`,
 right: `Ok(CriticalControlPlane)` at crates/vo-core/src/write_class.rs:604.
minimal failing input: variant = CriticalControlPlane
	successes: 0
	local rejects: 0
	global rejects: 0

---- write_class::write_class_tests::write_class_parses_critical_control_plane_from_str stdout ----

thread 'write_class::write_class_tests::write_class_parses_critical_control_plane_from_str' (252321) panicked at crates/vo-core/src/write_class.rs:288:9:
assertion `left == right` failed
  left: Err(UnknownWriteClass("critical_control_plane"))
 right: Ok(CriticalControlPlane)

failures:
    write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str
    write_class::write_class_tests::write_class_parses_critical_control_plane_from_str

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
