*** crates/vo-core/src/write_class.rs:99:13: delete match arm "operator_projection" in WriteClass::parse

*** mutation diff:
--- crates/vo-core/src/write_class.rs
+++ delete match arm "operator_projection" in WriteClass::parse
@@ -91,17 +91,17 @@
     ///   - `"bulk_blob"` → `Ok(WriteClass::BulkBlob)`
     ///
     /// # Errors
     /// Returns `Err(Error::UnknownWriteClass)` for any other string,
     /// including empty strings and case-mismatched variants.
     pub fn parse(s: &str) -> Result<WriteClass, Error> {
         match s {
             "critical_control_plane" => Ok(WriteClass::CriticalControlPlane),
-            "operator_projection" => Ok(WriteClass::OperatorProjection),
+             /* ~ changed by cargo-mutants ~ */
             "bulk_blob" => Ok(WriteClass::BulkBlob),
             _ => Err(Error::UnknownWriteClass(s.to_string())),
         }
     }
 
     /// Returns the canonical name of the write class.
     ///
     /// # Returns

---- write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str stdout ----
proptest: Saving this and future failures in /tmp/cargo-mutants-veloxide-3fk0Xr.tmp/crates/vo-core/proptest-regressions/write_class.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc ba932c7413f3dd5c0827fcc215363385c8f5f45d1d5ef16bfd1bf979d72fdb10

thread 'write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str' (254215) panicked at crates/vo-core/src/write_class.rs:595:5:
Test failed: assertion failed: `(left == right)` 
  left: `Err(UnknownWriteClass("operator_projection"))`,
 right: `Ok(OperatorProjection)` at crates/vo-core/src/write_class.rs:604.
minimal failing input: variant = OperatorProjection
	successes: 0
	local rejects: 0
	global reject

---- write_class::write_class_tests::write_class_parses_operator_projection_from_str stdout ----

thread 'write_class::write_class_tests::write_class_parses_operator_projection_from_str' (254284) panicked at crates/vo-core/src/write_class.rs:294:9:
assertion `left == right` failed
  left: Err(UnknownWriteClass("operator_projection"))
 right: Ok(OperatorProjection)

failures:
    write_class::proptest_write_class_invariants::write_class_as_str_roundtrips_through_from_str
    write_class::write_class_tests::write_class_parses_operator_projection_from_str

test result: FAILED. 293 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
