*** crates/vo-executor/src/lib.rs:209:46: replace * with + in RetryPolicy::calculate_backoff_delay

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace * with + in RetryPolicy::calculate_backoff_delay
@@ -201,17 +201,17 @@
     ///
     /// Returns `u64::MAX` if the calculation would overflow.
     #[must_use]
     #[allow(clippy::cast_possible_truncation, clippy::cast_sign_loss)]
     pub fn calculate_backoff_delay(&self, attempt: u32) -> u64 {
         let exponent = attempt.saturating_sub(1).cast_signed();
         let multiplier_pow = self.backoff_multiplier.powi(exponent);
         #[allow(clippy::cast_precision_loss)]
-        let product = self.backoff_ms as f64 * multiplier_pow;
+        let product = self.backoff_ms as f64 + /* ~ changed by cargo-mutants ~ */ multiplier_pow;
         // Clamp to u64::MAX to prevent overflow
         #[allow(clippy::cast_precision_loss)]
         let clamped = product.min(u64::MAX as f64);
         clamped as u64
     }
 }
 
 impl StepResult {

---- integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff stdout ----

thread 'integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff' (3701500) panicked at crates/vo-executor/tests/integration_tests.rs:342:9:
assertion `left == right` failed
  left: 1
 right: 0

---- integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values stdout ----

thread 'integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values' (3701498) panicked at crates/vo-executor/tests/integration_tests.rs:331:9:
assertion `left == right` failed
  left: 101
 right: 100

---- integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3 stdout ----

thread 'integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3' (3701483) panicked at crates/vo-executor/tests/integration_tests.rs:796:9:
Expected at least ~300ms of backoff sleep (2 sleeps) for max_attempts=3, got 205ms. If `>` was changed to `==`, only one sleep (100ms) would occur.

failures:
    integration_tests::execute_step_with_retry_verifies_backoff_timing
    integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3
    integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values
    integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff

test result: FAILED. 48 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
