*** crates/vo-executor/src/lib.rs:221:9: replace StepResult::is_success -> bool with true

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace StepResult::is_success -> bool with true
@@ -213,17 +213,17 @@
         clamped as u64
     }
 }
 
 impl StepResult {
     /// Check if the step result indicates success.
     #[must_use]
     pub fn is_success(&self) -> bool {
-        matches!(self, StepResult::Success { .. })
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ExecutionStatus {
     /// Check if the status indicates ready state.
     #[must_use]
     pub fn is_ready(&self) -> bool {
         matches!(self, ExecutionStatus::Ready)

---- step_result_tests::step_result_is_success_returns_false_for_failure_variant stdout ----

thread 'step_result_tests::step_result_is_success_returns_false_for_failure_variant' (3702254) panicked at crates/vo-executor/tests/execute_node_tests.rs:146:9:
assertion failed: !result.is_success()

failures:
    step_result_tests::step_result_is_success_returns_false_for_failure_variant

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
