*** crates/vo-executor/src/lib.rs:271:5: replace set_state with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace set_state with ()
@@ -263,17 +263,17 @@
 
 /// Get current state for a step.
 fn get_state(step_id: &str) -> StepState {
     STATE.get(step_id).map_or(StepState::Ready, |v| v.clone())
 }
 
 /// Set state for a step.
 fn set_state(step_id: &str, state: StepState) {
-    STATE.insert(step_id.to_string(), state);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Clear any stored error for a step.
 ///pub for testing
 pub fn clear_error(step_id: &str) {
     LAST_ERROR.remove(step_id);
 }

---- integration_tests::get_execution_status_returns_cancelled_after_cancel stdout ----

thread 'integration_tests::get_execution_status_returns_cancelled_after_cancel' (3706722) panicked at crates/vo-executor/tests/integration_tests.rs:186:22:
Expected Cancelled status, got Ready

failures:
    integration_tests::get_execution_status_returns_cancelled_after_cancel

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
