*** crates/vo-executor/src/lib.rs:289:9: delete match arm "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" in step_behavior

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ delete match arm "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" in step_behavior
@@ -281,19 +281,17 @@
 ///pub for testing
 pub fn set_error(step_id: &str, err: ExecuteNodeError) {
     LAST_ERROR.insert(step_id.to_string(), err);
 }
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
-        "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
-            StepBehavior::Success
-        }
+         /* ~ changed by cargo-mutants ~ */
         "step-fail" => StepBehavior::Failure,
         "step-transient" | "step-flaky" => StepBehavior::Transient,
         "step-slow" => StepBehavior::Slow,
         _ => StepBehavior::NotFound,
     }
 }
 
 #[derive(Debug, Clone, Copy)]

---- integration_tests::execute_step_on_already_executing_step_returns_invalid_transition stdout ----

thread 'integration_tests::execute_step_on_already_executing_step_returns_invalid_transition' (3707561) panicked at crates/vo-executor/tests/integration_tests.rs:626:9:
step-good should succeed on first call

---- integration_tests::execute_step_success_for_step_1 stdout ----

thread 'integration_tests::execute_step_success_for_step_1' (3707565) panicked at crates/vo-executor/tests/integration_tests.rs:26:9:
assertion `left == right` failed
  left: Err(StepNotFound { step_id: StepId("step-1") })
 right: Ok(Success { output: "done" })

---- integration_tests::execute_step_twice_in_sequence_succeeds stdout ----

thread 'integration_tests::execute_step_twice_in_sequence_succeeds' (3707567) panicked at crates/vo-executor/tests/integration_tests.rs:362:9:
assertion failed: result1.is_ok()

failures:
    integration_tests::execute_step_on_already_executing_step_returns_invalid_transition
    integration_tests::execute_step_success_for_step_1
    integration_tests::execute_step_twice_in_sequence_succeeds
    integration_tests::execute_step_with_retry_success
    integration_tests::execute_step_with_retry_success_for_non_flaky_step
    integration_tests::get_execution_status_returns_ready
    integration_tests::transient_error_is_not_persisted_across_different_steps

test result: FAILED. 45 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
