*** crates/vo-executor/src/lib.rs:292:9: delete match arm "step-fail" in step_behavior

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ delete match arm "step-fail" in step_behavior
@@ -284,17 +284,17 @@
 }
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
         "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
             StepBehavior::Success
         }
-        "step-fail" => StepBehavior::Failure,
+         /* ~ changed by cargo-mutants ~ */
         "step-transient" | "step-flaky" => StepBehavior::Transient,
         "step-slow" => StepBehavior::Slow,
         _ => StepBehavior::NotFound,
     }
 }
 
 #[derive(Debug, Clone, Copy)]
 enum StepBehavior {

---- integration_tests::execute_step_failure_for_step_fail stdout ----

thread 'integration_tests::execute_step_failure_for_step_fail' (3709402) panicked at crates/vo-executor/tests/integration_tests.rs:226:9:
assertion `left == right` failed
  left: Err(StepNotFound { step_id: StepId("step-fail") })
 right: Ok(Failure { output: "error: exit code 1" })

failures:
    integration_tests::execute_step_failure_for_step_fail

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
