*** crates/vo-executor/src/lib.rs:386:5: replace handle_slow_step_timeout -> Result<(), ExecuteNodeError> with Ok(())

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace handle_slow_step_timeout -> Result<(), ExecuteNodeError> with Ok(())
@@ -378,24 +378,17 @@
     clear_error(step_id.as_str());
 }
 
 fn handle_slow_step_timeout(
     step_id: &StepId,
     timeout_ms: u64,
     behavior: StepBehavior,
 ) -> Result<(), ExecuteNodeError> {
-    if matches!(behavior, StepBehavior::Slow) && timeout_ms < SLOW_STEP_DURATION_MS {
-        set_state(step_id.as_str(), StepState::Ready);
-        return Err(ExecuteNodeError::TimeoutExceeded {
-            elapsed_ms: SLOW_STEP_DURATION_MS,
-            limit_ms: timeout_ms,
-        });
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn execute_and_transition(
     step_id: &StepId,
     behavior: StepBehavior,
 ) -> Result<StepResult, ExecuteNodeError> {
     let result = execute_behavior(step_id, behavior)?;
     set_state(step_id.as_str(), StepState::Ready);

---- integration_tests::execute_step_with_retry_timeout_exceeded stdout ----

thread 'integration_tests::execute_step_with_retry_timeout_exceeded' (3716117) panicked at crates/vo-executor/tests/integration_tests.rs:461:9:
assertion failed: matches!(result, Err(vo_executor::ExecuteNodeError::TimeoutExceeded { .. }))

---- integration_tests::execute_step_success_for_step_1 stdout ----

thread 'integration_tests::execute_step_success_for_step_1' (3716107) panicked at crates/vo-executor/tests/integration_tests.rs:26:9:
assertion `left == right` failed
  left: Err(InvalidTransition { from_state: "Executing", action: "execute_step" })
 right: Ok(Success { output: "done" })

---- integration_tests::execute_step_timeout_for_slow_step stdout ----

thread 'integration_tests::execute_step_timeout_for_slow_step' (3716108) panicked at crates/vo-executor/tests/integration_tests.rs:37:9:
assertion `left == right` failed
  left: Ok(Success { output: "done" })
 right: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 1 })

failures:
    integration_tests::execute_step_success_for_step_1
    integration_tests::execute_step_timeout_for_slow_step
    integration_tests::execute_step_with_retry_timeout_exceeded
    integration_tests::execution_status_is_executing_during_step_execution

test result: FAILED. 48 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
