*** crates/vo-executor/src/lib.rs:456:5: replace validate_retry_policy -> Result<(), ExecuteNodeError> with Ok(())

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace validate_retry_policy -> Result<(), ExecuteNodeError> with Ok(())
@@ -448,26 +448,17 @@
     validate_retry_policy(&step_id, &retry_policy)?;
     check_flaky_or_delegate(step_id, timeout_ms, retry_policy).await
 }
 
 fn validate_retry_policy(
     step_id: &StepId,
     retry_policy: &RetryPolicy,
 ) -> Result<(), ExecuteNodeError> {
-    if retry_policy.max_attempts == 0 {
-        let err = ExecuteNodeError::InvalidRetryPolicy {
-            node_name: step_id.to_string(),
-            reason: RetryPolicyError::ZeroAttempts,
-        };
-        set_error(step_id.as_str(), err.clone());
-        Err(err)
-    } else {
-        Ok(())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn check_flaky_or_delegate(
     step_id: StepId,
     timeout_ms: u64,
     retry_policy: RetryPolicy,
 ) -> Result<StepResult, ExecuteNodeError> {
     if step_id.as_str() == "step-flaky" {

---- integration_tests::execute_step_with_retry_rejects_invalid_policy_zero_attempts stdout ----

thread 'integration_tests::execute_step_with_retry_rejects_invalid_policy_zero_attempts' (3719941) panicked at crates/vo-executor/tests/integration_tests.rs:167:9:
assertion `left == right` failed
  left: Ok(Success { output: "done" })
 right: Err(InvalidRetryPolicy { node_name: "step-1", reason: ZeroAttempts })

failures:
    integration_tests::execute_step_with_retry_rejects_invalid_policy_zero_attempts

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
