*** crates/vo-executor/src/lib.rs:47:42: replace || with && in StepId::parse

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace || with && in StepId::parse
@@ -39,17 +39,17 @@
     pub fn parse(s: &str) -> Result<Self, ExecuteNodeError> {
         if s.is_empty() {
             return Err(ExecuteNodeError::StepNotFound {
                 step_id: StepId(s.to_string()),
             });
         }
         if !s
             .chars()
-            .all(|c| c.is_alphanumeric() || c == '-' || c == '_')
+            .all(|c| c.is_alphanumeric() && /* ~ changed by cargo-mutants ~ */ c == '-' || c == '_')
         {
             return Err(ExecuteNodeError::StepNotFound {
                 step_id: StepId(s.to_string()),
             });
         }
         Ok(Self(s.to_string()))
     }

---- integration_tests::step_id_parse_accepts_valid_id stdout ----

thread 'integration_tests::step_id_parse_accepts_valid_id' (3694877) panicked at crates/vo-executor/tests/integration_tests.rs:291:13:
expected Ok, got Err(StepNotFound { step_id: StepId("my-step_1") })

failures:
    integration_tests::step_id_parse_accepts_valid_id

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
