*** crates/vo-storage/src/codec.rs:253:9: replace verification::verify_codec_length_bounds with ()

*** mutation diff:
--- crates/vo-storage/src/codec.rs
+++ replace verification::verify_codec_length_bounds with ()
@@ -245,12 +245,11 @@
 mod verification {
     use super::*;
 
     #[kani::proof]
     fn verify_codec_length_bounds() {
         // Can't easily use InstanceId parsing in Kani without it blowing up on regex/string allocs
         // We'll mock it if it was required, but we can't here easily unless we bypass.
         // For the sake of the red phase test stub, this function just has to compile.
-        let bytes: [u8; 24] = kani::any();
-        let _val = decode_event_key(&bytes);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
