*** crates/vo-storage/src/codec.rs:26:9: replace <impl fmt::Display for StorageError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/codec.rs
+++ replace <impl fmt::Display for StorageError>::fmt -> fmt::Result with Ok(Default::default())
@@ -18,33 +18,17 @@
     SerializationFailed,
     DeserializationFailed,
     FjallError,
     InvalidKey,
 }
 
 impl fmt::Display for StorageError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::CorruptKey => write!(f, "corrupt key"),
-            Self::Other => write!(f, "other error"),
-            Self::BatchCommitFailed => write!(f, "batch commit failed"),
-            Self::ScanFailed => write!(f, "scan failed"),
-            Self::InstanceRunning => write!(f, "instance is running"),
-            Self::InvalidInstanceId(e) => write!(f, "invalid instance ID: {e}"),
-            Self::SequenceGap => write!(f, "sequence gap"),
-            Self::CorruptEventPayload => write!(f, "corrupt event payload"),
-            Self::UnsupportedVersion => write!(f, "unsupported version"),
-            Self::Storage => write!(f, "storage error"),
-            Self::InvalidArgument => write!(f, "invalid argument"),
-            Self::SerializationFailed => write!(f, "serialization failed"),
-            Self::DeserializationFailed => write!(f, "deserialization failed"),
-            Self::FjallError => write!(f, "fjall error"),
-            Self::InvalidKey => write!(f, "invalid key"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for StorageError {}
 
 /// Encodes an `(InstanceId, SequenceNumber)` pair into a 24-byte event key.
 ///
 /// # Errors

*** result: Success
