*** crates/vo-storage/src/dedupe_partition/mod.rs:124:5: replace encode_dedupe_key -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace encode_dedupe_key -> Vec<u8> with vec![0]
@@ -116,17 +116,17 @@
 
 // ---------------------------------------------------------------------------
 // Calc layer — key encoding/decoding
 // ---------------------------------------------------------------------------
 
 /// Encode a `DedupeKey` as UTF-8 bytes for use as a partition key.
 #[must_use]
 pub fn encode_dedupe_key(key: &DedupeKey) -> Vec<u8> {
-    key.as_str().as_bytes().to_vec()
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode UTF-8 bytes into a `DedupeKey`.
 ///
 /// # Errors
 ///
 /// Returns `DedupeStoreError::Codec` if bytes are not valid UTF-8 or empty.
 pub fn decode_dedupe_key(bytes: &[u8]) -> Result<DedupeKey, DedupeStoreError> {

---- dedupe_partition::tests::decode_dedupe_key_recovers_key stdout ----

thread 'dedupe_partition::tests::decode_dedupe_key_recovers_key' (2075515) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:155:5:
assertion `left == right` failed
  left: "\0"
 right: "test-key"

---- dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes stdout ----

thread 'dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes' (2075530) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:147:5:
assertion `left == right` failed
  left: [0]
 right: [116, 101, 115, 116, 45, 107, 101, 121]

---- dedupe_partition::tests::kani_verify_encode_decode_dedupe_key_roundtrip stdout ----

thread 'dedupe_partition::tests::kani_verify_encode_decode_dedupe_key_roundtrip' (2075535) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:497:5:
assertion `left == right` failed
  left: Ok(DedupeKey("\0"))
 right: Ok(DedupeKey("verify-key"))

failures:
    dedupe_partition::tests::decode_dedupe_key_recovers_key
    dedupe_partition::tests::encode_dedupe_key_preserves_unicode_bytes
    dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes
    dedupe_partition::tests::kani_verify_encode_decode_dedupe_key_roundtrip

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
