*** crates/vo-storage/src/dedupe_partition/mod.rs:69:9: replace DedupeEntry::dedupe_key -> &str with ""

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace DedupeEntry::dedupe_key -> &str with ""
@@ -61,17 +61,17 @@
             dedupe_key,
             instance_id,
             expires_at,
         })
     }
 
     #[must_use]
     pub fn dedupe_key(&self) -> &str {
-        &self.dedupe_key
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn instance_id(&self) -> &str {
         &self.instance_id
     }
 
     #[must_use]

---- dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields stdout ----

thread 'dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields' (2049700) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:17:5:
assertion `left == right` failed
  left: ""
 right: "key-1"

failures:
    dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
