*** crates/vo-storage/src/dedupe_partition/mod.rs:85:9: replace DedupeEntry::is_expired -> bool with true

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace DedupeEntry::is_expired -> bool with true
@@ -77,17 +77,17 @@
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
         self.expires_at
     }
 
     /// Check if this entry has expired given the current timestamp.
     #[must_use]
     pub const fn is_expired(&self, now_ms: u64) -> bool {
-        now_ms >= self.expires_at
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Data layer — error enum
 // ---------------------------------------------------------------------------
 
 /// Errors from the dedupe store operations.

---- dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key stdout ----

thread 'dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key' (2065127) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:358:5:
assertion `left == right` failed
  left: Ok(Admitted)
 right: Ok(Duplicate { instance_id: "02081040G2081040G2081040G2" })

---- dedupe_partition::tests::contains_returns_true_for_existing_unexpired_key_in_real_store stdout ----

thread 'dedupe_partition::tests::contains_returns_true_for_existing_unexpired_key_in_real_store' (2065133) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:474:5:
assertion `left == right` failed
  left: Ok(false)
 right: Ok(true)

---- dedupe_partition::tests::dedupe_entry_is_expired_returns_false_before_expiry stdout ----

thread 'dedupe_partition::tests::dedupe_entry_is_expired_returns_false_before_expiry' (2065142) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:44:5:
assertion failed: !entry.is_expired(999)

failures:
    dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key
    dedupe_partition::tests::contains_returns_true_for_existing_unexpired_key_in_real_store
    dedupe_partition::tests::dedupe_entry_is_expired_returns_false_before_expiry
    dedupe_partition::tests::dedupe_entry_is_not_expired_before_u64_max_boundary
    dedupe_partition::tests::purge_expired_returns_zero_when_entries_remain_unexpired

test result: FAILED. 313 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
