*** crates/vo-storage/src/dedupe_partition/verification.rs:14:5: replace verify_encode_decode_dedupe_key_roundtrip_returns_original_key with ()

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/verification.rs
+++ replace verify_encode_decode_dedupe_key_roundtrip_returns_original_key with ()
@@ -6,27 +6,10 @@
     let result = DedupeEntry::new("".to_string(), "instance-1".to_string(), 1000);
     assert_eq!(result, Err(DedupeStoreError::InvalidArgument));
 }
 
 /// K-02: Verify encode/decode dedupe key round-trip for valid UTF-8.
 #[kani::proof]
 fn verify_encode_decode_dedupe_key_roundtrip_returns_original_key() {
     // Symbolic string variable for verification
-    let s: &str = kani::any();
-    // Guard: reject empty strings (K-02 assumes s is non-empty)
-    kani::assume(!s.is_empty());
-    // Guard: enforce max length of 256 characters (K-02 assumes s.len() <= 256)
-    kani::assume(s.len() <= 256);
-
-    let parsed = DedupeKey::parse(s);
-
-    let dedupe_key = match parsed {
-        Ok(dedupe_key) => dedupe_key,
-        Err(error) => {
-            eprintln!("expected valid dedupe key: {error}");
-            std::process::exit(1);
-        }
-    };
-
-    let bytes = encode_dedupe_key(&dedupe_key);
-    assert_eq!(decode_dedupe_key(&bytes), Ok(dedupe_key));
+    () /* ~ changed by cargo-mutants ~ */
 }

---- dedupe_partition::tests::verification_source_asserts_roundtrip_proof_contains_encode_decode_equality_assertion stdout ----

thread 'dedupe_partition::tests::verification_source_asserts_roundtrip_proof_contains_encode_decode_equality_assertion' (2377000) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:541:5:
assertion failed: source.contains("assert_eq!(decode_dedupe_key(&bytes), Ok(dedupe_key))")

---- dedupe_partition::tests::verification_source_asserts_roundtrip_proof_enforces_max_length_256 stdout ----

thread 'dedupe_partition::tests::verification_source_asserts_roundtrip_proof_enforces_max_length_256' (2377001) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:563:5:
assertion failed: source.contains("s.len() <= 256") || source.contains("256")

---- dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume stdout ----

thread 'dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume' (2377002) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:552:5:
assertion failed: source.contains("kani::assume(!s.is_empty())")

failures:
    dedupe_partition::tests::verification_source_asserts_roundtrip_proof_contains_encode_decode_equality_assertion
    dedupe_partition::tests::verification_source_asserts_roundtrip_proof_enforces_max_length_256
    dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
