*** crates/vo-storage/src/dedupe_partition/verification.rs:6:5: replace verify_dedupe_entry_rejects_empty_key_returns_invalid_argument with ()

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/verification.rs
+++ replace verify_dedupe_entry_rejects_empty_key_returns_invalid_argument with ()
@@ -1,15 +1,14 @@
 use super::*;
 
 /// K-01: Verify DedupeEntry::new rejects empty dedupe_key.
 #[kani::proof]
 fn verify_dedupe_entry_rejects_empty_key_returns_invalid_argument() {
-    let result = DedupeEntry::new("".to_string(), "instance-1".to_string(), 1000);
-    assert_eq!(result, Err(DedupeStoreError::InvalidArgument));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// K-02: Verify encode/decode dedupe key round-trip for valid UTF-8.
 #[kani::proof]
 fn verify_encode_decode_dedupe_key_roundtrip_returns_original_key() {
     // Symbolic string variable for verification
     let s: &str = kani::any();
     // Guard: reject empty strings (K-02 assumes s is non-empty)

---- dedupe_partition::tests::verification_source_asserts_empty_key_proof_contains_exact_invalid_argument_assertion stdout ----

thread 'dedupe_partition::tests::verification_source_asserts_empty_key_proof_contains_exact_invalid_argument_assertion' (2375160) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:530:5:
assertion failed: source.contains("assert_eq!(result, Err(DedupeStoreError::InvalidArgument))")

failures:
    dedupe_partition::tests::verification_source_asserts_empty_key_proof_contains_exact_invalid_argument_assertion

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
