*** crates/vo-storage/src/effect_journal/mod.rs:103:9: replace <impl fmt::Display for EffectJournalError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace <impl fmt::Display for EffectJournalError>::fmt -> fmt::Result with Ok(Default::default())
@@ -95,29 +95,17 @@
     Codec { reason: String },
 
     /// Invalid argument (e.g., empty `intent_id`).
     InvalidArgument,
 }
 
 impl fmt::Display for EffectJournalError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::AlreadyTerminal {
-                effect_id,
-                current_status,
-            } => write!(
-                f,
-                "effect {effect_id} is already terminal with status {current_status}"
-            ),
-            Self::NotFound { effect_id } => write!(f, "effect {effect_id} not found"),
-            Self::Storage { reason } => write!(f, "storage error: {reason}"),
-            Self::Codec { reason } => write!(f, "codec error: {reason}"),
-            Self::InvalidArgument => write!(f, "invalid argument"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for EffectJournalError {}
 
 // ---------------------------------------------------------------------------
 // Calc layer — key encoding/decoding
 // ---------------------------------------------------------------------------

---- effect_journal::tests::error_invalid_argument_displays_exact_message stdout ----

thread 'effect_journal::tests::error_invalid_argument_displays_exact_message' (2100512) panicked at crates/vo-storage/src/effect_journal/tests.rs:110:5:
assertion `left == right` failed
  left: ""
 right: "invalid argument"

---- effect_journal::tests::error_already_terminal_displays_effect_id_and_status stdout ----

thread 'effect_journal::tests::error_already_terminal_displays_effect_id_and_status' (2100510) panicked at crates/vo-storage/src/effect_journal/tests.rs:79:5:
should contain effect_id

---- effect_journal::tests::error_codec_displays_reason stdout ----

thread 'effect_journal::tests::error_codec_displays_reason' (2100511) panicked at crates/vo-storage/src/effect_journal/tests.rs:105:5:
assertion `left == right` failed
  left: ""
 right: "codec error: invalid JSON"

failures:
    effect_journal::tests::error_already_terminal_displays_effect_id_and_status
    effect_journal::tests::error_codec_displays_reason
    effect_journal::tests::error_invalid_argument_displays_exact_message
    effect_journal::tests::error_not_found_displays_effect_id
    effect_journal::tests::error_storage_displays_reason
    effect_journal::tests::prepare_returns_exact_storage_error_when_backend_write_fails

test result: FAILED. 312 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
