*** crates/vo-storage/src/effect_journal/mod.rs:130:5: replace encode_effect_key -> Vec<u8> with vec![]

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace encode_effect_key -> Vec<u8> with vec![]
@@ -122,17 +122,17 @@
 // Calc layer — key encoding/decoding
 // ---------------------------------------------------------------------------
 
 /// Encode an `EffectId` as UTF-8 bytes for use as a partition key.
 ///
 /// The key format is simply the UTF-8 representation of the `EffectId` string.
 #[must_use]
 pub fn encode_effect_key(effect_id: &EffectId) -> Vec<u8> {
-    effect_id.as_str().as_bytes().to_vec()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode UTF-8 bytes into an `EffectId`.
 ///
 /// # Errors
 ///
 /// Returns `EffectJournalError::Codec` if the bytes are not valid UTF-8 or empty.
 pub fn decode_effect_key(bytes: &[u8]) -> Result<EffectId, EffectJournalError> {

---- effect_journal::tests::decode_effect_key_recovers_effect_id stdout ----

thread 'effect_journal::tests::decode_effect_key_recovers_effect_id' (2100961) panicked at crates/vo-storage/src/effect_journal/tests.rs:133:47:
called `Result::unwrap()` on an `Err` value: Codec { reason: "empty effect key" }

---- effect_journal::tests::encode_effect_key_produces_utf8_bytes stdout ----

thread 'effect_journal::tests::encode_effect_key_produces_utf8_bytes' (2100974) panicked at crates/vo-storage/src/effect_journal/tests.rs:125:5:
assertion `left == right` failed
  left: []
 right: [48, 49, 48, 52, 48, 71, 50, 48, 56, 49, 48, 52, 48, 71, 50, 48, 56, 49, 48, 52, 48, 71, 50, 48, 56, 49, 58, 58, 105, 110, 115, 116, 97, 110, 99, 101, 58, 58, 102, 120, 45, 49, 50, 51]

---- effect_journal::tests::kani_verify_encode_decode_key_roundtrip stdout ----

thread 'effect_journal::tests::kani_verify_encode_decode_key_roundtrip' (2100981) panicked at crates/vo-storage/src/effect_journal/tests.rs:288:5:
assertion `left == right` failed
  left: Err(Codec { reason: "empty effect key" })
 right: Ok(EffectId("02081040G2081040G2081040G2::verify-intent"))

failures:
    effect_journal::tests::decode_effect_key_recovers_effect_id
    effect_journal::tests::encode_effect_key_produces_utf8_bytes
    effect_journal::tests::kani_verify_encode_decode_key_roundtrip

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
