*** crates/vo-storage/src/effect_journal/mod.rs:160:5: replace encode_effect_record -> Result<Vec<u8>, EffectJournalError> with Ok(vec![1])

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace encode_effect_record -> Result<Vec<u8>, EffectJournalError> with Ok(vec![1])
@@ -152,19 +152,17 @@
 // ---------------------------------------------------------------------------
 
 /// Encode an `EffectRecord` to JSON bytes for storage.
 ///
 /// # Errors
 ///
 /// Returns `EffectJournalError::Codec` if serialization fails.
 pub fn encode_effect_record(record: &EffectRecord) -> Result<Vec<u8>, EffectJournalError> {
-    serde_json::to_vec(record).map_err(|e| EffectJournalError::Codec {
-        reason: e.to_string(),
-    })
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode JSON bytes into an `EffectRecord`.
 ///
 /// # Errors
 ///
 /// Returns `EffectJournalError::Codec` if deserialization fails.
 pub fn decode_effect_record(bytes: &[u8]) -> Result<EffectRecord, EffectJournalError> {

---- effect_journal::tests::encode_decode_record_roundtrip_for_rolledback_status stdout ----

thread 'effect_journal::tests::encode_decode_record_roundtrip_for_rolledback_status' (2113945) panicked at crates/vo-storage/src/effect_journal/tests.rs:16:35:
called `Result::unwrap()` on an `Err` value: Error("expected value", line: 1, column: 1)

---- effect_journal::tests::encode_decode_record_roundtrip_for_committed_status stdout ----

thread 'effect_journal::tests::encode_decode_record_roundtrip_for_committed_status' (2113943) panicked at crates/vo-storage/src/effect_journal/tests.rs:16:35:
called `Result::unwrap()` on an `Err` value: Error("expected value", line: 1, column: 1)

---- effect_journal::tests::encode_decode_record_roundtrip_for_prepared_status stdout ----

thread 'effect_journal::tests::encode_decode_record_roundtrip_for_prepared_status' (2113944) panicked at crates/vo-storage/src/effect_journal/tests.rs:16:35:
called `Result::unwrap()` on an `Err` value: Error("expected value", line: 1, column: 1)

failures:
    effect_journal::tests::encode_decode_effect_record_roundtrip
    effect_journal::tests::encode_decode_record_roundtrip_for_committed_status
    effect_journal::tests::encode_decode_record_roundtrip_for_prepared_status
    effect_journal::tests::encode_decode_record_roundtrip_for_rolledback_status

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
