*** crates/vo-storage/src/effect_journal/mod.rs:329:9: replace <impl EffectJournal for InMemoryEffectJournal>::rollback -> Result<(), EffectJournalError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace <impl EffectJournal for InMemoryEffectJournal>::rollback -> Result<(), EffectJournalError> with Ok(())
@@ -321,52 +321,17 @@
                 })?;
                 *record = committed;
                 Ok(())
             }
         }
     }
 
     fn rollback(&self, effect_id: &EffectId) -> Result<(), EffectJournalError> {
-        let key = effect_id.as_str().to_string();
-        let mut records = self
-            .records
-            .lock()
-            .map_err(|e| EffectJournalError::Storage {
-                reason: e.to_string(),
-            })?;
-
-        let record = records
-            .get_mut(&key)
-            .ok_or_else(|| EffectJournalError::NotFound {
-                effect_id: key.clone(),
-            })?;
-
-        match record.status() {
-            EffectIntent::Committed | EffectIntent::RolledBack => {
-                Err(EffectJournalError::AlreadyTerminal {
-                    effect_id: key,
-                    current_status: format!("{:?}", record.status()),
-                })
-            }
-            EffectIntent::Prepared => {
-                let rolled_back = EffectRecord::new(
-                    record.intent_id().to_string(),
-                    record.kind(),
-                    record.params_json().clone(),
-                    EffectIntent::RolledBack,
-                    None,
-                )
-                .ok_or_else(|| EffectJournalError::Storage {
-                    reason: "failed to create rolled-back record".to_string(),
-                })?;
-                *record = rolled_back;
-                Ok(())
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn list_pending(
         &self,
         instance_id: &InstanceId,
     ) -> Result<Vec<EffectRecord>, EffectJournalError> {
         let records = self
             .records

---- effect_journal::tests::rollback_transitions_prepared_to_rolledback stdout ----

thread 'effect_journal::tests::rollback_transitions_prepared_to_rolledback' (2120957) panicked at crates/vo-storage/src/effect_journal/tests.rs:461:5:
assertion failed: pending.is_empty()

---- effect_journal::tests::rollback_returns_not_found_for_unknown_effect stdout ----

thread 'effect_journal::tests::rollback_returns_not_found_for_unknown_effect' (2120956) panicked at crates/vo-storage/src/effect_journal/tests.rs:572:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(NotFound { effect_id: "01040G2081040G2081040G2081::nonexistent" })

---- effect_journal::tests::rollback_returns_already_terminal_for_rolledback_effect stdout ----

thread 'effect_journal::tests::rollback_returns_already_terminal_for_rolledback_effect' (2120955) panicked at crates/vo-storage/src/effect_journal/tests.rs:503:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(AlreadyTerminal { effect_id: "01040G2081040G2081040G2081::fx-rb-double", current_status: "RolledBack" })

failures:
    effect_journal::tests::list_pending_returns_only_prepared_effects
    effect_journal::tests::rollback_returns_already_terminal_for_rolledback_effect
    effect_journal::tests::rollback_returns_not_found_for_unknown_effect
    effect_journal::tests::rollback_transitions_prepared_to_rolledback

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
