*** crates/vo-storage/src/effect_journal/verification.rs:14:5: replace verify_encode_decode_key_roundtrip with ()

*** mutation diff:
--- crates/vo-storage/src/effect_journal/verification.rs
+++ replace verify_encode_decode_key_roundtrip with ()
@@ -6,13 +6,10 @@
     let iid = InstanceId::from_bytes([1u8; 16]);
     let result = EffectId::new(&iid, "");
     assert_eq!(result, Err(EffectJournalError::InvalidArgument));
 }
 
 /// K-02: Verify encode/decode key round-trip for any valid UTF-8 string.
 #[kani::proof]
 fn verify_encode_decode_key_roundtrip() {
-    let eid = EffectId("verify-intent".to_string());
-    let bytes = encode_effect_key(&eid);
-    let recovered = decode_effect_key(&bytes);
-    assert_eq!(recovered, Ok(eid));
+    () /* ~ changed by cargo-mutants ~ */
 }

---- effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present stdout ----

thread 'effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present' (2379116) panicked at crates/vo-storage/src/effect_journal/tests.rs:332:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
