*** crates/vo-storage/src/effect_journal/verification.rs:6:5: replace verify_effect_id_rejects_empty_intent_id with ()

*** mutation diff:
--- crates/vo-storage/src/effect_journal/verification.rs
+++ replace verify_effect_id_rejects_empty_intent_id with ()
@@ -1,16 +1,14 @@
 use super::*;
 
 /// K-01: Verify EffectId::new rejects empty intent_id.
 #[kani::proof]
 fn verify_effect_id_rejects_empty_intent_id() {
-    let iid = InstanceId::from_bytes([1u8; 16]);
-    let result = EffectId::new(&iid, "");
-    assert_eq!(result, Err(EffectJournalError::InvalidArgument));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// K-02: Verify encode/decode key round-trip for any valid UTF-8 string.
 #[kani::proof]
 fn verify_encode_decode_key_roundtrip() {
     let eid = EffectId("verify-intent".to_string());
     let bytes = encode_effect_key(&eid);
     let recovered = decode_effect_key(&bytes);

---- effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present stdout ----

thread 'effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present' (2378578) panicked at crates/vo-storage/src/effect_journal/tests.rs:326:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    effect_journal::tests::verification_source_keeps_both_kani_proof_gates_present

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
