*** crates/vo-storage/src/instance_index/mod.rs:116:29: replace match guard old_status != status with false in instance_index_upsert

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace match guard old_status != status with false in instance_index_upsert
@@ -108,17 +108,17 @@
 ) -> Result<(), StorageError> {
     let partition = keyspace
         .open_partition("instances", fjall::PartitionCreateOptions::default())
         .map_err(|_| StorageError::Storage)?;
 
     let new_key = encode_instance_index_key(status, created_at, instance_id)?;
 
     match previous_status {
-        Some(old_status) if old_status != status => {
+        Some(old_status) if false /* ~ changed by cargo-mutants ~ */ => {
             let old_key = encode_instance_index_key(old_status, created_at, instance_id)?;
             atomic_status_transition(keyspace, &partition, &old_key, &new_key)
         }
         _ => partition
             .insert(new_key, &[] as &[u8])
             .map_err(|_| StorageError::Storage),
     }
 }

---- upsert_does_not_batch_delete_when_status_is_unchanged stdout ----

thread 'upsert_does_not_batch_delete_when_status_is_unchanged' (2144574) panicked at crates/vo-storage/tests/instance_index_integration.rs:984:5:
assertion `left == right` failed: After different-status transition, should have 2 keys (canary + new). If 3 keys exist, the batch path was not taken for status transition (!=→== mutation).
  left: 3
 right: 2

---- upsert_transitions_through_all_six_statuses_for_single_instance stdout ----

thread 'upsert_transitions_through_all_six_statuses_for_single_instance' (2144580) panicked at crates/vo-storage/tests/instance_index_integration.rs:456:5:
assertion `left == right` failed
  left: 2
 right: 1

---- upsert_status_transition_is_atomic_via_scan_state stdout ----

thread 'upsert_status_transition_is_atomic_via_scan_state' (2144578) panicked at crates/vo-storage/tests/instance_index_integration.rs:823:5:
assertion `left == right` failed: After atomic transition, exactly 1 key should exist (never 0 or 2)
  left: 2
 right: 1

failures:
    scan_all_instances_returns_correct_total_after_mixed_operations
    upsert_atomically_transitions_status_when_previous_differs_from_new
    upsert_does_not_batch_delete_when_status_is_unchanged
    upsert_removes_instance_from_old_status_scan_when_status_transitions
    upsert_status_transition_is_atomic_via_scan_state
    upsert_transitions_through_all_six_statuses_for_single_instance

test result: FAILED. 15 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
