*** crates/vo-storage/src/instance_index/mod.rs:220:9: replace <impl Iterator for ScanIterator>::next -> Option<Self::Item> with None

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace <impl Iterator for ScanIterator>::next -> Option<Self::Item> with None
@@ -212,22 +212,11 @@
     pub(crate) inner: Option<Box<dyn DoubleEndedIterator<Item = fjall::Result<fjall::KvPair>>>>,
     pub(crate) init_error: Option<StorageError>,
 }
 
 impl Iterator for ScanIterator {
     type Item = Result<InstanceIndexEntry, StorageError>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        if let Some(err) = self.init_error.take() {
-            return Some(Err(err));
-        }
-        let inner = self.inner.as_mut()?;
-        match inner.next() {
-            Some(Ok((k_bytes, _v_bytes))) => Some(decode_instance_index_key(&k_bytes)),
-            Some(Err(_)) => {
-                self.inner = None;
-                Some(Err(StorageError::Storage))
-            }
-            None => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- instance_index::tests_iterator::scan_iterator_decodes_valid_entries_from_inner_iterator stdout ----

thread 'instance_index::tests_iterator::scan_iterator_decodes_valid_entries_from_inner_iterator' (2156249) panicked at crates/vo-storage/src/instance_index/tests_iterator.rs:102:23:
called `Option::unwrap()` on a `None` value

---- instance_index::tests_iterator::scan_iterator_stops_after_storage_error stdout ----

thread 'instance_index::tests_iterator::scan_iterator_stops_after_storage_error' (2156251) panicked at crates/vo-storage/src/instance_index/tests_iterator.rs:74:5:
assertion `left == right` failed
  left: None
 right: Some(Err(Storage))

---- instance_index::tests_iterator::scan_iterator_yields_init_error_on_first_next_then_none stdout ----

thread 'instance_index::tests_iterator::scan_iterator_yields_init_error_on_first_next_then_none' (2156253) panicked at crates/vo-storage/src/instance_index/tests_iterator.rs:29:5:
assertion `left == right` failed
  left: None
 right: Some(Err(Storage))

failures:
    instance_index::tests_iterator::scan_iterator_decodes_valid_entries_from_inner_iterator
    instance_index::tests_iterator::scan_iterator_stops_after_storage_error
    instance_index::tests_iterator::scan_iterator_yields_init_error_on_first_next_then_none
    instance_index::tests_iterator::scan_iterator_yields_storage_error_when_inner_iterator_returns_err
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 312 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
