*** crates/vo-storage/src/lease_partition/mod.rs:138:9: replace LeaseEntry::instance_id -> &str with "xyzzy"

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace LeaseEntry::instance_id -> &str with "xyzzy"
@@ -130,17 +130,17 @@
             step_id,
             fence_token,
             expires_at,
         })
     }
 
     #[must_use]
     pub fn instance_id(&self) -> &str {
-        &self.instance_id
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn step_id(&self) -> &str {
         &self.step_id
     }
 
     #[must_use]

---- lease_partition::tests_lease_entry::lease_entry_instance_id_returns_original_string_when_entry_constructed stdout ----

thread 'lease_partition::tests_lease_entry::lease_entry_instance_id_returns_original_string_when_entry_constructed' (2165275) panicked at crates/vo-storage/src/lease_partition/tests_lease_entry.rs:111:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "iid"

failures:
    lease_partition::tests_lease_entry::lease_entry_instance_id_returns_original_string_when_entry_constructed

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
