*** crates/vo-storage/src/lease_partition/mod.rs:148:9: replace LeaseEntry::fence_token -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace LeaseEntry::fence_token -> u64 with 0
@@ -140,17 +140,17 @@
 
     #[must_use]
     pub fn step_id(&self) -> &str {
         &self.step_id
     }
 
     #[must_use]
     pub const fn fence_token(&self) -> u64 {
-        self.fence_token
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
         self.expires_at
     }
 
     /// Check if this lease has expired.

---- lease_partition::tests_integration_acquire::acquire_accepts_u64_max_ttl_when_pair_absent stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_accepts_u64_max_ttl_when_pair_absent' (2172794) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:336:5:
assertion failed: !stale_result(&store, lease.instance_id(), lease.step_id(), *lease.token())

---- lease_partition::tests_integration_acquire::acquire_does_not_replace_current_lease_when_lease_already_held stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_does_not_replace_current_lease_when_lease_already_held' (2172795) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:364:5:
assertion `left == right` failed
  left: (Err(LeaseAlreadyHeld { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" }), true, Err(StaleFence { expected: "0", actual: "1" }))
 right: (Err(LeaseAlreadyHeld { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" }), false, Ok(()))

---- lease_partition::tests_integration_acquire::acquire_establishes_authoritative_lease_when_pair_absent stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_establishes_authoritative_lease_when_pair_absent' (2172796) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:294:5:
assertion `left == right` failed
  left: ("01ARZ3NDEKTSV4RRFFQ69G5FAV", "step-1", 1, true, Err(StaleFence { expected: "0", actual: "1" }))
 right: ("01ARZ3NDEKTSV4RRFFQ69G5FAV", "step-1", 1, false, Ok(()))

failures:
    lease_partition::tests_integration_acquire::acquire_accepts_u64_max_ttl_when_pair_absent
    lease_partition::tests_integration_acquire::acquire_does_not_replace_current_lease_when_lease_already_held
    lease_partition::tests_integration_acquire::acquire_establishes_authoritative_lease_when_pair_absent
    lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_equals_expiry
    lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry
    lease_partition::tests_integration_expiry::acquire_on_one_pair_leaves_original_pair_current_and_releasable_when_different_pair_acquires
    lease_partition::tests_integration_expiry::acquire_returns_fence_token_exhausted_after_u64_max_release
    lease_partition::tests_integration_expiry::release_stale_fence_does_not_extend_current_lease_expiry
    lease_par

test result: FAILED. 299 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
