*** crates/vo-storage/src/lease_partition/mod.rs:148:9: replace LeaseEntry::fence_token -> u64 with 1

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace LeaseEntry::fence_token -> u64 with 1
@@ -140,17 +140,17 @@
 
     #[must_use]
     pub fn step_id(&self) -> &str {
         &self.step_id
     }
 
     #[must_use]
     pub const fn fence_token(&self) -> u64 {
-        self.fence_token
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
         self.expires_at
     }
 
     /// Check if this lease has expired.

---- lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_equals_expiry stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_equals_expiry' (2173270) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:393:5:
assertion `left == right` failed
  left: (2, false, true)
 right: (2, true, false)

---- lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry' (2173271) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:420:5:
assertion `left == right` failed
  left: (2, false)
 right: (2, true)

---- lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry stdout ----

thread 'lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry' (2173272) panicked at crates/vo-storage/src/lease_partition/tests_integration_expiry.rs:285:5:
assertion failed: stale_result(store, &sample_instance_id(), &sample_step_id(), *first.token())

failures:
    lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_equals_expiry
    lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry
    lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry
    lease_partition::tests_integration_expiry::acquire_returns_fence_token_exhausted_after_u64_max_release
    lease_partition::tests_integration_expiry::release_stale_fence_does_not_extend_current_lease_expiry
    lease_partition::tests_integration_release::release_allows_reacquire_with_next_token_when_current_lease_was_deleted
    lease_partition::tests_integration_release::release_returns_stale_fence_when_token_is_lower_than_current
    lease_partition::tests_integration_stale::check_stale_fence_is_observational_across_expiry_boundary
    lease_pa

test result: FAILED. 307 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
