*** crates/vo-storage/src/lease_partition/mod.rs:231:5: replace encode_lease_entry -> Result<Vec<u8>, LeaseStoreError> with Ok(vec![0])

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace encode_lease_entry -> Result<Vec<u8>, LeaseStoreError> with Ok(vec![0])
@@ -223,19 +223,17 @@
 // ---------------------------------------------------------------------------
 
 /// Encode a `LeaseEntry` to JSON bytes.
 ///
 /// # Errors
 ///
 /// Returns `LeaseStoreError::Codec` if JSON serialization fails.
 pub fn encode_lease_entry(entry: &LeaseEntry) -> Result<Vec<u8>, LeaseStoreError> {
-    serde_json::to_vec(entry).map_err(|error| LeaseStoreError::Codec {
-        reason: error.to_string(),
-    })
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode JSON bytes into a `LeaseEntry`.
 ///
 /// # Errors
 ///
 /// Returns `LeaseStoreError::Codec` if deserialization fails.
 pub fn decode_lease_entry(bytes: &[u8]) -> Result<LeaseEntry, LeaseStoreError> {

---- lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_known_entry stdout ----

thread 'lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_known_entry' (2199229) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:222:5:
assertion `left == right` failed
  left: Ok([0])

---- lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_u64_max_fields stdout ----

thread 'lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_u64_max_fields' (2199230) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:242:5:
assertion `left == right` failed
  left: Ok([0])

---- lease_partition::tests_codec::encode_lease_entry_round_trips_with_decode_for_valid_entry stdout ----

thread 'lease_partition::tests_codec::encode_lease_entry_round_trips_with_decode_for_valid_entry' (2199232) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:257:5:
assertion `left == right` failed
  left: Err(Codec { reason: "expected value at line 1 column 1" })
 right: Ok(LeaseEntry { instance_id: "iid", step_id: "sid", fence_token: 7, expires_at: 5000 })

failures:
    lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_known_entry
    lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_for_u64_max_fields
    lease_partition::tests_codec::encode_lease_entry_returns_exact_json_bytes_when_expires_at_zero
    lease_partition::tests_codec::encode_lease_entry_round_trips_with_decode_for_valid_entry

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
