*** crates/vo-storage/src/lease_partition/verification.rs:14:5: replace verify_lease_entry_rejects_zero_fence with ()

*** mutation diff:
--- crates/vo-storage/src/lease_partition/verification.rs
+++ replace verify_lease_entry_rejects_zero_fence with ()
@@ -6,18 +6,17 @@
 
 pub(super) fn parse_step_id(raw: &str) -> StepId {
     StepId::parse(raw).unwrap()
 }
 
 /// K-01: Verify `LeaseEntry::new` rejects zero `fence_token`.
 #[cfg_attr(kani, kani::proof)]
 pub(super) fn verify_lease_entry_rejects_zero_fence() {
-    let result = LeaseEntry::new("iid".to_string(), "sid".to_string(), 0, 1000);
-    assert_eq!(result, Err(LeaseStoreError::InvalidArgument));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// K-02: Verify encode/decode lease key round-trip.
 #[cfg_attr(kani, kani::proof)]
 pub(super) fn verify_encode_decode_lease_key_roundtrip() {
     let iid = parse_instance_id("01H5JYV4XHGSR2F8KZ9BWNRFMA");
     let sid = parse_step_id("step-kani");
     let key = encode_lease_key(&iid, &sid);

*** result: Success
