*** crates/vo-storage/src/purge.rs:15:5: replace purge_instance -> Result<u64, StorageError> with Ok(1)

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ replace purge_instance -> Result<u64, StorageError> with Ok(1)
@@ -7,77 +7,17 @@
 ///
 /// # Errors
 ///
 /// - `StorageError::InstanceRunning` if the instance is not in a terminal state or not found.
 /// - `StorageError::InvalidInstanceId` if the ID is malformed.
 /// - `StorageError::ScanFailed` if the storage scan fails.
 /// - `StorageError::BatchCommitFailed` if the atomic deletion fails.
 pub fn purge_instance(keyspace: &Keyspace, instance_id_str: &str) -> Result<u64, StorageError> {
-    if instance_id_str.is_empty() {
-        return Err(StorageError::InvalidInstanceId(
-            vo_types::ParseError::Empty {
-                type_name: "InstanceId",
-            },
-        ));
-    }
-
-    // 1. Parse InstanceId
-    let parsed_id = InstanceId::parse(instance_id_str).map_err(StorageError::InvalidInstanceId)?;
-
-    // 2. Find instance in index to verify status and get metadata for key reconstruction
-    let entry = scan_all_instances(keyspace)
-        .find(|r| r.as_ref().is_ok_and(|e| e.instance_id == parsed_id))
-        .ok_or(StorageError::InstanceRunning)? // Mapping "not found" to InstanceRunning per test expectations for non-terminal
-        .map_err(|_| StorageError::ScanFailed)?;
-
-    // 3. Verify status is terminal
-    if !is_terminal(entry.status) {
-        return Err(StorageError::InstanceRunning);
-    }
-
-    // 4. Open partitions and prepare atomic batch
-    let opts = fjall::PartitionCreateOptions::default();
-    let events_p = keyspace
-        .open_partition("events", opts.clone())
-        .map_err(|_| StorageError::ScanFailed)?;
-    let snapshots_p = keyspace
-        .open_partition("snapshots", opts.clone())
-        .map_err(|_| StorageError::ScanFailed)?;
-    let instances_p = keyspace
-        .open_partition("instances", opts)
-        .map_err(|_| StorageError::ScanFailed)?;
-
-    let id_bytes = parsed_id.to_bytes().map_err(|_| StorageError::CorruptKey)?;
-    let mut batch = keyspace.batch();
-    let mut event_count = 0u64;
-
-    // Scan and queue events for deletion
-    for item in events_p.prefix(&id_bytes) {
-        let (k, _) = item.map_err(|_| StorageError::ScanFailed)?;
-        batch.remove(&events_p, k);
-        event_count += 1;
-    }
-
-    // Scan and queue snapshots for deletion
-    for item in snapshots_p.prefix(&id_bytes) {
-        let (k, _) = item.map_err(|_| StorageError::ScanFailed)?;
-        batch.remove(&snapshots_p, k);
-    }
-
-    // Queue index entry removal
-    let index_key = encode_instance_index_key(entry.status, entry.created_at, &parsed_id)?;
-    batch.remove(&instances_p, index_key);
-
-    // 5. Commit atomic batch
-    batch
-        .commit()
-        .map_err(|_| StorageError::BatchCommitFailed)?;
-
-    Ok(event_count)
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 #[must_use]
 pub const fn is_terminal(status: InstanceStatus) -> bool {
     matches!(
         status,
         InstanceStatus::Completed | InstanceStatus::Failed | InstanceStatus::Cancelled
     )

---- purge::tests::purge_instance_returns_invalid_instance_id_when_input_empty stdout ----

thread 'purge::tests::purge_instance_returns_invalid_instance_id_when_input_empty' (2207554) panicked at crates/vo-storage/src/purge.rs:49:9:
assertion `left == right` failed
  left: Ok(1)
 right: Err(InvalidInstanceId(Empty { type_name: "InstanceId" }))

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2207552) panicked at crates/vo-storage/src/purge.rs:122:9:
assertion `left == right` failed
  left: Ok(1)
 right: Ok(2)

---- purge::tests::purge_instance_returns_instance_running_when_instance_is_absent stdout ----

thread 'purge::tests::purge_instance_returns_instance_running_when_instance_is_absent' (2207553) panicked at crates/vo-storage/src/purge.rs:63:9:
assertion `left == right` failed
  left: Ok(1)
 right: Err(InstanceRunning)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_instance_running_when_instance_is_absent
    purge::tests::purge_instance_returns_invalid_instance_id_when_input_empty
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
