*** crates/vo-storage/src/purge.rs:33:8: delete ! in purge_instance

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ delete ! in purge_instance
@@ -25,17 +25,17 @@
 
     // 2. Find instance in index to verify status and get metadata for key reconstruction
     let entry = scan_all_instances(keyspace)
         .find(|r| r.as_ref().is_ok_and(|e| e.instance_id == parsed_id))
         .ok_or(StorageError::InstanceRunning)? // Mapping "not found" to InstanceRunning per test expectations for non-terminal
         .map_err(|_| StorageError::ScanFailed)?;
 
     // 3. Verify status is terminal
-    if !is_terminal(entry.status) {
+    if  /* ~ changed by cargo-mutants ~ */is_terminal(entry.status) {
         return Err(StorageError::InstanceRunning);
     }
 
     // 4. Open partitions and prepare atomic batch
     let opts = fjall::PartitionCreateOptions::default();
     let events_p = keyspace
         .open_partition("events", opts.clone())
         .map_err(|_| StorageError::ScanFailed)?;

---- purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events stdout ----

thread 'purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events' (2214444) panicked at crates/vo-storage/src/purge.rs:143:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(0)

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2214441) panicked at crates/vo-storage/src/purge.rs:182:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(2)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
