*** crates/vo-storage/src/purge.rs:57:21: replace += with *= in purge_instance

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ replace += with *= in purge_instance
@@ -49,17 +49,17 @@
     let id_bytes = parsed_id.to_bytes().map_err(|_| StorageError::CorruptKey)?;
     let mut batch = keyspace.batch();
     let mut event_count = 0u64;
 
     // Scan and queue events for deletion
     for item in events_p.prefix(&id_bytes) {
         let (k, _) = item.map_err(|_| StorageError::ScanFailed)?;
         batch.remove(&events_p, k);
-        event_count += 1;
+        event_count *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     // Scan and queue snapshots for deletion
     for item in snapshots_p.prefix(&id_bytes) {
         let (k, _) = item.map_err(|_| StorageError::ScanFailed)?;
         batch.remove(&snapshots_p, k);
     }

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2214938) panicked at crates/vo-storage/src/purge.rs:182:9:
assertion `left == right` failed
  left: Ok(0)
 right: Ok(2)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
