*** crates/vo-storage/src/purge.rs:80:5: replace is_terminal -> bool with false

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ replace is_terminal -> bool with false
@@ -72,20 +72,17 @@
         .commit()
         .map_err(|_| StorageError::BatchCommitFailed)?;
 
     Ok(event_count)
 }
 
 #[must_use]
 pub const fn is_terminal(status: InstanceStatus) -> bool {
-    matches!(
-        status,
-        InstanceStatus::Completed | InstanceStatus::Failed | InstanceStatus::Cancelled
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
 mod tests {
     use super::*;
     use crate::codec::encode_event_key;
     use crate::instance_index::instance_index_upsert;

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_2 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_2' (2222367) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: false
 right: true

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_3 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_3' (2222368) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: false
 right: true

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_1 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_1' (2222366) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: false
 right: true

failures:
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_1
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_2
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_3
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 313 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
