*** crates/vo-storage/src/query/mod.rs:117:18: replace == with != in IteratorState::advance

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace == with != in IteratorState::advance
@@ -109,17 +109,17 @@
         }
     }
 
     pub fn advance(
         &mut self,
         found: u64,
         record: EventEnvelope,
     ) -> Option<Result<EventEnvelope, StorageError>> {
-        if found == 0 {
+        if found != /* ~ changed by cargo-mutants ~ */ 0 {
             return Some(Err(StorageError::InvalidArgument));
         }
         if !self.started {
             self.started = true;
             self.expected = found.checked_add(1);
             return Some(Ok(record));
         }
         match self.expected {

---- query::tests::iterator_state_rejects_zero_sequence stdout ----

thread 'query::tests::iterator_state_rejects_zero_sequence' (2259908) panicked at crates/vo-storage/src/query/tests.rs:134:5:
assertion `left == right` failed
  left: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 0, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))
 right: Some(Err(InvalidArgument))

---- query::tests::iterator_state_handles_u64_overflow_checked_add stdout ----

thread 'query::tests::iterator_state_handles_u64_overflow_checked_add' (2259906) panicked at crates/vo-storage/src/query/tests.rs:164:5:
assertion `left == right` failed
  left: Some(Err(InvalidArgument))
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 18446744073709551615, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

---- query::tests::iterator_state_first_advance_accepts_any_nonzero stdout ----

thread 'query::tests::iterator_state_first_advance_accepts_any_nonzero' (2259904) panicked at crates/vo-storage/src/query/tests.rs:126:5:
assertion `left == right` failed
  left: Some(Err(InvalidArgument))
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 1, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

failures:
    query::tests::iterator_state_accepts_consecutive_sequences
    query::tests::iterator_state_detects_sequence_gap
    query::tests::iterator_state_first_advance_accepts_any_nonzero
    query::tests::iterator_state_handles_u64_overflow_checked_add
    query::tests::iterator_state_rejects_zero_sequence

test result: FAILED. 313 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
