*** crates/vo-storage/src/query/mod.rs:150:9: replace <impl Iterator for EventReplayIterator>::next -> Option<Self::Item> with None

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace <impl Iterator for EventReplayIterator>::next -> Option<Self::Item> with None
@@ -142,30 +142,17 @@
     inner: Option<Box<dyn DoubleEndedIterator<Item = fjall::Result<fjall::KvPair>>>>,
     init_error: Option<StorageError>,
 }
 
 impl Iterator for EventReplayIterator {
     type Item = Result<EventEnvelope, StorageError>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        if let Some(err) = self.init_error.take() {
-            return Some(Err(err));
-        }
-        let Some(inner) = &mut self.inner else {
-            return None;
-        };
-        match inner.next() {
-            Some(Ok((k_bytes, v_bytes))) => self.process_kv(&k_bytes, &v_bytes),
-            Some(Err(_)) => {
-                self.inner = None;
-                Some(Err(StorageError::Storage))
-            }
-            None => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl EventReplayIterator {
     fn process_kv(
         &mut self,
         k_bytes: &fjall::Slice,
         v_bytes: &fjall::Slice,

---- replay_events_handles_gap_at_start stdout ----

thread 'replay_events_handles_gap_at_start' (2283103) panicked at crates/vo-storage/tests/integration_replay.rs:295:5:
assertion `left == right` failed
  left: 0
 right: 2

---- replay_events_handles_large_sequence_range stdout ----

thread 'replay_events_handles_large_sequence_range' (2283104) panicked at crates/vo-storage/tests/integration_replay.rs:327:5:
assertion `left == right` failed
  left: 0
 right: 5

---- replay_events_handles_unsupported_version stdout ----

thread 'replay_events_handles_unsupported_version' (2283105) panicked at crates/vo-storage/tests/integration_replay.rs:180:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    replay_events_accepts_non_one_starting_sequence
    replay_events_detects_sequence_gap
    replay_events_handles_corrupt_payload
    replay_events_handles_gap_at_start
    replay_events_handles_large_sequence_range
    replay_events_handles_unsupported_version
    replay_events_isolates_different_instances
    replay_events_returns_multiple_events_in_sequence
    replay_events_returns_single_event_in_order
    replay_events_stops_after_first_error

test result: FAILED. 1 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
