*** crates/vo-storage/src/query/mod.rs:178:48: replace - with / in EventReplayIterator::process_kv

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace - with / in EventReplayIterator::process_kv
@@ -170,17 +170,17 @@
         k_bytes: &fjall::Slice,
         v_bytes: &fjall::Slice,
     ) -> Option<Result<EventEnvelope, StorageError>> {
         let seq_len: usize = 8;
         if k_bytes.len() < seq_len {
             self.inner = None;
             return Some(Err(StorageError::Storage));
         }
-        let seq_bytes = &k_bytes[k_bytes.len() - seq_len..];
+        let seq_bytes = &k_bytes[k_bytes.len() / /* ~ changed by cargo-mutants ~ */ seq_len..];
         let found_seq = match decode_key(seq_bytes) {
             Ok(s) => s,
             Err(e) => {
                 self.inner = None;
                 return Some(Err(e));
             }
         };
         let envelope = match EventEnvelope::from_bytes(v_bytes) {

---- replay_events_stops_after_first_error stdout ----

thread 'replay_events_stops_after_first_error' (2372766) panicked at crates/vo-storage/tests/integration_replay.rs:240:5:
assertion `left == right` failed
  left: 1
 right: 2

---- replay_events_detects_sequence_gap stdout ----

thread 'replay_events_detects_sequence_gap' (2372753) panicked at crates/vo-storage/tests/integration_replay.rs:143:5:
assertion `left == right` failed
  left: 1
 right: 2

---- replay_events_handles_gap_at_start stdout ----

thread 'replay_events_handles_gap_at_start' (2372756) panicked at crates/vo-storage/tests/integration_replay.rs:295:5:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    replay_events_accepts_non_one_starting_sequence
    replay_events_detects_sequence_gap
    replay_events_handles_corrupt_payload
    replay_events_handles_gap_at_start
    replay_events_handles_large_sequence_range
    replay_events_handles_unsupported_version
    replay_events_isolates_different_instances
    replay_events_returns_multiple_events_in_sequence
    replay_events_returns_single_event_in_order
    replay_events_stops_after_first_error

test result: FAILED. 1 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
