*** crates/vo-storage/src/query/mod.rs:23:17: replace == with != in encode_key

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace == with != in encode_key
@@ -15,17 +15,17 @@
 
 /// Encode a sequence number as big-endian bytes.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::InvalidArgument` if `sequence` is zero.
 #[must_use = "encode_key performs a pure encoding computation"]
 pub const fn encode_key(sequence: u64) -> Result<[u8; 8], StorageError> {
-    if sequence == 0 {
+    if sequence != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(StorageError::InvalidArgument);
     }
     Ok(sequence.to_be_bytes())
 }
 
 /// Decode a big-endian 8-byte slice into a sequence number.
 ///
 /// # Errors

---- query::tests::encode_key_returns_big_endian_bytes_for_large_value stdout ----

thread 'query::tests::encode_key_returns_big_endian_bytes_for_large_value' (2230193) panicked at crates/vo-storage/src/query/tests.rs:30:5:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok([0, 0, 0, 0, 0, 0, 1, 0])

---- query::tests::decode_key_roundtrips_with_encode_key stdout ----

thread 'query::tests::decode_key_roundtrips_with_encode_key' (2230187) panicked at crates/vo-storage/src/query/tests.rs:64:40:
valid seq should encode: InvalidArgument

---- query::tests::encode_key_returns_big_endian_bytes_for_u64_max stdout ----

thread 'query::tests::encode_key_returns_big_endian_bytes_for_u64_max' (2230196) panicked at crates/vo-storage/src/query/tests.rs:19:5:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok([255, 255, 255, 255, 255, 255, 255, 255])

failures:
    query::tests::decode_key_roundtrips_with_encode_key
    query::tests::encode_key_returns_big_endian_bytes_for_large_value
    query::tests::encode_key_returns_big_endian_bytes_for_sequence_one
    query::tests::encode_key_returns_big_endian_bytes_for_u64_max
    query::tests::encode_key_returns_error_for_zero_sequence
    query::tests::proptest_encode_decode_roundtrip
    query::tests::proptest_encode_key_never_returns_none_for_nonzero

test result: FAILED. 311 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
