*** crates/vo-storage/src/query/mod.rs:38:12: replace == with != in decode_key

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace == with != in decode_key
@@ -30,17 +30,17 @@
 ///
 /// # Errors
 ///
 /// Returns `StorageError::Storage` if the slice is not exactly 8 bytes.
 /// Returns `StorageError::InvalidArgument` if the slice decodes to zero.
 pub fn decode_key(bytes: &[u8]) -> Result<u64, StorageError> {
     let arr: [u8; 8] = bytes.try_into().map_err(|_| StorageError::Storage)?;
     let seq = u64::from_be_bytes(arr);
-    if seq == 0 {
+    if seq != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(StorageError::InvalidArgument);
     }
     Ok(seq)
 }
 
 /// Produce the prefix bytes for range-scanning a given instance.
 ///
 /// Accepts the domain `InstanceId` type directly — callers should not

---- query::tests::decode_key_roundtrips_with_encode_key stdout ----

thread 'query::tests::decode_key_roundtrips_with_encode_key' (2238924) panicked at crates/vo-storage/src/query/tests.rs:65:5:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok(1)

---- query::tests::decode_key_returns_error_for_zero_sequence stdout ----

thread 'query::tests::decode_key_returns_error_for_zero_sequence' (2238922) panicked at crates/vo-storage/src/query/tests.rs:58:5:
assertion `left == right` failed
  left: Ok(0)
 right: Err(InvalidArgument)

---- query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes stdout ----

thread 'query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes' (2238923) panicked at crates/vo-storage/src/query/tests.rs:43:5:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok(1)

failures:
    query::tests::decode_key_returns_error_for_zero_sequence
    query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes
    query::tests::decode_key_roundtrips_with_encode_key
    query::tests::proptest_encode_decode_roundtrip

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
