*** crates/vo-storage/src/query/mod.rs:55:21: replace > with >= in prefix_generator

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace > with >= in prefix_generator
@@ -47,17 +47,17 @@
 /// pre-extract the string representation.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::InvalidArgument` if the instance ID exceeds 255 bytes.
 /// Returns `StorageError::InvalidArgument` if the instance ID contains null bytes.
 pub fn prefix_generator(instance_id: &InstanceId) -> Result<Vec<u8>, StorageError> {
     let id_str = instance_id.as_str();
-    if id_str.len() > 255 {
+    if id_str.len() >= /* ~ changed by cargo-mutants ~ */ 255 {
         return Err(StorageError::InvalidArgument);
     }
     if id_str.as_bytes().contains(&b'\0') {
         return Err(StorageError::InvalidArgument);
     }
     Ok(id_str.as_bytes().to_vec())
 }

*** result: Success
