*** crates/vo-storage/src/snapshots/mod.rs:20:5: replace snapshot_write -> Result<(), StorageError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/snapshots/mod.rs
+++ replace snapshot_write -> Result<(), StorageError> with Ok(())
@@ -12,24 +12,17 @@
 /// Returns `StorageError::FjallError` if the storage engine fails.
 #[allow(clippy::needless_pass_by_value)]
 pub fn snapshot_write(
     partition: &PartitionHandle,
     instance_id: InstanceId,
     sequence: u64,
     state: &InstanceState,
 ) -> Result<(), StorageError> {
-    let key = encode_snapshot_key(&instance_id, sequence)?;
-    serde_json::to_vec(state)
-        .map_err(|_| StorageError::SerializationFailed)
-        .and_then(|value| {
-            partition
-                .insert(key, value)
-                .map_err(|_| StorageError::FjallError)
-        })
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Loads the latest (highest-sequence) snapshot for `instance_id`.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if the instance ID cannot be serialized.
 /// Returns `StorageError::FjallError` if the storage engine fails.

---- snapshots::tests::snapshot_load_latest_enforces_backward_seek_without_unbounded_iteration stdout ----

thread 'snapshots::tests::snapshot_load_latest_enforces_backward_seek_without_unbounded_iteration' (2297613) panicked at crates/vo-storage/src/snapshots/tests.rs:270:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((100, InstanceState { counter: 100 })))

---- snapshots::tests::snapshot_write_persists_state_in_populated_partition stdout ----

thread 'snapshots::tests::snapshot_write_persists_state_in_populated_partition' (2297627) panicked at crates/vo-storage/src/snapshots/tests.rs:134:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((100, InstanceState { counter: 42 })))

---- snapshots::tests::snapshot_write_boundary_instance_id_maximum stdout ----

thread 'snapshots::tests::snapshot_write_boundary_instance_id_maximum' (2297619) panicked at crates/vo-storage/src/snapshots/tests.rs:154:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((1, InstanceState { counter: 1 })))

failures:
    snapshots::tests::snapshot_load_latest_boundary_instance_id_maximum
    snapshots::tests::snapshot_load_latest_boundary_instance_id_minimum
    snapshots::tests::snapshot_load_latest_does_not_bleed_into_next_prefix_when_instance_a_is_less_than_b
    snapshots::tests::snapshot_load_latest_enforces_backward_seek_without_unbounded_iteration
    snapshots::tests::snapshot_load_latest_returns_the_snapshot_with_the_highest_sequence_number
    snapshots::tests::snapshot_write_boundary_instance_id_maximum
    snapshots::tests::snapshot_write_boundary_instance_id_minimum
    snapshots::tests::snapshot_write_overwrites_existing_data_idempotently
    snapshots::tests::snapshot_write_persists_state_in_populated_partition
    snapshots::tests::snapshot_write_persists_state_when_valid_state_and_sequence_provided

test result: FAILED. 308 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
