*** crates/vo-storage/src/snapshots/mod.rs:73:5: replace encode_snapshot_key -> Result<[u8; 24], StorageError> with Ok([1; 24])

*** mutation diff:
--- crates/vo-storage/src/snapshots/mod.rs
+++ replace encode_snapshot_key -> Result<[u8; 24], StorageError> with Ok([1; 24])
@@ -65,24 +65,17 @@
 ///
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if the `InstanceId` cannot be converted to bytes.
 pub fn encode_snapshot_key(
     instance_id: &InstanceId,
     sequence: u64,
 ) -> Result<[u8; 24], StorageError> {
-    let id_bytes = instance_id
-        .to_bytes()
-        .map_err(|_| StorageError::CorruptKey)?;
-    let seq_bytes = sequence.to_be_bytes();
-    let mut key = [0u8; 24];
-    key[..16].copy_from_slice(&id_bytes);
-    key[16..].copy_from_slice(&seq_bytes);
-    Ok(key)
+    Ok([1; 24]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a 24-byte snapshot key into an `(InstanceId, u64)` pair.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::InvalidKey` if `key` is not exactly 24 bytes.
 pub fn decode_snapshot_key(key: &[u8]) -> Result<(InstanceId, u64), StorageError> {

---- snapshots::tests::encode_snapshot_key_formats_key_exactly stdout ----

thread 'snapshots::tests::encode_snapshot_key_formats_key_exactly' (2305312) panicked at crates/vo-storage/src/snapshots/tests.rs:32:5:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 42]

---- snapshots::tests::encode_snapshot_key_boundary_minimum_sequence_and_id stdout ----

thread 'snapshots::tests::encode_snapshot_key_boundary_minimum_sequence_and_id' (2305311) panicked at crates/vo-storage/src/snapshots/tests.rs:39:5:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

---- snapshots::tests::encode_snapshot_key_boundary_maximum_sequence_and_id stdout ----

thread 'snapshots::tests::encode_snapshot_key_boundary_maximum_sequence_and_id' (2305310) panicked at crates/vo-storage/src/snapshots/tests.rs:47:5:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]

failures:
    snapshots::tests::encode_snapshot_key_boundary_maximum_sequence_and_id
    snapshots::tests::encode_snapshot_key_boundary_minimum_sequence_and_id
    snapshots::tests::encode_snapshot_key_formats_key_exactly
    snapshots::tests::encode_snapshot_key_uses_big_endian_for_sequence
    snapshots::tests::snapshot_load_latest_boundary_instance_id_maximum
    snapshots::tests::snapshot_load_latest_boundary_instance_id_minimum
    snapshots::tests::snapshot_load_latest_does_not_bleed_into_next_prefix_when_instance_a_is_less_than_b
    snapshots::tests::snapshot_load_latest_enforces_backward_seek_without_unbounded_iteration
    snapshots::tests::snapshot_load_latest_returns_deserialization_failed_on_corrupt_json_value
    snapshots::tests::snapshot_load_latest_returns_the_snapshot_with_the_highest_sequence_number
    snapshots::tests::snapshot_write_boundary_instance_id_maximum

test result: FAILED. 301 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
