*** crates/vo-storage/src/status_store.rs:105:5: replace write_registration_status -> Result<(), StatusStoreError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/status_store.rs
+++ replace write_registration_status -> Result<(), StatusStoreError> with Ok(())
@@ -97,23 +97,17 @@
 /// # Errors
 /// Returns `StatusStoreError::Storage` on Fjall failure.
 /// Returns `StatusStoreError::CorruptValue` if serialization fails.
 pub fn write_registration_status(
     partition: &fjall::PartitionHandle,
     workflow_name: &WorkflowName,
     status: RegistrationStatus,
 ) -> Result<(), StatusStoreError> {
-    let key = workflow_name.as_str().as_bytes();
-    let value = encode_status(status)?;
-    partition
-        .insert(key, &value)
-        .map_err(|e| StatusStoreError::Storage {
-            reason: e.to_string(),
-        })
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Load all persisted registration statuses from Fjall.
 ///
 /// Returns only non-Active entries (Active is the default and need not be persisted).
 ///
 /// # Errors
 /// Returns `StatusStoreError::Storage` on Fjall scan failure.

---- status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order stdout ----

thread 'status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order' (2324287) panicked at crates/vo-storage/src/status_store.rs:307:9:
assertion `left == right` failed
  left: Ok([])
 right: Ok([(WorkflowName("wf-deactivated"), Deactivated), (WorkflowName("wf-quarantined"), Quarantined)])

---- status_store::tests::read_registration_status_returns_written_status_for_existing_entry stdout ----

thread 'status_store::tests::read_registration_status_returns_written_status_for_existing_entry' (2324299) panicked at crates/vo-storage/src/status_store.rs:283:9:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some(Quarantined))

failures:
    status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order
    status_store::tests::read_registration_status_returns_written_status_for_existing_entry

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
