*** crates/vo-storage/src/status_store.rs:27:9: replace <impl std::fmt::Display for StatusStoreError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/status_store.rs
+++ replace <impl std::fmt::Display for StatusStoreError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -19,20 +19,17 @@
     Storage { reason: String },
 
     /// Stored value could not be decoded into a valid `RegistrationStatus`.
     CorruptValue { reason: String },
 }
 
 impl std::fmt::Display for StatusStoreError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            Self::Storage { reason } => write!(f, "storage error: {reason}"),
-            Self::CorruptValue { reason } => write!(f, "corrupt status value: {reason}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for StatusStoreError {}
 
 // ---------------------------------------------------------------------------
 // Calc layer — pure encode/decode
 // ---------------------------------------------------------------------------

---- status_store::tests::status_store_error_display_returns_exact_message_for_storage stdout ----

thread 'status_store::tests::status_store_error_display_returns_exact_message_for_storage' (2312904) panicked at crates/vo-storage/src/status_store.rs:221:9:
assertion `left == right` failed
  left: ""
 right: "storage error: disk offline"

---- status_store::tests::status_store_error_display_returns_exact_message_for_corrupt_value stdout ----

thread 'status_store::tests::status_store_error_display_returns_exact_message_for_corrupt_value' (2312898) panicked at crates/vo-storage/src/status_store.rs:229:9:
assertion `left == right` failed
  left: ""
 right: "corrupt status value: bad json"

failures:
    status_store::tests::status_store_error_display_returns_exact_message_for_corrupt_value
    status_store::tests::status_store_error_display_returns_exact_message_for_storage

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
