*** crates/vo-storage/src/status_store.rs:46:5: replace encode_status -> Result<Vec<u8>, StatusStoreError> with Ok(vec![0])

*** mutation diff:
--- crates/vo-storage/src/status_store.rs
+++ replace encode_status -> Result<Vec<u8>, StatusStoreError> with Ok(vec![0])
@@ -38,19 +38,17 @@
 // ---------------------------------------------------------------------------
 
 /// Encode a `RegistrationStatus` to JSON bytes.
 ///
 /// # Errors
 /// Returns `StatusStoreError::CorruptValue` if serialization fails (should not happen
 /// for a well-defined enum, but we handle it explicitly per zero-panic rule).
 pub fn encode_status(status: RegistrationStatus) -> Result<Vec<u8>, StatusStoreError> {
-    serde_json::to_vec(&status).map_err(|e| StatusStoreError::CorruptValue {
-        reason: e.to_string(),
-    })
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode JSON bytes into a `RegistrationStatus`.
 ///
 /// # Errors
 /// Returns `StatusStoreError::CorruptValue` if the bytes are not valid JSON
 /// or do not represent a known `RegistrationStatus` variant.
 pub fn decode_status(bytes: &[u8]) -> Result<RegistrationStatus, StatusStoreError> {

---- status_store::tests::encode_status_returns_json_bytes_for_active stdout ----

thread 'status_store::tests::encode_status_returns_json_bytes_for_active' (2318360) panicked at crates/vo-storage/src/status_store.rs:184:9:
assertion `left == right` failed
  left: [0]
 right: [34, 65, 99, 116, 105, 118, 101, 34]

---- status_store::tests::encode_status_returns_json_bytes_for_deactivated stdout ----

thread 'status_store::tests::encode_status_returns_json_bytes_for_deactivated' (2318392) panicked at crates/vo-storage/src/status_store.rs:196:9:
assertion `left == right` failed
  left: [0]
 right: [34, 68, 101, 97, 99, 116, 105, 118, 97, 116, 101, 100, 34]

---- status_store::tests::encode_status_returns_json_bytes_for_quarantined stdout ----

thread 'status_store::tests::encode_status_returns_json_bytes_for_quarantined' (2318403) panicked at crates/vo-storage/src/status_store.rs:190:9:
assertion `left == right` failed
  left: [0]
 right: [34, 81, 117, 97, 114, 97, 110, 116, 105, 110, 101, 100, 34]

failures:
    status_store::tests::encode_status_returns_json_bytes_for_active
    status_store::tests::encode_status_returns_json_bytes_for_deactivated
    status_store::tests::encode_status_returns_json_bytes_for_quarantined
    status_store::tests::encode_then_decode_is_identity_for_all_variants
    status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order
    status_store::tests::read_registration_status_returns_written_status_for_existing_entry

test result: FAILED. 312 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
