*** crates/vo-storage/src/timer_index.rs:100:24: replace == with != in TimerRecord::try_from_parts

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace == with != in TimerRecord::try_from_parts
@@ -92,17 +92,17 @@
     /// Returns `StorageError::InvalidArgument` if `duration_ms` is zero or if dual-clock invariant is violated.
     pub fn try_from_parts(
         timer_id: TimerId,
         instance_id: InstanceId,
         fire_at_ms: u64,
         trigger_time_ms: u64,
         duration_ms: u64,
     ) -> Result<Self, StorageError> {
-        if duration_ms == 0 {
+        if duration_ms != /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(StorageError::InvalidArgument);
         }
         // Dual-clock verification
         if fire_at_ms != trigger_time_ms.saturating_add(duration_ms) {
             return Err(StorageError::InvalidArgument);
         }
         Ok(Self {
             timer_id,

---- timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches stdout ----

thread 'timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches' (2346487) panicked at crates/vo-storage/src/timer_index.rs:492:9:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok(TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 1100, trigger_time_ms: 1000, duration_ms: 100 })

---- timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_duration_is_zero stdout ----

thread 'timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_duration_is_zero' (2346486) panicked at crates/vo-storage/src/timer_index.rs:508:9:
assertion `left == right` failed
  left: Ok(TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 1000, trigger_time_ms: 1000, duration_ms: 0 })
 right: Err(InvalidArgument)

failures:
    timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_duration_is_zero
    timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
