*** crates/vo-storage/src/timer_index.rs:159:5: replace timer_set -> Result<(), StorageError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace timer_set -> Result<(), StorageError> with Ok(())
@@ -151,29 +151,17 @@
     storage: &mut impl Storage,
     instance_id: InstanceId,
     timer_id: TimerId,
     fire_at_ms: u64,
     trigger_time_ms: u64,
     duration_ms: u64,
     now_ms: u64,
 ) -> Result<(), StorageError> {
-    if fire_at_ms <= now_ms {
-        return Err(StorageError::InvalidArgument);
-    }
-    if duration_ms == 0 {
-        return Err(StorageError::InvalidArgument);
-    }
-    if fire_at_ms != trigger_time_ms.saturating_add(duration_ms) {
-        return Err(StorageError::InvalidArgument);
-    }
-
-    let key = TimerKey::new(fire_at_ms, instance_id, timer_id)?;
-    let value = duration_ms.to_be_bytes();
-    storage.put(key.as_bytes(), &value)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Scans the timers partition for due timers for a specific instance.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if timer key or value bytes cannot be decoded.
 pub fn scan_due_timers(

---- timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now stdout ----

thread 'timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now' (2351438) panicked at crates/vo-storage/src/timer_index.rs:391:9:
assertion `left == right` failed
  left: 0
 right: 1

---- timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration stdout ----

thread 'timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration' (2351455) panicked at crates/vo-storage/src/timer_index.rs:581:9:
assertion `left == right` failed
  left: []
 right: [TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 2000, trigger_time_ms: 1500, duration_ms: 500 }]

---- timer_index::tests::fn_timer_delete_removes_existing_timer stdout ----

thread 'timer_index::tests::fn_timer_delete_removes_existing_timer' (2351463) panicked at crates/vo-storage/src/timer_index.rs:421:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now
    timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration
    timer_index::tests::fn_timer_delete_removes_existing_timer
    timer_index::tests::fn_timer_set_overwrites_existing_timer_when_same_key
    timer_index::tests::fn_timer_set_rejects_fire_at_ms_equal_to_now_ms
    timer_index::tests::fn_timer_set_rejects_when_dual_clock_invariant_is_broken
    timer_index::tests::fn_timer_set_rejects_zero_duration_ms_exact_variant
    timer_index::tests::fn_timer_set_returns_storage_when_put_fails
    timer_index::tests::fn_timer_set_stores_timer_when_fire_at_ms_greater_than_now_ms

test result: FAILED. 309 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
