*** crates/vo-storage/src/timer_index.rs:184:5: replace scan_due_timers -> Result<Vec<TimerRecord>, StorageError> with Ok(vec![])

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace scan_due_timers -> Result<Vec<TimerRecord>, StorageError> with Ok(vec![])
@@ -176,49 +176,17 @@
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if timer key or value bytes cannot be decoded.
 pub fn scan_due_timers(
     storage: &impl Storage,
     instance_id: &InstanceId,
     now_ms: u64,
 ) -> Result<Vec<TimerRecord>, StorageError> {
-    let start = [0u8; 40];
-    let end = {
-        let mut e = [0u8; 40];
-        e[0..8].copy_from_slice(&(now_ms.saturating_add(1)).to_be_bytes());
-        e
-    };
-
-    let pairs = storage.scan(&start, &end)?;
-    let records: Vec<TimerRecord> = pairs
-        .into_iter()
-        .filter_map(|(k, v)| {
-            let key_bytes: [u8; 40] = k.try_into().ok()?;
-            let key = TimerKey(key_bytes);
-            if key.instance_id() != *instance_id {
-                return None;
-            }
-            let fire_at_ms = key.fire_at_ms();
-            if fire_at_ms > now_ms {
-                return None;
-            }
-            let duration_bytes: [u8; 8] = v.try_into().ok()?;
-            let duration_ms = u64::from_be_bytes(duration_bytes);
-            let trigger_time_ms = fire_at_ms.saturating_sub(duration_ms);
-            Some(TimerRecord {
-                timer_id: key.timer_id(),
-                instance_id: key.instance_id(),
-                fire_at_ms,
-                trigger_time_ms,
-                duration_ms,
-            })
-        })
-        .collect();
-    Ok(records)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Deletes a timer from the timers partition.
 ///
 /// # Errors
 ///
 /// Returns `StorageError` if the underlying storage operation fails.
 pub fn timer_delete(

---- timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now stdout ----

thread 'timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now' (2361534) panicked at crates/vo-storage/src/timer_index.rs:371:9:
assertion `left == right` failed
  left: 0
 right: 1

---- timer_index::tests::fn_scan_due_timers_returns_storage_when_scan_fails stdout ----

thread 'timer_index::tests::fn_scan_due_timers_returns_storage_when_scan_fails' (2361547) panicked at crates/vo-storage/src/timer_index.rs:522:9:
assertion `left == right` failed
  left: Ok([])
 right: Err(Storage)

---- timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration stdout ----

thread 'timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration' (2361552) panicked at crates/vo-storage/src/timer_index.rs:561:9:
assertion `left == right` failed
  left: []
 right: [TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 2000, trigger_time_ms: 1500, duration_ms: 500 }]

failures:
    timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now
    timer_index::tests::fn_scan_due_timers_returns_storage_when_scan_fails
    timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
