*** crates/vo-storage/src/timer_index.rs:230:5: replace timer_delete -> Result<(), StorageError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace timer_delete -> Result<(), StorageError> with Ok(())
@@ -222,18 +222,17 @@
 ///
 /// Returns `StorageError` if the underlying storage operation fails.
 pub fn timer_delete(
     storage: &mut impl Storage,
     instance_id: &InstanceId,
     timer_id: TimerId,
     fire_at_ms: u64,
 ) -> Result<(), StorageError> {
-    let key = TimerKey::new(fire_at_ms, instance_id.clone(), timer_id)?;
-    storage.delete(key.as_bytes())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     #![allow(clippy::unwrap_used, clippy::redundant_clone)]
     use super::*;
     use proptest::prelude::*;

---- timer_index::tests::fn_timer_delete_removes_existing_timer stdout ----

thread 'timer_index::tests::fn_timer_delete_removes_existing_timer' (2372314) panicked at crates/vo-storage/src/timer_index.rs:440:9:
assertion `left == right` failed
  left: 1
 right: 0

---- timer_index::tests::fn_timer_delete_returns_storage_when_delete_fails stdout ----

thread 'timer_index::tests::fn_timer_delete_returns_storage_when_delete_fails' (2372320) panicked at crates/vo-storage/src/timer_index.rs:628:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(Storage)

failures:
    timer_index::tests::fn_timer_delete_removes_existing_timer
    timer_index::tests::fn_timer_delete_returns_storage_when_delete_fails

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
