*** crates/vo-storage/src/timer_index.rs:36:9: replace TimerKey::fire_at_ms -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace TimerKey::fire_at_ms -> u64 with 0
@@ -28,19 +28,17 @@
             &timer_id
                 .to_bytes()
                 .map_err(|_| StorageError::InvalidArgument)?,
         );
         Ok(Self(bytes))
     }
     #[must_use]
     pub const fn fire_at_ms(&self) -> u64 {
-        u64::from_be_bytes([
-            self.0[0], self.0[1], self.0[2], self.0[3], self.0[4], self.0[5], self.0[6], self.0[7],
-        ])
+        0 /* ~ changed by cargo-mutants ~ */
     }
     #[must_use]
     pub fn instance_id(&self) -> InstanceId {
         InstanceId::from_bytes(self.0[8..24].try_into().unwrap_or_default())
     }
     #[must_use]
     pub fn timer_id(&self) -> TimerId {
         TimerId::from_bytes(self.0[24..40].try_into().unwrap_or_default())

---- timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now stdout ----

thread 'timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now' (2330341) panicked at crates/vo-storage/src/timer_index.rs:402:9:
assertion `left == right` failed
  left: 0
 right: 1000

---- timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration stdout ----

thread 'timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration' (2330345) panicked at crates/vo-storage/src/timer_index.rs:591:9:
assertion `left == right` failed
  left: [TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 0, trigger_time_ms: 0, duration_ms: 500 }]
 right: [TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 2000, trigger_time_ms: 1500, duration_ms: 500 }]

---- timer_index::tests::fn_timer_key_new_encodes_bytes_correctly stdout ----

thread 'timer_index::tests::fn_timer_key_new_encodes_bytes_correctly' (2330352) panicked at crates/vo-storage/src/timer_index.rs:447:9:
assertion `left == right` failed
  left: 0
 right: 1234

failures:
    timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now
    timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration
    timer_index::tests::fn_timer_key_new_encodes_bytes_correctly

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
