*** crates/vo-types/src/compensation.rs:175:9: replace CompensationRecord::completed_at -> Option<&crate::types::TimestampMs> with None

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace CompensationRecord::completed_at -> Option<&crate::types::TimestampMs> with None
@@ -167,17 +167,17 @@
 
     #[must_use]
     pub fn started_at(&self) -> Option<&crate::types::TimestampMs> {
         self.started_at.as_ref()
     }
 
     #[must_use]
     pub fn completed_at(&self) -> Option<&crate::types::TimestampMs> {
-        self.completed_at.as_ref()
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Apply a state transition to a CompensationStatus.
 ///
 /// # Errors
 ///
 /// Returns `CompensationTransitionError::TerminalStateTransition` if the current state

*** result: Success
