*** crates/vo-types/src/compensation.rs:331:9: replace verification::verify_compensation_transition_exhaustiveness with ()

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace verification::verify_compensation_transition_exhaustiveness with ()
@@ -323,36 +323,17 @@
 #[cfg(kani)]
 mod verification {
     use super::*;
 
     /// K-01: Verify apply_compensation_transition exhaustiveness.
     /// All 5×3 = 15 combinations must be covered without panic.
     #[kani::proof]
     fn verify_compensation_transition_exhaustiveness() {
-        let state: u8 = kani::any();
-        let event: u8 = kani::any();
-        kani::assume(state < 5);
-        kani::assume(event < 3);
-
-        let current = match state {
-            0 => CompensationStatus::NotNeeded,
-            1 => CompensationStatus::Pending,
-            2 => CompensationStatus::InProgress,
-            3 => CompensationStatus::Succeeded,
-            _ => CompensationStatus::Failed,
-        };
-        let evt = match event {
-            0 => CompensationTransitionEvent::Start,
-            1 => CompensationTransitionEvent::Succeed,
-            _ => CompensationTransitionEvent::Fail,
-        };
-
-        // Must not panic — all combinations handled
-        let _ = apply_compensation_transition(current, evt);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// K-02: Verify CompensationRecord::new rejects empty effect_id.
     #[kani::proof]
     fn verify_compensation_record_rejects_empty_effect_id() {
         let effect_id = String::new();
         let result = CompensationRecord::new(
             effect_id,

*** result: Success
