*** crates/vo-types/src/compensation.rs:337:13: delete match arm 0 in verification::verify_compensation_transition_exhaustiveness

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ delete match arm 0 in verification::verify_compensation_transition_exhaustiveness
@@ -329,17 +329,17 @@
     #[kani::proof]
     fn verify_compensation_transition_exhaustiveness() {
         let state: u8 = kani::any();
         let event: u8 = kani::any();
         kani::assume(state < 5);
         kani::assume(event < 3);
 
         let current = match state {
-            0 => CompensationStatus::NotNeeded,
+             /* ~ changed by cargo-mutants ~ */
             1 => CompensationStatus::Pending,
             2 => CompensationStatus::InProgress,
             3 => CompensationStatus::Succeeded,
             _ => CompensationStatus::Failed,
         };
         let evt = match event {
             0 => CompensationTransitionEvent::Start,
             1 => CompensationTransitionEvent::Succeed,

*** result: Success
