*** crates/vo-types/src/compensation.rs:338:13: delete match arm 1 in verification::verify_compensation_transition_exhaustiveness

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ delete match arm 1 in verification::verify_compensation_transition_exhaustiveness
@@ -330,17 +330,17 @@
     fn verify_compensation_transition_exhaustiveness() {
         let state: u8 = kani::any();
         let event: u8 = kani::any();
         kani::assume(state < 5);
         kani::assume(event < 3);
 
         let current = match state {
             0 => CompensationStatus::NotNeeded,
-            1 => CompensationStatus::Pending,
+             /* ~ changed by cargo-mutants ~ */
             2 => CompensationStatus::InProgress,
             3 => CompensationStatus::Succeeded,
             _ => CompensationStatus::Failed,
         };
         let evt = match event {
             0 => CompensationTransitionEvent::Start,
             1 => CompensationTransitionEvent::Succeed,
             _ => CompensationTransitionEvent::Fail,

*** result: Success
