*** crates/vo-types/src/compensation.rs:340:13: delete match arm 3 in verification::verify_compensation_transition_exhaustiveness

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ delete match arm 3 in verification::verify_compensation_transition_exhaustiveness
@@ -332,17 +332,17 @@
         let event: u8 = kani::any();
         kani::assume(state < 5);
         kani::assume(event < 3);
 
         let current = match state {
             0 => CompensationStatus::NotNeeded,
             1 => CompensationStatus::Pending,
             2 => CompensationStatus::InProgress,
-            3 => CompensationStatus::Succeeded,
+             /* ~ changed by cargo-mutants ~ */
             _ => CompensationStatus::Failed,
         };
         let evt = match event {
             0 => CompensationTransitionEvent::Start,
             1 => CompensationTransitionEvent::Succeed,
             _ => CompensationTransitionEvent::Fail,
         };

*** result: Success
