*** crates/vo-types/src/compensation.rs:344:13: delete match arm 0 in verification::verify_compensation_transition_exhaustiveness

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ delete match arm 0 in verification::verify_compensation_transition_exhaustiveness
@@ -336,17 +336,17 @@
         let current = match state {
             0 => CompensationStatus::NotNeeded,
             1 => CompensationStatus::Pending,
             2 => CompensationStatus::InProgress,
             3 => CompensationStatus::Succeeded,
             _ => CompensationStatus::Failed,
         };
         let evt = match event {
-            0 => CompensationTransitionEvent::Start,
+             /* ~ changed by cargo-mutants ~ */
             1 => CompensationTransitionEvent::Succeed,
             _ => CompensationTransitionEvent::Fail,
         };
 
         // Must not panic — all combinations handled
         let _ = apply_compensation_transition(current, evt);
     }

*** result: Success
