*** crates/vo-types/src/compensation.rs:57:9: replace <impl std::fmt::Display for CompensationTransitionError>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace <impl std::fmt::Display for CompensationTransitionError>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -49,24 +49,17 @@
     /// Attempted transition from a terminal state (NotNeeded, Succeeded, Failed).
     TerminalStateTransition,
     /// Transition event is not valid for the current state.
     InvalidTransition,
 }
 
 impl std::fmt::Display for CompensationTransitionError {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            CompensationTransitionError::TerminalStateTransition => {
-                write!(f, "Cannot transition from terminal compensation state")
-            }
-            CompensationTransitionError::InvalidTransition => {
-                write!(f, "Invalid compensation state transition")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for CompensationTransitionError {}
 
 /// Persisted record of a compensation action for a committed effect (ADR-034).
 #[derive(Debug, Clone, PartialEq, Eq, Hash, serde::Serialize, serde::Deserialize)]
 pub struct CompensationRecord {

*** result: Success
