*** crates/vo-types/src/compensation.rs:89:9: replace CompensationStatus::is_terminal -> bool with false

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace CompensationStatus::is_terminal -> bool with false
@@ -81,22 +81,17 @@
 // ============================================================================
 // Calc Layer: Pure Functions
 // ============================================================================
 
 impl CompensationStatus {
     /// Check if this state is terminal (NotNeeded, Succeeded, or Failed).
     #[must_use]
     pub const fn is_terminal(self) -> bool {
-        matches!(
-            self,
-            CompensationStatus::NotNeeded
-                | CompensationStatus::Succeeded
-                | CompensationStatus::Failed
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns all CompensationStatus variants in declaration order.
     #[must_use]
     pub const fn all_variants() -> &'static [CompensationStatus] {
         &[
             CompensationStatus::NotNeeded,
             CompensationStatus::Pending,

*** result: Success
