*** crates/vo-executor/src/lib.rs:206:9: replace RetryPolicy::calculate_backoff_delay -> u64 with 1

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace RetryPolicy::calculate_backoff_delay -> u64 with 1
@@ -198,24 +198,17 @@
     /// Calculate the backoff delay for a given attempt.
     ///
     /// Formula: `backoff_ms * multiplier^(attempt - 1)`
     ///
     /// Returns `u64::MAX` if the calculation would overflow.
     #[must_use]
     #[allow(clippy::cast_possible_truncation, clippy::cast_sign_loss)]
     pub fn calculate_backoff_delay(&self, attempt: u32) -> u64 {
-        let exponent = attempt.saturating_sub(1).cast_signed();
-        let multiplier_pow = self.backoff_multiplier.powi(exponent);
-        #[allow(clippy::cast_precision_loss)]
-        let product = self.backoff_ms as f64 * multiplier_pow;
-        // Clamp to u64::MAX to prevent overflow
-        #[allow(clippy::cast_precision_loss)]
-        let clamped = product.min(u64::MAX as f64);
-        clamped as u64
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl StepResult {
     /// Check if the step result indicates success.
     #[must_use]
     pub fn is_success(&self) -> bool {
         matches!(self, StepResult::Success { .. })

---- integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff stdout ----

thread 'integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff' (3773041) panicked at crates/vo-executor/tests/integration_tests.rs:342:9:
assertion `left == right` failed
  left: 1
 right: 0

---- integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values stdout ----

thread 'integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values' (3773039) panicked at crates/vo-executor/tests/integration_tests.rs:331:9:
assertion `left == right` failed
  left: 1
 right: 100

---- integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2 stdout ----

thread 'integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2' (3773026) panicked at crates/vo-executor/tests/integration_tests.rs:835:9:
Expected ~100ms of backoff sleep (1 sleep) for max_attempts=2, got 2ms. If `>` was changed to `<`, no sleeps would occur (immediate).

failures:
    integration_tests::execute_step_with_retry_verifies_backoff_timing
    integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2
    integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3
    integration_tests::retry_policy_calculate_backoff_delay_returns_expected_values
    integration_tests::retry_policy_calculate_backoff_delay_with_zero_backoff

test result: FAILED. 47 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
