*** crates/vo-executor/src/lib.rs:276:5: replace clear_error with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace clear_error with ()
@@ -268,17 +268,17 @@
 
 /// Set state for a step.
 fn set_state(step_id: &str, state: StepState) {
     STATE.insert(step_id.to_string(), state);
 }
 
 /// Clear any stored error for a step.
 fn clear_error(step_id: &str) {
-    LAST_ERROR.remove(step_id);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Store an error for a step.
 fn set_error(step_id: &str, err: ExecuteNodeError) {
     LAST_ERROR.insert(step_id.to_string(), err);
 }
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.

*** result: Success
