*** crates/vo-executor/src/lib.rs:277:5: replace clear_error with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace clear_error with ()
@@ -269,17 +269,17 @@
 /// Set state for a step.
 fn set_state(step_id: &str, state: StepState) {
     STATE.insert(step_id.to_string(), state);
 }
 
 /// Clear any stored error for a step.
 ///pub for testing
 pub fn clear_error(step_id: &str) {
-    LAST_ERROR.remove(step_id);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Store an error for a step.
 ///pub for testing
 pub fn set_error(step_id: &str, err: ExecuteNodeError) {
     LAST_ERROR.insert(step_id.to_string(), err);
 }

---- integration_tests::transient_error_cleared_by_clear_error_is_not_persisted stdout ----

thread 'integration_tests::transient_error_cleared_by_clear_error_is_not_persisted' (3778504) panicked at crates/vo-executor/tests/integration_tests.rs:532:9:
Error should be cleared after clear_error. If this fails, clear_error was deleted.

failures:
    integration_tests::transient_error_cleared_by_clear_error_is_not_persisted

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
