*** crates/vo-executor/src/lib.rs:281:5: replace set_error with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace set_error with ()
@@ -273,17 +273,17 @@
 
 /// Clear any stored error for a step.
 fn clear_error(step_id: &str) {
     LAST_ERROR.remove(step_id);
 }
 
 /// Store an error for a step.
 fn set_error(step_id: &str, err: ExecuteNodeError) {
-    LAST_ERROR.insert(step_id.to_string(), err);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
         "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
             StepBehavior::Success
         }

---- integration_tests::get_last_error_returns_error_after_transient_failure stdout ----

thread 'integration_tests::get_last_error_returns_error_after_transient_failure' (740885) panicked at crates/vo-executor/tests/integration_tests.rs:212:9:
assertion failed: error.is_some()

---- integration_tests::get_last_error_returns_none_after_error_is_cleared stdout ----

thread 'integration_tests::get_last_error_returns_none_after_error_is_cleared' (740887) panicked at crates/vo-executor/tests/integration_tests.rs:485:9:
Error should be stored after first transient failure

---- integration_tests::transient_error_is_not_persisted_across_different_steps stdout ----

thread 'integration_tests::transient_error_is_not_persisted_across_different_steps' (740904) panicked at crates/vo-executor/tests/integration_tests.rs:524:9:
Error should be stored for step_transient

failures:
    integration_tests::get_last_error_returns_error_after_transient_failure
    integration_tests::get_last_error_returns_none_after_error_is_cleared
    integration_tests::transient_error_is_not_persisted_across_different_steps

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
