*** crates/vo-executor/src/lib.rs:283:5: replace set_error with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace set_error with ()
@@ -275,17 +275,17 @@
 ///pub for testing
 pub fn clear_error(step_id: &str) {
     LAST_ERROR.remove(step_id);
 }
 
 /// Store an error for a step.
 ///pub for testing
 pub fn set_error(step_id: &str, err: ExecuteNodeError) {
-    LAST_ERROR.insert(step_id.to_string(), err);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
         "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
             StepBehavior::Success
         }

---- integration_tests::get_last_error_returns_error_after_transient_failure stdout ----

thread 'integration_tests::get_last_error_returns_error_after_transient_failure' (3778465) panicked at crates/vo-executor/tests/integration_tests.rs:212:9:
assertion failed: error.is_some()

---- integration_tests::get_last_error_returns_none_after_error_is_cleared stdout ----

thread 'integration_tests::get_last_error_returns_none_after_error_is_cleared' (3778468) panicked at crates/vo-executor/tests/integration_tests.rs:484:9:
Error should be stored after first transient failure

---- integration_tests::transient_error_cleared_by_clear_error_is_not_persisted stdout ----

thread 'integration_tests::transient_error_cleared_by_clear_error_is_not_persisted' (3778497) panicked at crates/vo-executor/tests/integration_tests.rs:522:9:
Error should be set after set_error

failures:
    integration_tests::get_last_error_returns_error_after_transient_failure
    integration_tests::get_last_error_returns_none_after_error_is_cleared
    integration_tests::transient_error_cleared_by_clear_error_is_not_persisted
    integration_tests::transient_error_is_not_persisted_across_different_steps

test result: FAILED. 48 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
