*** crates/vo-executor/src/lib.rs:292:9: delete match arm "step-slow" in step_behavior

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ delete match arm "step-slow" in step_behavior
@@ -284,17 +284,17 @@
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
         "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
             StepBehavior::Success
         }
         "step-fail" => StepBehavior::Failure,
         "step-transient" | "step-flaky" => StepBehavior::Transient,
-        "step-slow" => StepBehavior::Slow,
+         /* ~ changed by cargo-mutants ~ */
         _ => StepBehavior::NotFound,
     }
 }
 
 #[derive(Debug, Clone, Copy)]
 enum StepBehavior {
     Success,
     Failure,

---- integration_tests::execute_step_timeout_for_slow_step stdout ----

thread 'integration_tests::execute_step_timeout_for_slow_step' (744070) panicked at crates/vo-executor/tests/integration_tests.rs:37:9:
assertion `left == right` failed
  left: Err(StepNotFound { step_id: StepId("step-slow") })
 right: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 1 })

---- integration_tests::execute_step_with_retry_timeout_exceeded stdout ----

thread 'integration_tests::execute_step_with_retry_timeout_exceeded' (744081) panicked at crates/vo-executor/tests/integration_tests.rs:462:9:
assertion failed: matches!(result, Err(vo_executor::ExecuteNodeError::TimeoutExceeded { .. }))

---- integration_tests::slow_step_with_sufficient_timeout_does_not_timeout stdout ----

thread 'integration_tests::slow_step_with_sufficient_timeout_does_not_timeout' (744103) panicked at crates/vo-executor/tests/integration_tests.rs:693:9:
Slow step with timeout >= 3000 should succeed. If `&&` was changed to `||`, this would incorrectly timeout. Got: Err(StepNotFound { step_id: StepId("step-slow") })

failures:
    integration_tests::execute_step_timeout_for_slow_step
    integration_tests::execute_step_with_retry_timeout_exceeded
    integration_tests::slow_step_timeout_boundary_exactly_at_threshold
    integration_tests::slow_step_with_sufficient_timeout_does_not_timeout

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
