*** crates/vo-executor/src/lib.rs:293:9: delete match arm "step-transient" | "step-flaky" in step_behavior

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ delete match arm "step-transient" | "step-flaky" in step_behavior
@@ -285,17 +285,17 @@
 
 /// **NOTE:** This is test infrastructure that simulates workflow step behavior.
 fn step_behavior(step_id: &str) -> StepBehavior {
     match step_id {
         "step-1" | "step-good" | "step-valid" | "step-retry" | "workflow-step-1" => {
             StepBehavior::Success
         }
         "step-fail" => StepBehavior::Failure,
-        "step-transient" | "step-flaky" => StepBehavior::Transient,
+         /* ~ changed by cargo-mutants ~ */
         "step-slow" => StepBehavior::Slow,
         _ => StepBehavior::NotFound,
     }
 }
 
 #[derive(Debug, Clone, Copy)]
 enum StepBehavior {
     Success,

---- integration_tests::execute_step_returns_transient_error_for_step_transient stdout ----

thread 'integration_tests::execute_step_returns_transient_error_for_step_transient' (3781000) panicked at crates/vo-executor/tests/integration_tests.rs:99:22:
Expected TransientError, got StepNotFound { step_id: StepId("step-transient") }

---- integration_tests::get_last_error_returns_error_after_transient_failure stdout ----

thread 'integration_tests::get_last_error_returns_error_after_transient_failure' (3781023) panicked at crates/vo-executor/tests/integration_tests.rs:212:9:
assertion failed: error.is_some()

---- integration_tests::get_last_error_returns_none_after_error_is_cleared stdout ----

thread 'integration_tests::get_last_error_returns_none_after_error_is_cleared' (3781025) panicked at crates/vo-executor/tests/integration_tests.rs:484:9:
Error should be stored after first transient failure

failures:
    integration_tests::execute_step_returns_transient_error_for_step_transient
    integration_tests::get_last_error_returns_error_after_transient_failure
    integration_tests::get_last_error_returns_none_after_error_is_cleared
    integration_tests::transient_error_is_not_persisted_across_different_steps

test result: FAILED. 48 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
