*** crates/vo-executor/src/lib.rs:332:5: replace validate_timeout -> Result<(), ExecuteNodeError> with Ok(())

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace validate_timeout -> Result<(), ExecuteNodeError> with Ok(())
@@ -324,29 +324,17 @@
     check_not_executing(&step_id)?;
     let behavior = check_step_exists(&step_id)?;
     start_execution(&step_id);
     handle_slow_step_timeout(&step_id, timeout_ms, behavior)?;
     execute_and_transition(&step_id, behavior)
 }
 
 fn validate_timeout(timeout_ms: u64) -> Result<(), ExecuteNodeError> {
-    if timeout_ms == 0 {
-        return Err(ExecuteNodeError::InvalidTimeout {
-            value: 0,
-            reason: "must be > 0ms".to_string(),
-        });
-    }
-    if timeout_ms == u64::MAX {
-        return Err(ExecuteNodeError::InvalidTimeout {
-            value: u64::MAX,
-            reason: "must be < u64::MAX".to_string(),
-        });
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn check_not_executing(step_id: &StepId) -> Result<(), ExecuteNodeError> {
     if matches!(get_state(step_id.as_str()), StepState::Executing { .. }) {
         return Err(ExecuteNodeError::InvalidTransition {
             from_state: "Executing".to_string(),
             action: "execute_step".to_string(),
         });

---- integration_tests::execute_step_rejects_zero_timeout stdout ----

thread 'integration_tests::execute_step_rejects_zero_timeout' (745530) panicked at crates/vo-executor/tests/integration_tests.rs:14:9:
assertion `left == right` failed
  left: Ok(Success { output: "done" })
 right: Err(InvalidTimeout { value: 0, reason: "must be > 0ms" })

---- integration_tests::execute_step_rejects_max_u64_timeout stdout ----

thread 'integration_tests::execute_step_rejects_max_u64_timeout' (745529) panicked at crates/vo-executor/tests/integration_tests.rs:251:9:
assertion `left == right` failed
  left: Ok(Success { output: "done" })
 right: Err(InvalidTimeout { value: 18446744073709551615, reason: "must be < u64::MAX" })

failures:
    integration_tests::execute_step_rejects_max_u64_timeout
    integration_tests::execute_step_rejects_zero_timeout

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
