*** crates/vo-executor/src/lib.rs:338:19: replace == with != in validate_timeout

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace == with != in validate_timeout
@@ -330,17 +330,17 @@
 
 fn validate_timeout(timeout_ms: u64) -> Result<(), ExecuteNodeError> {
     if timeout_ms == 0 {
         return Err(ExecuteNodeError::InvalidTimeout {
             value: 0,
             reason: "must be > 0ms".to_string(),
         });
     }
-    if timeout_ms == u64::MAX {
+    if timeout_ms != /* ~ changed by cargo-mutants ~ */ u64::MAX {
         return Err(ExecuteNodeError::InvalidTimeout {
             value: u64::MAX,
             reason: "must be < u64::MAX".to_string(),
         });
     }
     Ok(())
 }

---- integration_tests::execute_step_timeout_for_slow_step stdout ----

thread 'integration_tests::execute_step_timeout_for_slow_step' (747011) panicked at crates/vo-executor/tests/integration_tests.rs:37:9:
assertion `left == right` failed
  left: Err(InvalidTimeout { value: 18446744073709551615, reason: "must be < u64::MAX" })
 right: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 1 })

---- integration_tests::execute_step_failure_for_step_fail stdout ----

thread 'integration_tests::execute_step_failure_for_step_fail' (747004) panicked at crates/vo-executor/tests/integration_tests.rs:226:9:
assertion `left == right` failed
  left: Err(InvalidTimeout { value: 18446744073709551615, reason: "must be < u64::MAX" })
 right: Ok(Failure { output: "error: exit code 1" })

---- integration_tests::execute_step_success_for_step_1 stdout ----

thread 'integration_tests::execute_step_success_for_step_1' (747010) panicked at crates/vo-executor/tests/integration_tests.rs:26:9:
assertion `left == right` failed
  left: Err(InvalidTimeout { value: 18446744073709551615, reason: "must be < u64::MAX" })
 right: Ok(Success { output: "done" })

failures:
    integration_tests::execute_step_failure_for_step_fail
    integration_tests::execute_step_not_found_for_unknown_step
    integration_tests::execute_step_rejects_max_u64_timeout
    integration_tests::execute_step_returns_transient_error_for_step_transient
    integration_tests::execute_step_success_for_step_1
    integration_tests::execute_step_timeout_for_slow_step
    integration_tests::execute_step_twice_in_sequence_succeeds
    integration_tests::execute_step_with_retry_step_not_found
    integration_tests::execute_step_with_retry_success
    integration_tests::execute_step_with_retry_success_for_non_flaky_step
    integration_tests::execute_step_with_retry_timeout_exceeded
    integration_tests::get_last_error_returns_error_after_transient_failure

test result: FAILED. 35 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
