*** crates/vo-executor/src/lib.rs:348:5: replace check_not_executing -> Result<(), ExecuteNodeError> with Ok(())

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace check_not_executing -> Result<(), ExecuteNodeError> with Ok(())
@@ -340,23 +340,17 @@
             value: u64::MAX,
             reason: "must be < u64::MAX".to_string(),
         });
     }
     Ok(())
 }
 
 fn check_not_executing(step_id: &StepId) -> Result<(), ExecuteNodeError> {
-    if matches!(get_state(step_id.as_str()), StepState::Executing { .. }) {
-        return Err(ExecuteNodeError::InvalidTransition {
-            from_state: "Executing".to_string(),
-            action: "execute_step".to_string(),
-        });
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn check_step_exists(step_id: &StepId) -> Result<StepBehavior, ExecuteNodeError> {
     let behavior = step_behavior(step_id.as_str());
     if matches!(behavior, StepBehavior::NotFound) {
         return Err(ExecuteNodeError::StepNotFound {
             step_id: step_id.clone(),
         });

---- integration_tests::cancel_execution_returns_ok_for_ready_state stdout ----

thread 'integration_tests::cancel_execution_returns_ok_for_ready_state' (748291) panicked at crates/vo-executor/tests/integration_tests.rs:86:9:
assertion `left == right` failed
  left: Err(ExecutionCancelled { reason: "cancelled by user" })
 right: Ok(())

failures:
    integration_tests::cancel_execution_returns_ok_for_ready_state

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
