*** crates/vo-executor/src/lib.rs:384:47: replace && with || in handle_slow_step_timeout

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace && with || in handle_slow_step_timeout
@@ -376,17 +376,17 @@
     clear_error(step_id.as_str());
 }
 
 fn handle_slow_step_timeout(
     step_id: &StepId,
     timeout_ms: u64,
     behavior: StepBehavior,
 ) -> Result<(), ExecuteNodeError> {
-    if matches!(behavior, StepBehavior::Slow) && timeout_ms < SLOW_STEP_DURATION_MS {
+    if matches!(behavior, StepBehavior::Slow) || /* ~ changed by cargo-mutants ~ */ timeout_ms < SLOW_STEP_DURATION_MS {
         set_state(step_id.as_str(), StepState::Ready);
         return Err(ExecuteNodeError::TimeoutExceeded {
             elapsed_ms: SLOW_STEP_DURATION_MS,
             limit_ms: timeout_ms,
         });
     }
     Ok(())
 }

---- integration_tests::slow_step_timeout_boundary_exactly_at_threshold stdout ----

thread 'integration_tests::slow_step_timeout_boundary_exactly_at_threshold' (750941) panicked at crates/vo-executor/tests/integration_tests.rs:563:9:
Slow step with timeout == 3000ms should succeed (boundary case). Got: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 3000 })

---- integration_tests::slow_step_with_sufficient_timeout_does_not_timeout stdout ----

thread 'integration_tests::slow_step_with_sufficient_timeout_does_not_timeout' (750942) panicked at crates/vo-executor/tests/integration_tests.rs:693:9:
Slow step with timeout >= 3000 should succeed. If `&&` was changed to `||`, this would incorrectly timeout. Got: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 5000 })

failures:
    integration_tests::slow_step_timeout_boundary_exactly_at_threshold
    integration_tests::slow_step_with_sufficient_timeout_does_not_timeout

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
