*** crates/vo-executor/src/lib.rs:384:61: replace < with > in handle_slow_step_timeout

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace < with > in handle_slow_step_timeout
@@ -376,17 +376,17 @@
     clear_error(step_id.as_str());
 }
 
 fn handle_slow_step_timeout(
     step_id: &StepId,
     timeout_ms: u64,
     behavior: StepBehavior,
 ) -> Result<(), ExecuteNodeError> {
-    if matches!(behavior, StepBehavior::Slow) && timeout_ms < SLOW_STEP_DURATION_MS {
+    if matches!(behavior, StepBehavior::Slow) && timeout_ms > /* ~ changed by cargo-mutants ~ */ SLOW_STEP_DURATION_MS {
         set_state(step_id.as_str(), StepState::Ready);
         return Err(ExecuteNodeError::TimeoutExceeded {
             elapsed_ms: SLOW_STEP_DURATION_MS,
             limit_ms: timeout_ms,
         });
     }
     Ok(())
 }

---- integration_tests::execute_step_timeout_for_slow_step stdout ----

thread 'integration_tests::execute_step_timeout_for_slow_step' (755933) panicked at crates/vo-executor/tests/integration_tests.rs:37:9:
assertion `left == right` failed
  left: Ok(Success { output: "done" })
 right: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 1 })

---- integration_tests::execute_step_with_retry_timeout_exceeded stdout ----

thread 'integration_tests::execute_step_with_retry_timeout_exceeded' (755951) panicked at crates/vo-executor/tests/integration_tests.rs:462:9:
assertion failed: matches!(result, Err(vo_executor::ExecuteNodeError::TimeoutExceeded { .. }))

---- integration_tests::slow_step_with_sufficient_timeout_does_not_timeout stdout ----

thread 'integration_tests::slow_step_with_sufficient_timeout_does_not_timeout' (755991) panicked at crates/vo-executor/tests/integration_tests.rs:693:9:
Slow step with timeout >= 3000 should succeed. If `&&` was changed to `||`, this would incorrectly timeout. Got: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 5000 })

failures:
    integration_tests::execute_step_timeout_for_slow_step
    integration_tests::execute_step_with_retry_timeout_exceeded
    integration_tests::slow_step_with_sufficient_timeout_does_not_timeout

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
