*** crates/vo-executor/src/lib.rs:386:61: replace < with <= in handle_slow_step_timeout

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace < with <= in handle_slow_step_timeout
@@ -378,17 +378,17 @@
     clear_error(step_id.as_str());
 }
 
 fn handle_slow_step_timeout(
     step_id: &StepId,
     timeout_ms: u64,
     behavior: StepBehavior,
 ) -> Result<(), ExecuteNodeError> {
-    if matches!(behavior, StepBehavior::Slow) && timeout_ms < SLOW_STEP_DURATION_MS {
+    if matches!(behavior, StepBehavior::Slow) && timeout_ms <= /* ~ changed by cargo-mutants ~ */ SLOW_STEP_DURATION_MS {
         set_state(step_id.as_str(), StepState::Ready);
         return Err(ExecuteNodeError::TimeoutExceeded {
             elapsed_ms: SLOW_STEP_DURATION_MS,
             limit_ms: timeout_ms,
         });
     }
     Ok(())
 }

---- integration_tests::slow_step_timeout_boundary_exactly_at_threshold stdout ----

thread 'integration_tests::slow_step_timeout_boundary_exactly_at_threshold' (3789684) panicked at crates/vo-executor/tests/integration_tests.rs:594:9:
Slow step with timeout == 3000ms should succeed (boundary case). Got: Err(TimeoutExceeded { elapsed_ms: 3000, limit_ms: 3000 })

failures:
    integration_tests::slow_step_timeout_boundary_exactly_at_threshold

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
