*** crates/vo-executor/src/lib.rs:518:5: replace sleep_with_backoff with ()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace sleep_with_backoff with ()
@@ -510,23 +510,17 @@
     }
     Err(ExecuteNodeError::RetryExhausted {
         attempts: 1,
         last_error: Box::new(transient_err),
     })
 }
 
 async fn sleep_with_backoff(retry_policy: &RetryPolicy, attempt: u32) {
-    use std::time::Duration;
-    use tokio::time::sleep;
-
-    sleep(Duration::from_millis(
-        retry_policy.calculate_backoff_delay(attempt),
-    ))
-    .await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Cancel an in-progress execution.
 ///
 /// Returns Ok(()) from Ready, Cancelled, or Completed states (no-op).
 /// Returns Err(ExecutionCancelled) if called during Executing state.
 ///
 /// # Errors

---- integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3 stdout ----

thread 'integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3' (3796985) panicked at crates/vo-executor/tests/integration_tests.rs:796:9:
Expected at least ~300ms of backoff sleep (2 sleeps) for max_attempts=3, got 0ms. If `>` was changed to `==`, only one sleep (100ms) would occur.

---- integration_tests::execute_step_with_retry_verifies_backoff_timing stdout ----

thread 'integration_tests::execute_step_with_retry_verifies_backoff_timing' (3796983) panicked at crates/vo-executor/tests/integration_tests.rs:874:9:
Expected ~450ms of backoff sleep for exponential backoff (150ms * 2^0 + 150ms * 2^1), got 0ms. If sleep_with_backoff was deleted, elapsed would be ~0ms.

---- integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2 stdout ----

thread 'integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2' (3796984) panicked at crates/vo-executor/tests/integration_tests.rs:835:9:
Expected ~100ms of backoff sleep (1 sleep) for max_attempts=2, got 0ms. If `>` was changed to `<`, no sleeps would occur (immediate).

failures:
    integration_tests::execute_step_with_retry_verifies_backoff_timing
    integration_tests::execute_step_with_retry_verifies_one_sleep_for_max_attempts_2
    integration_tests::execute_step_with_retry_verifies_two_sleeps_for_max_attempts_3

test result: FAILED. 49 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
