*** crates/vo-executor/src/lib.rs:537:5: replace cancel_execution -> Result<(), ExecuteNodeError> with Ok(())

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace cancel_execution -> Result<(), ExecuteNodeError> with Ok(())
@@ -529,31 +529,17 @@
 /// Returns Ok(()) from Ready, Cancelled, or Completed states (no-op).
 /// Returns Err(ExecutionCancelled) if called during Executing state.
 ///
 /// # Errors
 ///
 /// Returns [`ExecuteNodeError::ExecutionCancelled`] if called during Executing state.
 #[allow(clippy::unused_async)]
 pub async fn cancel_execution(step_id: StepId) -> Result<(), ExecuteNodeError> {
-    match get_state(step_id.as_str()) {
-        StepState::Executing { .. } => Err(ExecuteNodeError::ExecutionCancelled {
-            reason: "cancelled by user".to_string(),
-        }),
-        StepState::Ready => {
-            set_state(
-                step_id.as_str(),
-                StepState::Cancelled {
-                    reason: "cancelled by user".to_string(),
-                },
-            );
-            Ok(())
-        }
-        StepState::Cancelled { .. } | StepState::Completed { .. } => Ok(()),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Get current execution status for a step.
 #[must_use]
 pub fn get_execution_status(step_id: &StepId) -> ExecutionStatus {
     match get_state(step_id.as_str()) {
         StepState::Ready => ExecutionStatus::Ready,
         StepState::Executing {

---- integration_tests::get_execution_status_returns_cancelled_after_cancel stdout ----

thread 'integration_tests::get_execution_status_returns_cancelled_after_cancel' (3796724) panicked at crates/vo-executor/tests/integration_tests.rs:186:22:
Expected Cancelled status, got Ready

failures:
    integration_tests::get_execution_status_returns_cancelled_after_cancel

test result: FAILED. 51 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
