*** crates/vo-executor/src/lib.rs:578:5: replace get_last_error -> Option<ExecuteNodeError> with None

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace get_last_error -> Option<ExecuteNodeError> with None
@@ -570,10 +570,10 @@
         StepState::Completed { output } => ExecutionStatus::Completed { output },
         StepState::Cancelled { reason } => ExecutionStatus::Cancelled { reason },
     }
 }
 
 /// Get the last error for a step (if any).
 #[must_use]
 pub fn get_last_error(step_id: &StepId) -> Option<ExecuteNodeError> {
-    LAST_ERROR.get(step_id.as_str()).map(|v| v.clone())
+    None /* ~ changed by cargo-mutants ~ */
 }

---- integration_tests::execute_step_twice_in_sequence_succeeds stdout ----

thread 'integration_tests::execute_step_twice_in_sequence_succeeds' (3797974) panicked at crates/vo-executor/tests/integration_tests.rs:362:9:
assertion failed: result1.is_ok()

---- integration_tests::get_last_error_returns_error_after_transient_failure stdout ----

thread 'integration_tests::get_last_error_returns_error_after_transient_failure' (3797994) panicked at crates/vo-executor/tests/integration_tests.rs:212:9:
assertion failed: error.is_some()

---- integration_tests::get_last_error_returns_none_after_error_is_cleared stdout ----

thread 'integration_tests::get_last_error_returns_none_after_error_is_cleared' (3797996) panicked at crates/vo-executor/tests/integration_tests.rs:484:9:
Error should be stored after first transient failure

failures:
    integration_tests::execute_step_twice_in_sequence_succeeds
    integration_tests::get_last_error_returns_error_after_transient_failure
    integration_tests::get_last_error_returns_none_after_error_is_cleared
    integration_tests::transient_error_cleared_by_clear_error_is_not_persisted
    integration_tests::transient_error_is_not_persisted_across_different_steps

test result: FAILED. 47 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
