*** crates/vo-executor/src/lib.rs:70:9: replace <impl From<StepId> for String>::from -> Self with Default::default()

*** mutation diff:
--- crates/vo-executor/src/lib.rs
+++ replace <impl From<StepId> for String>::from -> Self with Default::default()
@@ -62,17 +62,17 @@
 impl AsRef<str> for StepId {
     fn as_ref(&self) -> &str {
         &self.0
     }
 }
 
 impl From<StepId> for String {
     fn from(id: StepId) -> Self {
-        id.0
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Display for StepId {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         write!(f, "{}", self.0)
     }
 }

---- integration_tests::step_id_from_trait_works stdout ----

thread 'integration_tests::step_id_from_trait_works' (733118) panicked at crates/vo-executor/tests/integration_tests.rs:454:9:
assertion `left == right` failed
  left: ""
 right: "my-step"

failures:
    integration_tests::step_id_from_trait_works

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
