*** crates/vo-storage/src/append.rs:104:9: replace WriteBudget::can_write -> bool with true

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace WriteBudget::can_write -> bool with true
@@ -96,17 +96,17 @@
                 .saturating_sub(*self.projection_used.borrow()),
             WriteClass::BulkBlob => self.blob_limit.saturating_sub(*self.blob_used.borrow()),
         }
     }
 
     /// Checks if a write of the given class would exceed available budget.
     #[must_use]
     pub fn can_write(&self, class: WriteClass, size_bytes: u64) -> bool {
-        self.remaining(class) >= size_bytes
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reserves budget for a write.
     ///
     /// # Errors
     /// Returns `BudgetError` if the write would exceed available budget.
     pub fn reserve(&self, class: WriteClass, size_bytes: u64) -> Result<(), BudgetError> {
         let remaining = self.remaining(class);

*** result: Success
