*** crates/vo-storage/src/append.rs:112:9: replace WriteBudget::reserve -> Result<(), BudgetError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace WriteBudget::reserve -> Result<(), BudgetError> with Ok(())
@@ -104,36 +104,17 @@
         self.remaining(class) >= size_bytes
     }
 
     /// Reserves budget for a write.
     ///
     /// # Errors
     /// Returns `BudgetError` if the write would exceed available budget.
     pub fn reserve(&self, class: WriteClass, size_bytes: u64) -> Result<(), BudgetError> {
-        let remaining = self.remaining(class);
-        if remaining < size_bytes {
-            return Err(BudgetError {
-                class,
-                requested: size_bytes,
-                available: remaining,
-            });
-        }
-        match class {
-            WriteClass::CriticalControlPlane => {
-                *self.critical_used.borrow_mut() += size_bytes;
-            }
-            WriteClass::OperatorProjection => {
-                *self.projection_used.borrow_mut() += size_bytes;
-            }
-            WriteClass::BulkBlob => {
-                *self.blob_used.borrow_mut() += size_bytes;
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Budget exceeded error.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct BudgetError {
     pub class: WriteClass,
     pub requested: u64,

*** result: Success
