*** crates/vo-storage/src/append.rs:113:22: replace < with <= in WriteBudget::reserve

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace < with <= in WriteBudget::reserve
@@ -105,17 +105,17 @@
     }
 
     /// Reserves budget for a write.
     ///
     /// # Errors
     /// Returns `BudgetError` if the write would exceed available budget.
     pub fn reserve(&self, class: WriteClass, size_bytes: u64) -> Result<(), BudgetError> {
         let remaining = self.remaining(class);
-        if remaining < size_bytes {
+        if remaining <= /* ~ changed by cargo-mutants ~ */ size_bytes {
             return Err(BudgetError {
                 class,
                 requested: size_bytes,
                 available: remaining,
             });
         }
         match class {
             WriteClass::CriticalControlPlane => {

*** result: Success
