*** crates/vo-storage/src/append.rs:128:46: replace += with *= in WriteBudget::reserve

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace += with *= in WriteBudget::reserve
@@ -120,17 +120,17 @@
         match class {
             WriteClass::CriticalControlPlane => {
                 *self.critical_used.borrow_mut() += size_bytes;
             }
             WriteClass::OperatorProjection => {
                 *self.projection_used.borrow_mut() += size_bytes;
             }
             WriteClass::BulkBlob => {
-                *self.blob_used.borrow_mut() += size_bytes;
+                *self.blob_used.borrow_mut() *= /* ~ changed by cargo-mutants ~ */ size_bytes;
             }
         }
         Ok(())
     }
 }
 
 /// Budget exceeded error.
 #[derive(Debug, Clone, PartialEq, Eq)]

*** result: Success
