*** crates/vo-storage/src/append.rs:213:9: replace QueueStats::capacity -> usize with 1

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace QueueStats::capacity -> usize with 1
@@ -205,17 +205,17 @@
             WriteClass::CriticalControlPlane => self.critical_depth,
             WriteClass::OperatorProjection => self.projection_depth,
             WriteClass::BulkBlob => self.blob_depth,
         }
     }
 
     #[must_use]
     pub const fn capacity(&self, class: WriteClass) -> usize {
-        self.config.capacity_for(class)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn remaining(&self, class: WriteClass) -> usize {
         self.capacity(class).saturating_sub(self.depth(class))
     }
 
     #[must_use]

*** result: Success
