*** crates/vo-storage/src/append.rs:218:9: replace QueueStats::remaining -> usize with 1

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace QueueStats::remaining -> usize with 1
@@ -210,17 +210,17 @@
 
     #[must_use]
     pub const fn capacity(&self, class: WriteClass) -> usize {
         self.config.capacity_for(class)
     }
 
     #[must_use]
     pub const fn remaining(&self, class: WriteClass) -> usize {
-        self.capacity(class).saturating_sub(self.depth(class))
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn is_full(&self, class: WriteClass) -> bool {
         self.depth(class) >= self.capacity(class)
     }
 
     const fn increment(&mut self, class: WriteClass) {

*** result: Success
