*** crates/vo-storage/src/append.rs:223:9: replace QueueStats::is_full -> bool with false

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace QueueStats::is_full -> bool with false
@@ -215,17 +215,17 @@
 
     #[must_use]
     pub const fn remaining(&self, class: WriteClass) -> usize {
         self.capacity(class).saturating_sub(self.depth(class))
     }
 
     #[must_use]
     pub const fn is_full(&self, class: WriteClass) -> bool {
-        self.depth(class) >= self.capacity(class)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     const fn increment(&mut self, class: WriteClass) {
         match class {
             WriteClass::CriticalControlPlane => self.critical_depth += 1,
             WriteClass::OperatorProjection => self.projection_depth += 1,
             WriteClass::BulkBlob => self.blob_depth += 1,
         }

*** result: Success
