*** crates/vo-storage/src/append.rs:227:9: replace QueueStats::increment with ()

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace QueueStats::increment with ()
@@ -219,21 +219,17 @@
     }
 
     #[must_use]
     pub const fn is_full(&self, class: WriteClass) -> bool {
         self.depth(class) >= self.capacity(class)
     }
 
     const fn increment(&mut self, class: WriteClass) {
-        match class {
-            WriteClass::CriticalControlPlane => self.critical_depth += 1,
-            WriteClass::OperatorProjection => self.projection_depth += 1,
-            WriteClass::BulkBlob => self.blob_depth += 1,
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     const fn decrement(&mut self, class: WriteClass) {
         match class {
             WriteClass::CriticalControlPlane => {
                 self.critical_depth = self.critical_depth.saturating_sub(1);
             }
             WriteClass::OperatorProjection => {

*** result: Success
