*** crates/vo-storage/src/append.rs:230:53: replace += with -= in QueueStats::increment

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace += with -= in QueueStats::increment
@@ -222,17 +222,17 @@
     pub const fn is_full(&self, class: WriteClass) -> bool {
         self.depth(class) >= self.capacity(class)
     }
 
     const fn increment(&mut self, class: WriteClass) {
         match class {
             WriteClass::CriticalControlPlane => self.critical_depth += 1,
             WriteClass::OperatorProjection => self.projection_depth += 1,
-            WriteClass::BulkBlob => self.blob_depth += 1,
+            WriteClass::BulkBlob => self.blob_depth -= /* ~ changed by cargo-mutants ~ */ 1,
         }
     }
 
     const fn decrement(&mut self, class: WriteClass) {
         match class {
             WriteClass::CriticalControlPlane => {
                 self.critical_depth = self.critical_depth.saturating_sub(1);
             }

*** result: Success
