*** crates/vo-storage/src/append.rs:309:29: replace >= with < in InnerQueue<T>::push

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace >= with < in InnerQueue<T>::push
@@ -301,17 +301,17 @@
     const fn new(capacity: usize) -> Self {
         Self {
             items: VecDeque::new(),
             capacity,
         }
     }
 
     fn push(&mut self, item: T) -> Option<T> {
-        if self.items.len() >= self.capacity {
+        if self.items.len() < /* ~ changed by cargo-mutants ~ */ self.capacity {
             return Some(item);
         }
         self.items.push_back(item);
         None
     }
 
     fn pop(&mut self) -> Option<T> {
         self.items.pop_front()

*** result: Success
