*** crates/vo-storage/src/append.rs:31:9: replace WriteClass::tier -> u8 with 0

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace WriteClass::tier -> u8 with 0
@@ -23,21 +23,17 @@
     OperatorProjection,
     BulkBlob,
 }
 
 impl WriteClass {
     /// Returns the `QoS` tier number (1=critical, 2=projection, 3=blob).
     #[must_use]
     pub const fn tier(self) -> u8 {
-        match self {
-            Self::CriticalControlPlane => 1,
-            Self::OperatorProjection => 2,
-            Self::BulkBlob => 3,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     #[must_use]
     pub const fn never_drops(self) -> bool {
         matches!(self, Self::CriticalControlPlane)
     }
 }

*** result: Success
