*** crates/vo-storage/src/append.rs:321:9: replace InnerQueue<T>::len -> usize with 1

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace InnerQueue<T>::len -> usize with 1
@@ -313,17 +313,17 @@
         None
     }
 
     fn pop(&mut self) -> Option<T> {
         self.items.pop_front()
     }
 
     fn len(&self) -> usize {
-        self.items.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_full(&self) -> bool {
         self.items.len() >= self.capacity
     }
 
     const fn capacity(&self) -> usize {
         self.capacity

*** result: Success
