*** crates/vo-storage/src/append.rs:325:26: replace >= with < in InnerQueue<T>::is_full

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace >= with < in InnerQueue<T>::is_full
@@ -317,17 +317,17 @@
         self.items.pop_front()
     }
 
     fn len(&self) -> usize {
         self.items.len()
     }
 
     fn is_full(&self) -> bool {
-        self.items.len() >= self.capacity
+        self.items.len() < /* ~ changed by cargo-mutants ~ */ self.capacity
     }
 
     const fn capacity(&self) -> usize {
         self.capacity
     }
 }
 
 /// Bounded write queues per `WriteClass` with integrated budget tracking.

*** result: Success
