*** crates/vo-storage/src/append.rs:384:9: replace BudgetQueues<T>::try_enqueue -> Result<(), BudgetQueuesError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace BudgetQueues<T>::try_enqueue -> Result<(), BudgetQueuesError> with Ok(())
@@ -376,87 +376,17 @@
     /// Attempts to enqueue an item if budget and queue capacity allow.
     ///
     /// # Errors
     /// Returns `BudgetQueuesError` if budget is exceeded or queue is full.
     pub fn try_enqueue(&self, item: &T) -> Result<(), BudgetQueuesError>
     where
         T: ClassifiedWrite + Clone,
     {
-        let class = item.write_class();
-        let size = item.size_bytes();
-
-        // Check budget first
-        if !self.budget.can_write(class, size) {
-            return Err(BudgetQueuesError::BudgetExceeded {
-                class,
-                item_size: size,
-                remaining: self.budget.remaining(class),
-            });
-        }
-
-        // Get the appropriate queue
-        let queue: &Mutex<InnerQueue<T>> = match class {
-            WriteClass::CriticalControlPlane => &self.critical_queue,
-            WriteClass::OperatorProjection => &self.projection_queue,
-            WriteClass::BulkBlob => &self.blob_queue,
-        };
-
-        // Try to push to the queue
-        let overflow = {
-            let mut q = match queue.lock() {
-                Ok(guard) => guard,
-                Err(poisoned) => poisoned.into_inner(),
-            };
-            if q.is_full() {
-                return Err(BudgetQueuesError::QueueFull {
-                    class,
-                    depth: q.len(),
-                    capacity: q.capacity(),
-                });
-            }
-            q.push((*item).clone())
-        };
-
-        // If overflow, return error
-        if overflow.is_some() {
-            return Err(BudgetQueuesError::QueueFull {
-                class,
-                depth: match self.stats.lock() {
-                    Ok(guard) => guard.depth(class),
-                    Err(poisoned) => poisoned.into_inner().depth(class),
-                },
-                capacity: match self.stats.lock() {
-                    Ok(guard) => guard.capacity(class),
-                    Err(poisoned) => poisoned.into_inner().capacity(class),
-                },
-            });
-        }
-
-        // Reserve budget
-        if let Err(e) = self.budget.reserve(class, size) {
-            // Rollback queue push - merge temporary with its single usage
-            match queue.lock() {
-                Ok(mut guard) => guard.pop(),
-                Err(poisoned) => poisoned.into_inner().pop(),
-            };
-            return Err(BudgetQueuesError::BudgetExceeded {
-                class,
-                item_size: size,
-                remaining: e.available,
-            });
-        }
-
-        // Update stats
-        match self.stats.lock() {
-            Ok(mut guard) => guard.increment(class),
-            Err(poisoned) => poisoned.into_inner().increment(class),
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Dequeues an item from the front of the specified queue.
     pub fn dequeue(&self, class: WriteClass) -> Option<T> {
         let queue: &Mutex<InnerQueue<T>> = match class {
             WriteClass::CriticalControlPlane => &self.critical_queue,
             WriteClass::OperatorProjection => &self.projection_queue,
             WriteClass::BulkBlob => &self.blob_queue,

*** result: Success
