*** crates/vo-storage/src/append.rs:41:9: replace WriteClass::never_drops -> bool with false

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace WriteClass::never_drops -> bool with false
@@ -33,17 +33,17 @@
             Self::OperatorProjection => 2,
             Self::BulkBlob => 3,
         }
     }
 
     /// Returns `true` if writes of this class are never dropped under pressure.
     #[must_use]
     pub const fn never_drops(self) -> bool {
-        matches!(self, Self::CriticalControlPlane)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::str::FromStr for WriteClass {
     type Err = String;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s {

*** result: Success
