*** crates/vo-storage/src/append.rs:459:9: replace BudgetQueues<T>::dequeue -> Option<T> with None

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace BudgetQueues<T>::dequeue -> Option<T> with None
@@ -451,36 +451,17 @@
             Err(poisoned) => poisoned.into_inner().increment(class),
         }
 
         Ok(())
     }
 
     /// Dequeues an item from the front of the specified queue.
     pub fn dequeue(&self, class: WriteClass) -> Option<T> {
-        let queue: &Mutex<InnerQueue<T>> = match class {
-            WriteClass::CriticalControlPlane => &self.critical_queue,
-            WriteClass::OperatorProjection => &self.projection_queue,
-            WriteClass::BulkBlob => &self.blob_queue,
-        };
-
-        let item = {
-            let mut q = match queue.lock() {
-                Ok(guard) => guard,
-                Err(poisoned) => poisoned.into_inner(),
-            };
-            q.pop()
-        };
-        if item.is_some() {
-            match self.stats.lock() {
-                Ok(mut guard) => guard.decrement(class),
-                Err(poisoned) => poisoned.into_inner().decrement(class),
-            }
-        }
-        item
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the queue configuration.
     #[must_use]
     pub const fn config(&self) -> &QueueConfig {
         &self.config
     }
 }

*** result: Success
