*** crates/vo-storage/src/append.rs:50:13: delete match arm "critical_control_plane" in <impl std::str::FromStr for WriteClass>::from_str

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ delete match arm "critical_control_plane" in <impl std::str::FromStr for WriteClass>::from_str
@@ -42,17 +42,17 @@
     }
 }
 
 impl std::str::FromStr for WriteClass {
     type Err = String;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s {
-            "critical_control_plane" => Ok(Self::CriticalControlPlane),
+             /* ~ changed by cargo-mutants ~ */
             "operator_projection" => Ok(Self::OperatorProjection),
             "bulk_blob" => Ok(Self::BulkBlob),
             _ => Err(format!("unknown write class: {s}")),
         }
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────

*** result: Success
