*** crates/vo-storage/src/append.rs:510:9: replace <impl ClassifiedWrite for AppendEntry>::size_bytes -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace <impl ClassifiedWrite for AppendEntry>::size_bytes -> u64 with 0
@@ -502,21 +502,17 @@
         match self {
             Self::ControlPlane(w) => w.write_class(),
             Self::Projection(w) => w.write_class(),
             Self::Blob(w) => w.write_class(),
         }
     }
 
     fn size_bytes(&self) -> u64 {
-        match self {
-            Self::ControlPlane(w) => w.size_bytes(),
-            Self::Projection(w) => w.size_bytes(),
-            Self::Blob(w) => w.size_bytes(),
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Write Types
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// A control-plane write.

*** result: Success
