*** crates/vo-storage/src/append.rs:52:13: delete match arm "bulk_blob" in <impl std::str::FromStr for WriteClass>::from_str

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ delete match arm "bulk_blob" in <impl std::str::FromStr for WriteClass>::from_str
@@ -44,17 +44,17 @@
 
 impl std::str::FromStr for WriteClass {
     type Err = String;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s {
             "critical_control_plane" => Ok(Self::CriticalControlPlane),
             "operator_projection" => Ok(Self::OperatorProjection),
-            "bulk_blob" => Ok(Self::BulkBlob),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(format!("unknown write class: {s}")),
         }
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // WriteBudget
 // ─────────────────────────────────────────────────────────────────────────────

*** result: Success
