*** crates/vo-storage/src/append.rs:542:9: replace <impl ClassifiedWrite for ControlPlaneWrite>::size_bytes -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace <impl ClassifiedWrite for ControlPlaneWrite>::size_bytes -> u64 with 0
@@ -534,17 +534,17 @@
 }
 
 impl ClassifiedWrite for ControlPlaneWrite {
     fn write_class(&self) -> WriteClass {
         WriteClass::CriticalControlPlane
     }
 
     fn size_bytes(&self) -> u64 {
-        self.size_bytes
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A projection write.
 #[derive(Debug, Clone)]
 pub struct ProjectionWrite {
     pub projection_id: String,
     size_bytes: u64,

*** result: Success
