*** crates/vo-storage/src/append.rs:559:9: replace <impl ClassifiedWrite for ProjectionWrite>::size_bytes -> u64 with 1

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace <impl ClassifiedWrite for ProjectionWrite>::size_bytes -> u64 with 1
@@ -551,17 +551,17 @@
 }
 
 impl ClassifiedWrite for ProjectionWrite {
     fn write_class(&self) -> WriteClass {
         WriteClass::OperatorProjection
     }
 
     fn size_bytes(&self) -> u64 {
-        self.size_bytes
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A blob write.
 #[derive(Debug, Clone)]
 pub struct BlobWrite {
     pub blob_id: String,
     size_bytes: u64,

*** result: Success
