*** crates/vo-storage/src/append.rs:624:9: replace Appender::append_control_plane -> Result<(), BudgetQueuesError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace Appender::append_control_plane -> Result<(), BudgetQueuesError> with Ok(())
@@ -616,17 +616,17 @@
         self.queues.budget()
     }
 
     /// Appends a control-plane write.
     ///
     /// # Errors
     /// Returns `BudgetQueuesError` if budget is exceeded or queue is full.
     pub fn append_control_plane(&self, write: ControlPlaneWrite) -> Result<(), BudgetQueuesError> {
-        self.queues.try_enqueue(&AppendEntry::ControlPlane(write))
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends a projection write.
     ///
     /// # Errors
     /// Returns `BudgetQueuesError` if budget is exceeded or queue is full.
     pub fn append_projection(&self, write: ProjectionWrite) -> Result<(), BudgetQueuesError> {
         self.queues.try_enqueue(&AppendEntry::Projection(write))

*** result: Success
