*** crates/vo-storage/src/append.rs:655:9: replace Appender::dequeue_blob -> Option<AppendEntry> with None

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace Appender::dequeue_blob -> Option<AppendEntry> with None
@@ -647,17 +647,17 @@
 
     /// Dequeues from the projection queue.
     pub fn dequeue_projection(&self) -> Option<AppendEntry> {
         self.queues.dequeue(WriteClass::OperatorProjection)
     }
 
     /// Dequeues from the blob queue.
     pub fn dequeue_blob(&self) -> Option<AppendEntry> {
-        self.queues.dequeue(WriteClass::BulkBlob)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Unit Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]

*** result: Success
