*** crates/vo-storage/src/append.rs:90:9: replace WriteBudget::remaining -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/append.rs
+++ replace WriteBudget::remaining -> u64 with 0
@@ -82,25 +82,17 @@
             projection_used: RefCell::new(0),
             blob_used: RefCell::new(0),
         }
     }
 
     /// Returns the remaining budget for a given class.
     #[must_use]
     pub fn remaining(&self, class: WriteClass) -> u64 {
-        match class {
-            WriteClass::CriticalControlPlane => self
-                .critical_limit
-                .saturating_sub(*self.critical_used.borrow()),
-            WriteClass::OperatorProjection => self
-                .projection_limit
-                .saturating_sub(*self.projection_used.borrow()),
-            WriteClass::BulkBlob => self.blob_limit.saturating_sub(*self.blob_used.borrow()),
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checks if a write of the given class would exceed available budget.
     #[must_use]
     pub fn can_write(&self, class: WriteClass, size_bytes: u64) -> bool {
         self.remaining(class) >= size_bytes
     }

*** result: Success
