*** crates/vo-storage/src/blob_store.rs:114:9: replace ContentAddress::as_bytes -> [u8; 32] with [1; 32]

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace ContentAddress::as_bytes -> [u8; 32] with [1; 32]
@@ -106,22 +106,17 @@
 
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     #[must_use]
     pub fn as_bytes(&self) -> [u8; 32] {
-        let mut bytes = [0u8; 32];
-        for (i, chunk) in self.0.as_bytes().chunks(2).enumerate() {
-            let hex_str = unsafe { std::str::from_utf8_unchecked(chunk) };
-            bytes[i] = unsafe { u8::from_str_radix(hex_str, 16).unwrap_unchecked() };
-        }
-        bytes
+        [1; 32] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ContentAddress {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "{}", self.0)
     }
 }

---- blob_store::tests::content_address_from_bytes_produces_correct_hex stdout ----

thread 'blob_store::tests::content_address_from_bytes_produces_correct_hex' (3891845) panicked at crates/vo-storage/src/blob_store.rs:796:9:
assertion `left == right` failed
  left: "0101010101010101010101010101010101010101010101010101010101010101"
 right: "9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08"

---- blob_store::tests::content_address_full_roundtrip stdout ----

thread 'blob_store::tests::content_address_full_roundtrip' (3891847) panicked at crates/vo-storage/src/blob_store.rs:811:9:
assertion `left == right` failed
  left: "0101010101010101010101010101010101010101010101010101010101010101"
 right: "9f86d081884c7d659a2feaa0c55ad015a3bf4f1b2b0b822cd15d6c15b0f00a08"

---- blob_store::tests::content_address_from_bytes_roundtrip stdout ----

thread 'blob_store::tests::content_address_from_bytes_roundtrip' (3891846) panicked at crates/vo-storage/src/blob_store.rs:668:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
 right: [159, 134, 208, 129, 136, 132, 199, 214, 89, 162, 254, 170, 12, 85, 173, 1, 90, 59, 244, 241, 178, 176, 184, 34, 205, 21, 214, 193, 91, 15, 0, 160]

failures:
    blob_store::tests::content_address_from_bytes_produces_correct_hex
    blob_store::tests::content_address_from_bytes_roundtrip
    blob_store::tests::content_address_full_roundtrip

test result: FAILED. 46 passed; 3 failed; 0 ignored; 0 measured; 512 filtered out; finished in 0.00s

*** result: Failure(101)
