*** crates/vo-storage/src/blob_store.rs:207:9: replace PackIndexEntry::offset_bytes -> u64 with 1

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace PackIndexEntry::offset_bytes -> u64 with 1
@@ -199,17 +199,17 @@
 
     #[must_use]
     pub const fn pack_file_id(&self) -> &PackFileId {
         &self.pack_file_id
     }
 
     #[must_use]
     pub const fn offset_bytes(&self) -> u64 {
-        self.offset_bytes
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn size_bytes(&self) -> u64 {
         self.size_bytes
     }
 }

---- blob_store::tests::pack_index_entry_accessors stdout ----

thread 'blob_store::tests::pack_index_entry_accessors' (3912684) panicked at crates/vo-storage/src/blob_store.rs:726:9:
assertion `left == right` failed
  left: 1
 right: 100

failures:
    blob_store::tests::pack_index_entry_accessors

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 512 filtered out; finished in 0.00s

*** result: Failure(101)
