*** crates/vo-storage/src/blob_store.rs:212:9: replace PackIndexEntry::size_bytes -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace PackIndexEntry::size_bytes -> u64 with 0
@@ -204,17 +204,17 @@
 
     #[must_use]
     pub const fn offset_bytes(&self) -> u64 {
         self.offset_bytes
     }
 
     #[must_use]
     pub const fn size_bytes(&self) -> u64 {
-        self.size_bytes
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Data Layer — BlobRecord
 // ---------------------------------------------------------------------------
 
 /// Persisted blob metadata record.

---- blob_store::tests::pack_index_entry_accessors stdout ----

thread 'blob_store::tests::pack_index_entry_accessors' (3916100) panicked at crates/vo-storage/src/blob_store.rs:727:9:
assertion `left == right` failed
  left: 0
 right: 512

failures:
    blob_store::tests::pack_index_entry_accessors

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 512 filtered out; finished in 0.00s

*** result: Failure(101)
