*** crates/vo-storage/src/blob_store.rs:270:9: replace BlobRecord::size_bytes -> u64 with 1

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace BlobRecord::size_bytes -> u64 with 1
@@ -262,17 +262,17 @@
 
     #[must_use]
     pub const fn content_addr(&self) -> &ContentAddress {
         &self.content_addr
     }
 
     #[must_use]
     pub const fn size_bytes(&self) -> u64 {
-        self.size_bytes
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn reference_count(&self) -> u64 {
         self.reference_count
     }
 
     #[must_use]

---- blob_store::tests::blob_record_constructs_with_valid_fields stdout ----

thread 'blob_store::tests::blob_record_constructs_with_valid_fields' (3928725) panicked at crates/vo-storage/src/blob_store.rs:682:9:
assertion `left == right` failed
  left: 1
 right: 1024

failures:
    blob_store::tests::blob_record_constructs_with_valid_fields

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 512 filtered out; finished in 0.00s

*** result: Failure(101)
