*** crates/vo-storage/src/blob_store.rs:275:9: replace BlobRecord::reference_count -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace BlobRecord::reference_count -> u64 with 0
@@ -267,17 +267,17 @@
 
     #[must_use]
     pub const fn size_bytes(&self) -> u64 {
         self.size_bytes
     }
 
     #[must_use]
     pub const fn reference_count(&self) -> u64 {
-        self.reference_count
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn created_at_ms(&self) -> u64 {
         self.created_at_ms
     }
 
     #[must_use]

---- blob_store::tests::blob_record_constructs_with_valid_fields stdout ----

thread 'blob_store::tests::blob_record_constructs_with_valid_fields' (3932474) panicked at crates/vo-storage/src/blob_store.rs:683:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    blob_store::tests::blob_record_constructs_with_valid_fields

test result: FAILED. 48 passed; 1 failed; 0 ignored; 0 measured; 512 filtered out; finished in 0.00s

*** result: Failure(101)
