*** crates/vo-storage/src/blob_store.rs:275:9: replace BlobRecord::reference_count -> u64 with 1

*** mutation diff:
--- crates/vo-storage/src/blob_store.rs
+++ replace BlobRecord::reference_count -> u64 with 1
@@ -267,17 +267,17 @@
 
     #[must_use]
     pub const fn size_bytes(&self) -> u64 {
         self.size_bytes
     }
 
     #[must_use]
     pub const fn reference_count(&self) -> u64 {
-        self.reference_count
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn created_at_ms(&self) -> u64 {
         self.created_at_ms
     }
 
     #[must_use]

*** result: Success
