*** crates/vo-storage/src/codec.rs:13:9: replace <impl fmt::Display for StorageError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/codec.rs
+++ replace <impl fmt::Display for StorageError>::fmt -> fmt::Result with Ok(Default::default())
@@ -5,20 +5,17 @@
 #[derive(Debug, PartialEq, Eq)]
 pub enum StorageError {
     CorruptKey,
     Other,
 }
 
 impl fmt::Display for StorageError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::CorruptKey => write!(f, "corrupt key"),
-            Self::Other => write!(f, "other error"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for StorageError {}
 
 /// Encodes an `(InstanceId, SequenceNumber)` pair into a 24-byte event key.
 ///
 /// # Errors

*** result: Success
