*** crates/vo-storage/src/codec.rs:57:5: replace encode_event_key -> Result<[u8; 24], StorageError> with Ok([0; 24])

*** mutation diff:
--- crates/vo-storage/src/codec.rs
+++ replace encode_event_key -> Result<[u8; 24], StorageError> with Ok([0; 24])
@@ -49,24 +49,17 @@
 ///
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if the `InstanceId` cannot be converted to bytes.
 pub fn encode_event_key(
     instance_id: &InstanceId,
     sequence: &SequenceNumber,
 ) -> Result<[u8; 24], StorageError> {
-    let id_bytes = instance_id
-        .to_bytes()
-        .map_err(|_| StorageError::CorruptKey)?;
-    let seq_bytes = sequence.as_u64().to_be_bytes();
-    let mut key = [0u8; 24];
-    key[..16].copy_from_slice(&id_bytes);
-    key[16..].copy_from_slice(&seq_bytes);
-    Ok(key)
+    Ok([0; 24]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a 24-byte event key into an `InstanceId` and `SequenceNumber`.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::CorruptKey` if `bytes` is not exactly 24 bytes long,
 /// or if the sequence number is 0.

---- codec::tests::encode_event_key_returns_concrete_big_endian_bytes_to_preserve_ordering stdout ----

thread 'codec::tests::encode_event_key_returns_concrete_big_endian_bytes_to_preserve_ordering' (2426411) panicked at crates/vo-storage/src/codec.rs:128:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 1, 2, 3, 4, 5, 6, 7, 8]

---- codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_minimums stdout ----

thread 'codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_minimums' (2426413) panicked at crates/vo-storage/src/codec.rs:107:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1]

---- codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_maximums stdout ----

thread 'codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_maximums' (2426412) panicked at crates/vo-storage/src/codec.rs:116:9:
assertion `left == right` failed
  left: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
 right: [255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]

failures:
    codec::tests::encode_event_key_returns_concrete_big_endian_bytes_to_preserve_ordering
    codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_maximums
    codec::tests::encode_event_key_returns_exact_bytes_when_inputs_are_minimums
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
