*** crates/vo-storage/src/dedupe_partition/mod.rs:107:9: replace <impl fmt::Display for DedupeStoreError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace <impl fmt::Display for DedupeStoreError>::fmt -> fmt::Result with Ok(Default::default())
@@ -99,21 +99,17 @@
     /// Codec/serialization error.
     Codec { reason: String },
     /// Invalid argument.
     InvalidArgument,
 }
 
 impl fmt::Display for DedupeStoreError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Storage { reason } => write!(f, "dedupe storage error: {reason}"),
-            Self::Codec { reason } => write!(f, "dedupe codec error: {reason}"),
-            Self::InvalidArgument => write!(f, "invalid dedupe argument"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for DedupeStoreError {}
 
 // ---------------------------------------------------------------------------
 // Calc layer — key encoding/decoding
 // ---------------------------------------------------------------------------

---- dedupe_partition::tests::error_invalid_argument_displays_message stdout ----

thread 'dedupe_partition::tests::error_invalid_argument_displays_message' (2452392) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:109:5:
assertion `left == right` failed
  left: ""
 right: "invalid dedupe argument"

---- dedupe_partition::tests::error_codec_displays_reason stdout ----

thread 'dedupe_partition::tests::error_codec_displays_reason' (2452391) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:103:5:
assertion `left == right` failed
  left: ""
 right: "dedupe codec error: bad json"

---- dedupe_partition::tests::error_storage_displays_reason stdout ----

thread 'dedupe_partition::tests::error_storage_displays_reason' (2452393) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:95:5:
assertion `left == right` failed
  left: ""
 right: "dedupe storage error: disk full"

failures:
    dedupe_partition::tests::error_codec_displays_reason
    dedupe_partition::tests::error_invalid_argument_displays_message
    dedupe_partition::tests::error_storage_displays_reason

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
