*** crates/vo-storage/src/dedupe_partition/mod.rs:124:5: replace encode_dedupe_key -> Vec<u8> with vec![]

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace encode_dedupe_key -> Vec<u8> with vec![]
@@ -116,17 +116,17 @@
 
 // ---------------------------------------------------------------------------
 // Calc layer — key encoding/decoding
 // ---------------------------------------------------------------------------
 
 /// Encode a `DedupeKey` as UTF-8 bytes for use as a partition key.
 #[must_use]
 pub fn encode_dedupe_key(key: &DedupeKey) -> Vec<u8> {
-    key.as_str().as_bytes().to_vec()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode UTF-8 bytes into a `DedupeKey`.
 ///
 /// # Errors
 ///
 /// Returns `DedupeStoreError::Codec` if bytes are not valid UTF-8 or empty.
 pub fn decode_dedupe_key(bytes: &[u8]) -> Result<DedupeKey, DedupeStoreError> {

---- dedupe_partition::tests::decode_dedupe_key_recovers_key stdout ----

thread 'dedupe_partition::tests::decode_dedupe_key_recovers_key' (2456960) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:154:47:
called `Result::unwrap()` on an `Err` value: Codec { reason: "DedupeKey: value must not be empty" }

---- dedupe_partition::tests::encode_dedupe_key_preserves_unicode_bytes stdout ----

thread 'dedupe_partition::tests::encode_dedupe_key_preserves_unicode_bytes' (2456974) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:220:5:
assertion `left == right` failed
  left: []
 right: [100, 101, 100, 117, 112, 101, 45, 207, 128]

---- dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes stdout ----

thread 'dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes' (2456975) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:147:5:
assertion `left == right` failed
  left: []
 right: [116, 101, 115, 116, 45, 107, 101, 121]

failures:
    dedupe_partition::tests::decode_dedupe_key_recovers_key
    dedupe_partition::tests::encode_dedupe_key_preserves_unicode_bytes
    dedupe_partition::tests::encode_dedupe_key_produces_utf8_bytes
    dedupe_partition::tests::kani_verify_encode_decode_dedupe_key_roundtrip

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
