*** crates/vo-storage/src/dedupe_partition/mod.rs:151:5: replace encode_dedupe_entry -> Result<Vec<u8>, DedupeStoreError> with Ok(vec![1])

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace encode_dedupe_entry -> Result<Vec<u8>, DedupeStoreError> with Ok(vec![1])
@@ -143,19 +143,17 @@
 // ---------------------------------------------------------------------------
 
 /// Encode a `DedupeEntry` to JSON bytes for storage.
 ///
 /// # Errors
 ///
 /// Returns `DedupeStoreError::Codec` if serialization fails.
 pub fn encode_dedupe_entry(entry: &DedupeEntry) -> Result<Vec<u8>, DedupeStoreError> {
-    serde_json::to_vec(entry).map_err(|e| DedupeStoreError::Codec {
-        reason: e.to_string(),
-    })
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode JSON bytes into a `DedupeEntry`.
 ///
 /// # Errors
 ///
 /// Returns `DedupeStoreError::Codec` if deserialization fails.
 pub fn decode_dedupe_entry(bytes: &[u8]) -> Result<DedupeEntry, DedupeStoreError> {

---- dedupe_partition::tests::encode_decode_dedupe_entry_roundtrip stdout ----

thread 'dedupe_partition::tests::encode_decode_dedupe_entry_roundtrip' (2467747) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:201:49:
called `Result::unwrap()` on an `Err` value: Codec { reason: "expected value at line 1 column 1" }

failures:
    dedupe_partition::tests::encode_decode_dedupe_entry_roundtrip

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
