*** crates/vo-storage/src/dedupe_partition/mod.rs:79:9: replace DedupeEntry::expires_at -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace DedupeEntry::expires_at -> u64 with 0
@@ -71,17 +71,17 @@
 
     #[must_use]
     pub fn instance_id(&self) -> &str {
         &self.instance_id
     }
 
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
-        self.expires_at
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Check if this entry has expired given the current timestamp.
     #[must_use]
     pub const fn is_expired(&self, now_ms: u64) -> bool {
         now_ms >= self.expires_at
     }
 }

---- dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields stdout ----

thread 'dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields' (2442053) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:19:5:
assertion `left == right` failed
  left: 0
 right: 1000

failures:
    dedupe_partition::tests::dedupe_entry_constructs_with_valid_fields

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
