*** crates/vo-storage/src/dedupe_partition/mod.rs:85:16: replace >= with < in DedupeEntry::is_expired

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/mod.rs
+++ replace >= with < in DedupeEntry::is_expired
@@ -77,17 +77,17 @@
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
         self.expires_at
     }
 
     /// Check if this entry has expired given the current timestamp.
     #[must_use]
     pub const fn is_expired(&self, now_ms: u64) -> bool {
-        now_ms >= self.expires_at
+        now_ms < /* ~ changed by cargo-mutants ~ */ self.expires_at
     }
 }
 
 // ---------------------------------------------------------------------------
 // Data layer — error enum
 // ---------------------------------------------------------------------------
 
 /// Errors from the dedupe store operations.

---- dedupe_partition::tests::check_and_insert_returns_admitted_when_existing_entry_is_expired stdout ----

thread 'dedupe_partition::tests::check_and_insert_returns_admitted_when_existing_entry_is_expired' (2451888) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:400:5:
assertion `left == right` failed
  left: Ok(Duplicate { instance_id: "stale-instance" })
 right: Ok(Admitted)

---- dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key stdout ----

thread 'dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key' (2451889) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:358:5:
assertion `left == right` failed
  left: Ok(Admitted)
 right: Ok(Duplicate { instance_id: "02081040G2081040G2081040G2" })

---- dedupe_partition::tests::check_and_insert_replaces_expired_entry_with_new_instance_id stdout ----

thread 'dedupe_partition::tests::check_and_insert_replaces_expired_entry_with_new_instance_id' (2451886) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:423:5:
assertion `left == right` failed
  left: Ok(Duplicate { instance_id: "stale-instance" })
 right: Ok(Admitted)

failures:
    dedupe_partition::tests::check_and_insert_replaces_expired_entry_with_new_instance_id
    dedupe_partition::tests::check_and_insert_returns_admitted_when_existing_entry_is_expired
    dedupe_partition::tests::check_and_insert_returns_duplicate_for_existing_key
    dedupe_partition::tests::contains_returns_false_for_expired_key_in_real_store
    dedupe_partition::tests::contains_returns_true_for_existing_unexpired_key_in_real_store
    dedupe_partition::tests::dedupe_entry_is_expired_at_u64_max_boundary
    dedupe_partition::tests::dedupe_entry_is_expired_returns_false_before_expiry
    dedupe_partition::tests::dedupe_entry_is_expired_returns_true_when_past_expiry
    dedupe_partition::tests::dedupe_entry_is_not_expired_before_u64_max_boundary
    dedupe_partition::tests::purge_expired_removes_expired_entries
    dedupe_partition::tests::purge_expired_returns_zero_when_entri

test result: FAILED. 307 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
