*** crates/vo-storage/src/dedupe_partition/verification.rs:16:18: delete ! in verify_encode_decode_dedupe_key_roundtrip_returns_original_key

*** mutation diff:
--- crates/vo-storage/src/dedupe_partition/verification.rs
+++ delete ! in verify_encode_decode_dedupe_key_roundtrip_returns_original_key
@@ -8,17 +8,17 @@
 }
 
 /// K-02: Verify encode/decode dedupe key round-trip for valid UTF-8.
 #[kani::proof]
 fn verify_encode_decode_dedupe_key_roundtrip_returns_original_key() {
     // Symbolic string variable for verification
     let s: &str = kani::any();
     // Guard: reject empty strings (K-02 assumes s is non-empty)
-    kani::assume(!s.is_empty());
+    kani::assume( /* ~ changed by cargo-mutants ~ */s.is_empty());
     // Guard: enforce max length of 256 characters (K-02 assumes s.len() <= 256)
     kani::assume(s.len() <= 256);
 
     let parsed = DedupeKey::parse(s);
 
     let dedupe_key = match parsed {
         Ok(dedupe_key) => dedupe_key,
         Err(error) => {

---- dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume stdout ----

thread 'dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume' (2759358) panicked at crates/vo-storage/src/dedupe_partition/tests.rs:552:5:
assertion failed: source.contains("kani::assume(!s.is_empty())")

failures:
    dedupe_partition::tests::verification_source_asserts_roundtrip_proof_rejects_empty_strings_with_negated_assume

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
