*** crates/vo-storage/src/effect_journal/mod.rs:285:9: replace <impl EffectJournal for InMemoryEffectJournal>::commit -> Result<(), EffectJournalError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace <impl EffectJournal for InMemoryEffectJournal>::commit -> Result<(), EffectJournalError> with Ok(())
@@ -277,57 +277,17 @@
             return Ok(effect_id);
         }
 
         records.insert(key, record);
         Ok(effect_id)
     }
 
     fn commit(&self, effect_id: &EffectId) -> Result<(), EffectJournalError> {
-        let key = effect_id.as_str().to_string();
-        let mut records = self
-            .records
-            .lock()
-            .map_err(|e| EffectJournalError::Storage {
-                reason: e.to_string(),
-            })?;
-
-        let record = records
-            .get_mut(&key)
-            .ok_or_else(|| EffectJournalError::NotFound {
-                effect_id: key.clone(),
-            })?;
-
-        match record.status() {
-            EffectIntent::Committed | EffectIntent::RolledBack => {
-                Err(EffectJournalError::AlreadyTerminal {
-                    effect_id: key,
-                    current_status: format!("{:?}", record.status()),
-                })
-            }
-            EffectIntent::Prepared => {
-                let ts = vo_types::TimestampMs::parse("100").map_err(|e| {
-                    EffectJournalError::Storage {
-                        reason: format!("failed to parse timestamp: {e}"),
-                    }
-                })?;
-                let committed = EffectRecord::new(
-                    record.intent_id().to_string(),
-                    record.kind(),
-                    record.params_json().clone(),
-                    EffectIntent::Committed,
-                    Some(ts),
-                )
-                .ok_or_else(|| EffectJournalError::Storage {
-                    reason: "failed to create committed record".to_string(),
-                })?;
-                *record = committed;
-                Ok(())
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn rollback(&self, effect_id: &EffectId) -> Result<(), EffectJournalError> {
         let key = effect_id.as_str().to_string();
         let mut records = self
             .records
             .lock()
             .map_err(|e| EffectJournalError::Storage {

---- effect_journal::tests::commit_returns_not_found_for_unknown_effect stdout ----

thread 'effect_journal::tests::commit_returns_not_found_for_unknown_effect' (2501875) panicked at crates/vo-storage/src/effect_journal/tests.rs:560:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(NotFound { effect_id: "01040G2081040G2081040G2081::nonexistent" })

---- effect_journal::tests::commit_returns_already_terminal_for_committed_effect stdout ----

thread 'effect_journal::tests::commit_returns_already_terminal_for_committed_effect' (2501874) panicked at crates/vo-storage/src/effect_journal/tests.rs:479:5:
assertion `left == right` failed
  left: Ok(())
 right: Err(AlreadyTerminal { effect_id: "01040G2081040G2081040G2081::fx-double", current_status: "Committed" })

---- effect_journal::tests::commit_transitions_prepared_to_committed stdout ----

thread 'effect_journal::tests::commit_transitions_prepared_to_committed' (2501876) panicked at crates/vo-storage/src/effect_journal/tests.rs:441:5:
assertion failed: pending.is_empty()

failures:
    effect_journal::tests::commit_returns_already_terminal_for_committed_effect
    effect_journal::tests::commit_returns_not_found_for_unknown_effect
    effect_journal::tests::commit_transitions_prepared_to_committed
    effect_journal::tests::list_pending_returns_only_prepared_effects

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
