*** crates/vo-storage/src/effect_journal/mod.rs:371:9: replace <impl EffectJournal for InMemoryEffectJournal>::list_pending -> Result<Vec<EffectRecord>, EffectJournalError> with Ok(vec![])

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace <impl EffectJournal for InMemoryEffectJournal>::list_pending -> Result<Vec<EffectRecord>, EffectJournalError> with Ok(vec![])
@@ -363,23 +363,11 @@
             }
         }
     }
 
     fn list_pending(
         &self,
         instance_id: &InstanceId,
     ) -> Result<Vec<EffectRecord>, EffectJournalError> {
-        let records = self
-            .records
-            .lock()
-            .map_err(|e| EffectJournalError::Storage {
-                reason: e.to_string(),
-            })?;
-
-        let prefix = format!("{instance_id}::");
-        Ok(records
-            .iter()
-            .filter(|(k, v)| k.starts_with(&prefix) && v.status() == EffectIntent::Prepared)
-            .map(|(_, v)| v.clone())
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- effect_journal::tests::list_pending_returns_only_prepared_effects stdout ----

thread 'effect_journal::tests::list_pending_returns_only_prepared_effects' (2503228) panicked at crates/vo-storage/src/effect_journal/tests.rs:552:5:
assertion `left == right` failed
  left: 0
 right: 1

---- effect_journal::tests::prepare_is_idempotent_for_same_intent_id stdout ----

thread 'effect_journal::tests::prepare_is_idempotent_for_same_intent_id' (2503230) panicked at crates/vo-storage/src/effect_journal/tests.rs:374:5:
assertion `left == right` failed: idempotent prepare must not duplicate records
  left: 0
 right: 1

failures:
    effect_journal::tests::list_pending_returns_only_prepared_effects
    effect_journal::tests::prepare_is_idempotent_for_same_intent_id

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
