*** crates/vo-storage/src/effect_journal/mod.rs:381:53: replace && with || in <impl EffectJournal for InMemoryEffectJournal>::list_pending

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace && with || in <impl EffectJournal for InMemoryEffectJournal>::list_pending
@@ -373,13 +373,13 @@
             .lock()
             .map_err(|e| EffectJournalError::Storage {
                 reason: e.to_string(),
             })?;
 
         let prefix = format!("{instance_id}::");
         Ok(records
             .iter()
-            .filter(|(k, v)| k.starts_with(&prefix) && v.status() == EffectIntent::Prepared)
+            .filter(|(k, v)| k.starts_with(&prefix) || /* ~ changed by cargo-mutants ~ */ v.status() == EffectIntent::Prepared)
             .map(|(_, v)| v.clone())
             .collect())
     }
 }

---- effect_journal::tests::commit_transitions_prepared_to_committed stdout ----

thread 'effect_journal::tests::commit_transitions_prepared_to_committed' (2509803) panicked at crates/vo-storage/src/effect_journal/tests.rs:441:5:
assertion failed: pending.is_empty()

---- effect_journal::tests::list_pending_returns_only_prepared_effects stdout ----

thread 'effect_journal::tests::list_pending_returns_only_prepared_effects' (2509845) panicked at crates/vo-storage/src/effect_journal/tests.rs:552:5:
assertion `left == right` failed
  left: 3
 right: 1

---- effect_journal::tests::rollback_transitions_prepared_to_rolledback stdout ----

thread 'effect_journal::tests::rollback_transitions_prepared_to_rolledback' (2509857) panicked at crates/vo-storage/src/effect_journal/tests.rs:461:5:
assertion failed: pending.is_empty()

failures:
    effect_journal::tests::commit_transitions_prepared_to_committed
    effect_journal::tests::list_pending_returns_only_prepared_effects
    effect_journal::tests::rollback_transitions_prepared_to_rolledback

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
