*** crates/vo-storage/src/effect_journal/mod.rs:70:9: replace <impl From<EffectId> for String>::from -> String with "xyzzy".into()

*** mutation diff:
--- crates/vo-storage/src/effect_journal/mod.rs
+++ replace <impl From<EffectId> for String>::from -> String with "xyzzy".into()
@@ -62,17 +62,17 @@
         }
         Ok(Self(value))
     }
 }
 
 impl From<EffectId> for String {
     #[allow(clippy::use_self)]
     fn from(value: EffectId) -> String {
-        value.0
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Data layer — error enum
 // ---------------------------------------------------------------------------
 
 /// Errors from the effect journal operations.

---- effect_journal::tests::effectid_serde_roundtrip stdout ----

thread 'effect_journal::tests::effectid_serde_roundtrip' (2477809) panicked at crates/vo-storage/src/effect_journal/tests.rs:65:5:
assertion `left == right` failed
  left: EffectId("xyzzy")
 right: EffectId("01040G2081040G2081040G2081::fx-456")

failures:
    effect_journal::tests::effectid_serde_roundtrip

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
