*** crates/vo-storage/src/instance_index/mod.rs:109:5: replace instance_index_upsert -> Result<(), StorageError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace instance_index_upsert -> Result<(), StorageError> with Ok(())
@@ -101,31 +101,17 @@
 /// - `StorageError::CorruptKey` if key encoding fails.
 pub fn instance_index_upsert(
     keyspace: &fjall::Keyspace,
     instance_id: &InstanceId,
     status: InstanceStatus,
     created_at: TimestampMs,
     previous_status: Option<InstanceStatus>,
 ) -> Result<(), StorageError> {
-    let partition = keyspace
-        .open_partition("instances", fjall::PartitionCreateOptions::default())
-        .map_err(|_| StorageError::Storage)?;
-
-    let new_key = encode_instance_index_key(status, created_at, instance_id)?;
-
-    match previous_status {
-        Some(old_status) if old_status != status => {
-            let old_key = encode_instance_index_key(old_status, created_at, instance_id)?;
-            atomic_status_transition(keyspace, &partition, &old_key, &new_key)
-        }
-        _ => partition
-            .insert(new_key, &[] as &[u8])
-            .map_err(|_| StorageError::Storage),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Atomically delete the old status key and insert the new one via `fjall::Batch`.
 fn atomic_status_transition(
     keyspace: &fjall::Keyspace,
     partition: &fjall::PartitionHandle,
     old_key: &[u8; 25],
     new_key: &[u8; 25],

---- purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events stdout ----

thread 'purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events' (2518412) panicked at crates/vo-storage/src/purge.rs:143:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(0)

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2518409) panicked at crates/vo-storage/src/purge.rs:182:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(2)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
