*** crates/vo-storage/src/instance_index/mod.rs:133:5: replace atomic_status_transition -> Result<(), StorageError> with Ok(())

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace atomic_status_transition -> Result<(), StorageError> with Ok(())
@@ -125,20 +125,17 @@
 
 /// Atomically delete the old status key and insert the new one via `fjall::Batch`.
 fn atomic_status_transition(
     keyspace: &fjall::Keyspace,
     partition: &fjall::PartitionHandle,
     old_key: &[u8; 25],
     new_key: &[u8; 25],
 ) -> Result<(), StorageError> {
-    let mut batch = keyspace.batch();
-    batch.remove(partition, *old_key);
-    batch.insert(partition, *new_key, &[] as &[u8]);
-    batch.commit().map_err(|_| StorageError::Storage)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Prefix-scan by status. Returns an iterator over all instances with the given status,
 /// ordered by `created_at` ascending (oldest first).
 ///
 /// # Errors (per item)
 ///
 /// - `StorageError::CorruptKey` if a stored key cannot be decoded.

---- upsert_atomically_transitions_status_when_previous_differs_from_new stdout ----

thread 'upsert_atomically_transitions_status_when_previous_differs_from_new' (2529411) panicked at crates/vo-storage/tests/instance_index_integration.rs:106:5:
assertion `left == right` failed
  left: 1
 right: 0

---- scan_all_instances_returns_correct_total_after_mixed_operations stdout ----

thread 'scan_all_instances_returns_correct_total_after_mixed_operations' (2529400) panicked at crates/vo-storage/tests/instance_index_integration.rs:779:5:
assertion `left == right` failed
  left: Pending
 right: Running

---- upsert_does_not_batch_delete_when_status_is_unchanged stdout ----

thread 'upsert_does_not_batch_delete_when_status_is_unchanged' (2529412) panicked at crates/vo-storage/tests/instance_index_integration.rs:993:5:
assertion `left == right` failed: Pending key should be deleted after Pending→Completed transition
  left: 1
 right: 0

failures:
    scan_all_instances_returns_correct_total_after_mixed_operations
    upsert_atomically_transitions_status_when_previous_differs_from_new
    upsert_does_not_batch_delete_when_status_is_unchanged
    upsert_removes_instance_from_old_status_scan_when_status_transitions
    upsert_status_transition_is_atomic_via_scan_state
    upsert_transitions_through_all_six_statuses_for_single_instance
    upsert_with_wrong_previous_status_leaves_orphaned_key

test result: FAILED. 14 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.76s

*** result: Failure(101)
