*** crates/vo-storage/src/instance_index/mod.rs:155:5: replace scan_by_status -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> with ::std::iter::empty()

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace scan_by_status -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> with ::std::iter::empty()
@@ -147,33 +147,17 @@
 /// # Errors (construction)
 ///
 /// If the partition cannot be opened, the first `.next()` call returns
 /// `Some(Err(StorageError::Storage))`.
 pub fn scan_by_status(
     keyspace: &fjall::Keyspace,
     status: InstanceStatus,
 ) -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> {
-    let partition_result =
-        keyspace.open_partition("instances", fjall::PartitionCreateOptions::default());
-
-    let Ok(partition) = partition_result else {
-        return ScanIterator {
-            inner: None,
-            init_error: Some(StorageError::Storage),
-        };
-    };
-
-    let prefix = [status.to_byte()];
-    let iter = partition.prefix(prefix);
-
-    ScanIterator {
-        inner: Some(Box::new(iter)),
-        init_error: None,
-    }
+    ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Full range scan over all instances across all statuses.
 /// Returns entries ordered by `(status_byte, created_at)` ascending.
 ///
 /// # Errors (per item)
 ///
 /// - `StorageError::CorruptKey` if a stored key cannot be decoded.

---- scan_by_status_yields_corrupt_key_error_when_partition_has_invalid_length_key stdout ----

thread 'scan_by_status_yields_corrupt_key_error_when_partition_has_invalid_length_key' (2534341) panicked at crates/vo-storage/tests/instance_index_fault_injection.rs:71:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    scan_by_status_yields_corrupt_key_error_when_partition_has_invalid_length_key

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
