*** crates/vo-storage/src/instance_index/mod.rs:189:5: replace scan_all_instances -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> with ::std::iter::empty()

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace scan_all_instances -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> with ::std::iter::empty()
@@ -181,32 +181,17 @@
 ///
 /// # Errors (construction)
 ///
 /// If the partition cannot be opened, the first `.next()` call returns
 /// `Some(Err(StorageError::Storage))`.
 pub fn scan_all_instances(
     keyspace: &fjall::Keyspace,
 ) -> impl Iterator<Item = Result<InstanceIndexEntry, StorageError>> {
-    let partition_result =
-        keyspace.open_partition("instances", fjall::PartitionCreateOptions::default());
-
-    let Ok(partition) = partition_result else {
-        return ScanIterator {
-            inner: None,
-            init_error: Some(StorageError::Storage),
-        };
-    };
-
-    let iter = partition.prefix([]);
-
-    ScanIterator {
-        inner: Some(Box::new(iter)),
-        init_error: None,
-    }
+    ::std::iter::empty() /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Internal iterator adapter
 // ---------------------------------------------------------------------------
 
 pub(crate) struct ScanIterator {
     pub(crate) inner: Option<Box<dyn DoubleEndedIterator<Item = fjall::Result<fjall::KvPair>>>>,

---- purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events stdout ----

thread 'purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events' (2535045) panicked at crates/vo-storage/src/purge.rs:143:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(0)

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2535042) panicked at crates/vo-storage/src/purge.rs:182:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(2)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
