*** crates/vo-storage/src/instance_index/mod.rs:48:5: replace encode_instance_index_key -> Result<[u8; 25], StorageError> with Ok([1; 25])

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace encode_instance_index_key -> Result<[u8; 25], StorageError> with Ok([1; 25])
@@ -40,24 +40,17 @@
 ///
 /// Returns `StorageError::CorruptKey` if `instance_id.to_bytes()` fails
 /// (should never happen for a properly constructed `InstanceId`).
 pub fn encode_instance_index_key(
     status: InstanceStatus,
     created_at: TimestampMs,
     instance_id: &InstanceId,
 ) -> Result<[u8; 25], StorageError> {
-    let id_bytes = instance_id
-        .to_bytes()
-        .map_err(|_| StorageError::CorruptKey)?;
-    let mut key = [0u8; 25];
-    key[0] = status.to_byte();
-    key[1..9].copy_from_slice(&created_at.as_u64().to_be_bytes());
-    key[9..25].copy_from_slice(&id_bytes);
-    Ok(key)
+    Ok([1; 25]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode a 25-byte composite key into its components.
 ///
 /// # Errors
 ///
 /// - `StorageError::CorruptKey` if `bytes.len() != 25`
 /// - `StorageError::CorruptKey` if the status byte is not in `[0x01..=0x06]`

---- instance_index::tests_encoding::encode_instance_index_key_places_status_byte_at_position_zero stdout ----

thread 'instance_index::tests_encoding::encode_instance_index_key_places_status_byte_at_position_zero' (2517029) panicked at crates/vo-storage/src/instance_index/tests_encoding.rs:36:5:
assertion `left == right` failed
  left: 1
 right: 2

---- instance_index::tests_encoding::encode_instance_index_key_places_0x06_at_position_zero_when_cancelled stdout ----

thread 'instance_index::tests_encoding::encode_instance_index_key_places_0x06_at_position_zero_when_cancelled' (2517028) panicked at crates/vo-storage/src/instance_index/tests_encoding.rs:145:5:
assertion `left == right` failed
  left: 1
 right: 6

---- instance_index::tests_encoding::encode_instance_index_key_places_0x04_at_position_zero_when_completed stdout ----

thread 'instance_index::tests_encoding::encode_instance_index_key_places_0x04_at_position_zero_when_completed' (2517027) panicked at crates/vo-storage/src/instance_index/tests_encoding.rs:137:5:
assertion `left == right` failed
  left: 1
 right: 4

failures:
    instance_index::proptests::proptest_encode_decode_round_trip
    instance_index::proptests::proptest_key_ordering_preserves_chronological_order
    instance_index::tests_encoding::decode_instance_index_key_returns_correct_entry_when_key_is_valid_25_bytes
    instance_index::tests_encoding::encode_instance_index_key_encodes_created_at_as_big_endian_u64_at_offset_1
    instance_index::tests_encoding::encode_instance_index_key_handles_nil_instance_id_boundary
    instance_index::tests_encoding::encode_instance_index_key_places_0x03_at_position_zero_when_paused
    instance_index::tests_encoding::encode_instance_index_key_places_0x04_at_position_zero_when_completed
    instance_index::tests_encoding::encode_instance_index_key_places_0x06_at_position_zero_when_cancelled
    instance_index::tests_encoding::encode_instance_index_key_places_status_byte_at_position_zero
    instance

test result: FAILED. 303 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
