*** crates/vo-storage/src/instance_index/mod.rs:65:20: replace != with == in decode_instance_index_key

*** mutation diff:
--- crates/vo-storage/src/instance_index/mod.rs
+++ replace != with == in decode_instance_index_key
@@ -57,17 +57,17 @@
 
 /// Decode a 25-byte composite key into its components.
 ///
 /// # Errors
 ///
 /// - `StorageError::CorruptKey` if `bytes.len() != 25`
 /// - `StorageError::CorruptKey` if the status byte is not in `[0x01..=0x06]`
 pub fn decode_instance_index_key(bytes: &[u8]) -> Result<InstanceIndexEntry, StorageError> {
-    if bytes.len() != 25 {
+    if bytes.len() == /* ~ changed by cargo-mutants ~ */ 25 {
         return Err(StorageError::CorruptKey);
     }
     let status = InstanceStatus::from_byte(bytes[0]).ok_or(StorageError::CorruptKey)?;
     let ts_bytes: [u8; 8] = bytes[1..9]
         .try_into()
         .map_err(|_| StorageError::CorruptKey)?;
     let created_at = TimestampMs::try_from(u64::from_be_bytes(ts_bytes))
         .map_err(|_| StorageError::CorruptKey)?;

---- instance_index::tests_encoding::decode_instance_index_key_returns_correct_entry_when_key_is_valid_25_bytes stdout ----

thread 'instance_index::tests_encoding::decode_instance_index_key_returns_correct_entry_when_key_is_valid_25_bytes' (2517817) panicked at crates/vo-storage/src/instance_index/tests_encoding.rs:155:50:
called `Result::unwrap()` on an `Err` value: CorruptKey

---- instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1000_bytes stdout ----

thread 'instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1000_bytes' (2517818) panicked at crates/vo-storage/src/instance_index/tests_encoding.rs:243:5:
assertion `left == right` failed
  left: Ok(InstanceIndexEntry { instance_id: InstanceId("01040G2081040G2081040G2081"), status: Pending, created_at: TimestampMs(72340172838076673) })
 right: Err(CorruptKey)

---- instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1_byte stdout ----

thread 'instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1_byte' (2517819) panicked at crates/vo-storage/src/instance_index/mod.rs:69:34:
range end index 9 out of range for slice of length 1

failures:
    instance_index::proptests::proptest_encode_decode_round_trip
    instance_index::tests_encoding::decode_instance_index_key_returns_correct_entry_when_key_is_valid_25_bytes
    instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1000_bytes
    instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_1_byte
    instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_24_bytes
    instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_26_bytes
    instance_index::tests_encoding::decode_instance_index_key_returns_corrupt_key_when_input_is_empty
    instance_index::tests_encoding::encode_then_decode_returns_original_components_when_inputs_valid
    instance_index::tests_iterator::scan_iterator_decodes_valid_entries_from_inner_iterator

test result: FAILED. 307 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
