*** crates/vo-storage/src/lease_partition/mod.rs:143:9: replace LeaseEntry::step_id -> &str with ""

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace LeaseEntry::step_id -> &str with ""
@@ -135,17 +135,17 @@
 
     #[must_use]
     pub fn instance_id(&self) -> &str {
         &self.instance_id
     }
 
     #[must_use]
     pub fn step_id(&self) -> &str {
-        &self.step_id
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub const fn fence_token(&self) -> u64 {
         self.fence_token
     }
 
     #[must_use]

---- lease_partition::tests_lease_entry::lease_entry_step_id_returns_original_string_when_entry_constructed stdout ----

thread 'lease_partition::tests_lease_entry::lease_entry_step_id_returns_original_string_when_entry_constructed' (2549678) panicked at crates/vo-storage/src/lease_partition/tests_lease_entry.rs:118:5:
assertion `left == right` failed
  left: ""
 right: "sid"

failures:
    lease_partition::tests_lease_entry::lease_entry_step_id_returns_original_string_when_entry_constructed

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
