*** crates/vo-storage/src/lease_partition/mod.rs:159:9: replace LeaseEntry::is_expired -> bool with false

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace LeaseEntry::is_expired -> bool with false
@@ -151,17 +151,17 @@
     #[must_use]
     pub const fn expires_at(&self) -> u64 {
         self.expires_at
     }
 
     /// Check if this lease has expired.
     #[must_use]
     pub const fn is_expired(&self, now_ms: u64) -> bool {
-        now_ms >= self.expires_at
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Convert to a `LeaseRecord` using a valid `FenceToken`.
     ///
     /// # Errors
     ///
     /// Returns `LeaseStoreError::Codec` if the `fence_token` is zero or
     /// `instance_id`/`step_id` cannot be parsed.

---- lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry stdout ----

thread 'lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry' (2564926) panicked at crates/vo-storage/src/lease_partition/tests_integration_acquire.rs:261:49:
called `Result::unwrap()` on an `Err` value: LeaseAlreadyHeld { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" }

---- lease_partition::tests_integration_expiry::acquire_returns_fence_token_exhausted_after_u64_max_expiry stdout ----

thread 'lease_partition::tests_integration_expiry::acquire_returns_fence_token_exhausted_after_u64_max_expiry' (2564931) panicked at crates/vo-storage/src/lease_partition/tests_integration_expiry.rs:493:5:
assertion `left == right` failed
  left: Err(LeaseAlreadyHeld { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" })
 right: Err(FenceTokenExhausted { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" })

---- lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry stdout ----

thread 'lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry' (2564927) panicked at crates/vo-storage/src/lease_partition/tests_integration_expiry.rs:261:49:
called `Result::unwrap()` on an `Err` value: LeaseAlreadyHeld { instance_id: "01ARZ3NDEKTSV4RRFFQ69G5FAV", step_id: "step-1" }

failures:
    lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_equals_expiry
    lease_partition::tests_integration_acquire::acquire_returns_new_authoritative_lease_when_now_greater_than_expiry
    lease_partition::tests_integration_expiry::acquire_lease_already_held_does_not_extend_original_expiry
    lease_partition::tests_integration_expiry::acquire_returns_fence_token_exhausted_after_u64_max_expiry
    lease_partition::tests_integration_expiry::release_stale_fence_does_not_extend_current_lease_expiry
    lease_partition::tests_integration_release::release_returns_stale_fence_when_token_is_lower_than_current
    lease_partition::tests_integration_stale::check_stale_fence_is_observational_across_expiry_boundary
    lease_partition::tests_integration_stale::check_stale_fence_returns_true_when_supplied_token_is_lower_than_current
    lease_part

test result: FAILED. 305 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
