*** crates/vo-storage/src/lease_partition/mod.rs:194:5: replace encode_lease_key -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace encode_lease_key -> Vec<u8> with vec![0]
@@ -186,17 +186,17 @@
 /// Partition name for the lease store.
 pub const LEASE_PARTITION: &str = "leases";
 
 /// Encode a lease key as `<instance_id>::<step_id>` UTF-8 bytes.
 ///
 /// Uses the Display representation of both types with `::` delimiter.
 #[must_use]
 pub fn encode_lease_key(instance_id: &InstanceId, step_id: &StepId) -> Vec<u8> {
-    format!("{instance_id}::{step_id}").into_bytes()
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decode UTF-8 bytes into an `instance_id` and `step_id`.
 ///
 /// Expects format `<instance_id>::<step_id>`.
 ///
 /// # Errors
 ///

---- lease_partition::tests_codec::decode_lease_key_returns_original_ids_when_input_was_encoded stdout ----

thread 'lease_partition::tests_codec::decode_lease_key_returns_original_ids_when_input_was_encoded' (2574287) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:60:5:
assertion `left == right` failed
  left: Err(Codec { reason: "missing :: delimiter in lease key" })
 right: Ok((InstanceId("01ARZ3NDEKTSV4RRFFQ69G5FAV"), StepId("step-1")))

---- lease_partition::tests_codec::encode_lease_key_returns_exact_bytes_for_valid_ids stdout ----

thread 'lease_partition::tests_codec::encode_lease_key_returns_exact_bytes_for_valid_ids' (2574294) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:39:5:
assertion `left == right` failed
  left: [0]
 right: [48, 49, 65, 82, 90, 51, 78, 68, 69, 75, 84, 83, 86, 52, 82, 82, 70, 70, 81, 54, 57, 71, 53, 70, 65, 86, 58, 58, 115, 116, 101, 112, 45, 49]

---- lease_partition::tests_codec::encode_lease_key_preserves_hyphen_and_underscore_in_step_id stdout ----

thread 'lease_partition::tests_codec::encode_lease_key_preserves_hyphen_and_underscore_in_step_id' (2574292) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:46:5:
assertion `left == right` failed
  left: [0]
 right: [48, 49, 65, 82, 90, 51, 78, 68, 69, 75, 84, 83, 86, 52, 82, 82, 70, 70, 81, 54, 57, 71, 53, 70, 65, 86, 58, 58, 115, 116, 101, 112, 95, 97, 45, 49]

failures:
    lease_partition::tests_codec::decode_lease_key_returns_original_ids_when_input_was_encoded
    lease_partition::tests_codec::encode_lease_key_preserves_hyphen_and_underscore_in_step_id
    lease_partition::tests_codec::encode_lease_key_returns_exact_byte_length_for_known_ids
    lease_partition::tests_codec::encode_lease_key_returns_exact_bytes_for_valid_ids

test result: FAILED. 314 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
