*** crates/vo-storage/src/lease_partition/mod.rs:71:9: replace <impl fmt::Display for LeaseStoreError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/vo-storage/src/lease_partition/mod.rs
+++ replace <impl fmt::Display for LeaseStoreError>::fmt -> fmt::Result with Ok(Default::default())
@@ -63,36 +63,17 @@
     Codec { reason: String },
 
     /// Invalid argument.
     InvalidArgument,
 }
 
 impl fmt::Display for LeaseStoreError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::LeaseAlreadyHeld {
-                instance_id,
-                step_id,
-            } => write!(f, "lease already held for {instance_id}::{step_id}"),
-            Self::NotFound {
-                instance_id,
-                step_id,
-            } => write!(f, "lease not found for {instance_id}::{step_id}"),
-            Self::StaleFence { expected, actual } => {
-                write!(f, "stale fence: expected {expected}, got {actual}")
-            }
-            Self::FenceTokenExhausted {
-                instance_id,
-                step_id,
-            } => write!(f, "fence token exhausted for {instance_id}::{step_id}"),
-            Self::Storage { reason } => write!(f, "lease storage error: {reason}"),
-            Self::Codec { reason } => write!(f, "lease codec error: {reason}"),
-            Self::InvalidArgument => write!(f, "invalid lease argument"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for LeaseStoreError {}
 
 // ---------------------------------------------------------------------------
 // Data layer — LeaseEntry (persisted form with expiry)
 // ---------------------------------------------------------------------------

---- lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_invalid_argument stdout ----

thread 'lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_invalid_argument' (2542059) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:452:5:
assertion `left == right` failed
  left: ""
 right: "invalid lease argument"

---- lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_fence_token_exhausted stdout ----

thread 'lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_fence_token_exhausted' (2542058) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:429:5:
assertion `left == right` failed
  left: ""
 right: "fence token exhausted for iid::sid"

---- lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_lease_already_held stdout ----

thread 'lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_lease_already_held' (2542060) panicked at crates/vo-storage/src/lease_partition/tests_codec.rs:399:5:
assertion `left == right` failed
  left: ""
 right: "lease already held for iid::sid"

failures:
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_codec
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_fence_token_exhausted
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_invalid_argument
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_lease_already_held
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_not_found
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_stale_fence
    lease_partition::tests_codec::lease_store_error_display_equals_exact_message_for_storage

test result: FAILED. 311 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
