*** crates/vo-storage/src/lease_partition/verification.rs:21:5: replace verify_encode_decode_lease_key_roundtrip with ()

*** mutation diff:
--- crates/vo-storage/src/lease_partition/verification.rs
+++ replace verify_encode_decode_lease_key_roundtrip with ()
@@ -13,15 +13,10 @@
 pub(super) fn verify_lease_entry_rejects_zero_fence() {
     let result = LeaseEntry::new("iid".to_string(), "sid".to_string(), 0, 1000);
     assert_eq!(result, Err(LeaseStoreError::InvalidArgument));
 }
 
 /// K-02: Verify encode/decode lease key round-trip.
 #[cfg_attr(kani, kani::proof)]
 pub(super) fn verify_encode_decode_lease_key_roundtrip() {
-    let iid = parse_instance_id("01H5JYV4XHGSR2F8KZ9BWNRFMA");
-    let sid = parse_step_id("step-kani");
-    let key = encode_lease_key(&iid, &sid);
-    assert_eq!(iid.to_string(), "01H5JYV4XHGSR2F8KZ9BWNRFMA".to_string());
-    assert_eq!(sid.to_string(), "step-kani".to_string());
-    assert_eq!(key, b"01H5JYV4XHGSR2F8KZ9BWNRFMA::step-kani".to_vec());
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
