*** crates/vo-storage/src/purge.rs:28:58: replace == with != in purge_instance

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ replace == with != in purge_instance
@@ -20,17 +20,17 @@
         ));
     }
 
     // 1. Parse InstanceId
     let parsed_id = InstanceId::parse(instance_id_str).map_err(StorageError::InvalidInstanceId)?;
 
     // 2. Find instance in index to verify status and get metadata for key reconstruction
     let entry = scan_all_instances(keyspace)
-        .find(|r| r.as_ref().is_ok_and(|e| e.instance_id == parsed_id))
+        .find(|r| r.as_ref().is_ok_and(|e| e.instance_id != /* ~ changed by cargo-mutants ~ */ parsed_id))
         .ok_or(StorageError::InstanceRunning)? // Mapping "not found" to InstanceRunning per test expectations for non-terminal
         .map_err(|_| StorageError::ScanFailed)?;
 
     // 3. Verify status is terminal
     if !is_terminal(entry.status) {
         return Err(StorageError::InstanceRunning);
     }

---- purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance stdout ----

thread 'purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance' (2589138) panicked at crates/vo-storage/src/purge.rs:182:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(2)

---- purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events stdout ----

thread 'purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events' (2589144) panicked at crates/vo-storage/src/purge.rs:143:9:
assertion `left == right` failed
  left: Err(InstanceRunning)
 right: Ok(0)

failures:
    purge::tests::purge_instance_deletes_events_snapshots_and_index_for_terminal_instance
    purge::tests::purge_instance_returns_zero_when_terminal_instance_has_no_events

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
