*** crates/vo-storage/src/purge.rs:80:5: replace is_terminal -> bool with true

*** mutation diff:
--- crates/vo-storage/src/purge.rs
+++ replace is_terminal -> bool with true
@@ -72,20 +72,17 @@
         .commit()
         .map_err(|_| StorageError::BatchCommitFailed)?;
 
     Ok(event_count)
 }
 
 #[must_use]
 pub const fn is_terminal(status: InstanceStatus) -> bool {
-    matches!(
-        status,
-        InstanceStatus::Completed | InstanceStatus::Failed | InstanceStatus::Cancelled
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
 mod tests {
     use super::*;
     use crate::codec::encode_event_key;
     use crate::instance_index::instance_index_upsert;

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_4 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_4' (2603436) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: true
 right: false

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_6 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_6' (2603438) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: true
 right: false

---- purge::tests::is_terminal_returns_expected_value_for_each_status::case_5 stdout ----

thread 'purge::tests::is_terminal_returns_expected_value_for_each_status::case_5' (2603437) panicked at crates/vo-storage/src/purge.rs:196:9:
assertion `left == right` failed
  left: true
 right: false

failures:
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_4
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_5
    purge::tests::is_terminal_returns_expected_value_for_each_status::case_6

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
