*** crates/vo-storage/src/query/mod.rs:117:9: replace IteratorState::advance -> Option<Result<EventEnvelope, StorageError>> with None

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace IteratorState::advance -> Option<Result<EventEnvelope, StorageError>> with None
@@ -109,32 +109,17 @@
         }
     }
 
     pub fn advance(
         &mut self,
         found: u64,
         record: EventEnvelope,
     ) -> Option<Result<EventEnvelope, StorageError>> {
-        if found == 0 {
-            return Some(Err(StorageError::InvalidArgument));
-        }
-        if !self.started {
-            self.started = true;
-            self.expected = found.checked_add(1);
-            return Some(Ok(record));
-        }
-        match self.expected {
-            Some(expected) if found != expected => Some(Err(StorageError::SequenceGap)),
-            Some(expected) => {
-                self.expected = expected.checked_add(1);
-                Some(Ok(record))
-            }
-            None => Some(Err(StorageError::SequenceGap)),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ---------------------------------------------------------------------------
 // Actions layer — iterator + constructor
 // ---------------------------------------------------------------------------
 
 pub struct EventReplayIterator {

---- query::tests::iterator_state_detects_sequence_gap stdout ----

thread 'query::tests::iterator_state_detects_sequence_gap' (2637167) panicked at crates/vo-storage/src/query/tests.rs:142:5:
assertion `left == right` failed
  left: None
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 1, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

---- query::tests::iterator_state_accepts_consecutive_sequences stdout ----

thread 'query::tests::iterator_state_accepts_consecutive_sequences' (2637166) panicked at crates/vo-storage/src/query/tests.rs:153:5:
assertion `left == right` failed
  left: None
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 1, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

---- query::tests::iterator_state_first_advance_accepts_any_nonzero stdout ----

thread 'query::tests::iterator_state_first_advance_accepts_any_nonzero' (2637168) panicked at crates/vo-storage/src/query/tests.rs:126:5:
assertion `left == right` failed
  left: None
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 1, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

failures:
    query::tests::iterator_state_accepts_consecutive_sequences
    query::tests::iterator_state_detects_sequence_gap
    query::tests::iterator_state_first_advance_accepts_any_nonzero
    query::tests::iterator_state_handles_u64_overflow_checked_add
    query::tests::iterator_state_rejects_zero_sequence

test result: FAILED. 313 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
