*** crates/vo-storage/src/query/mod.rs:126:31: replace match guard found != expected with true in IteratorState::advance

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace match guard found != expected with true in IteratorState::advance
@@ -118,17 +118,17 @@
             return Some(Err(StorageError::InvalidArgument));
         }
         if !self.started {
             self.started = true;
             self.expected = found.checked_add(1);
             return Some(Ok(record));
         }
         match self.expected {
-            Some(expected) if found != expected => Some(Err(StorageError::SequenceGap)),
+            Some(expected) if true /* ~ changed by cargo-mutants ~ */ => Some(Err(StorageError::SequenceGap)),
             Some(expected) => {
                 self.expected = expected.checked_add(1);
                 Some(Ok(record))
             }
             None => Some(Err(StorageError::SequenceGap)),
         }
     }
 }

---- query::tests::iterator_state_accepts_consecutive_sequences stdout ----

thread 'query::tests::iterator_state_accepts_consecutive_sequences' (2646645) panicked at crates/vo-storage/src/query/tests.rs:156:5:
assertion `left == right` failed
  left: Some(Err(SequenceGap))
 right: Some(Ok(EventEnvelope { schema_version: 1, instance_id: "test-instance", sequence: 2, timestamp_ms: 1000, payload: Object {"type": String("WorkflowStarted"), "workflow_id": String("wf-1")}, metadata: Object {} }))

failures:
    query::tests::iterator_state_accepts_consecutive_sequences

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
