*** crates/vo-storage/src/query/mod.rs:173:9: replace EventReplayIterator::process_kv -> Option<Result<EventEnvelope, StorageError>> with None

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace EventReplayIterator::process_kv -> Option<Result<EventEnvelope, StorageError>> with None
@@ -165,48 +165,17 @@
 }
 
 impl EventReplayIterator {
     fn process_kv(
         &mut self,
         k_bytes: &fjall::Slice,
         v_bytes: &fjall::Slice,
     ) -> Option<Result<EventEnvelope, StorageError>> {
-        let seq_len: usize = 8;
-        if k_bytes.len() < seq_len {
-            self.inner = None;
-            return Some(Err(StorageError::Storage));
-        }
-        let seq_bytes = &k_bytes[k_bytes.len() - seq_len..];
-        let found_seq = match decode_key(seq_bytes) {
-            Ok(s) => s,
-            Err(e) => {
-                self.inner = None;
-                return Some(Err(e));
-            }
-        };
-        let envelope = match EventEnvelope::from_bytes(v_bytes) {
-            Ok(e) => e,
-            Err(EventError::UnsupportedEnvelopeVersion(_)) => {
-                self.inner = None;
-                return Some(Err(StorageError::UnsupportedVersion));
-            }
-            Err(_) => {
-                self.inner = None;
-                return Some(Err(StorageError::CorruptEventPayload));
-            }
-        };
-        match self.state.advance(found_seq, envelope) {
-            Some(Err(e)) => {
-                self.inner = None;
-                Some(Err(e))
-            }
-            Some(Ok(env)) => Some(Ok(env)),
-            None => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[must_use]
 pub fn replay_events(keyspace: &fjall::Keyspace, instance_id: &InstanceId) -> EventReplayIterator {
     let prefix = match prefix_generator(instance_id) {
         Ok(p) => p,
         Err(e) => {

---- replay_events_handles_corrupt_payload stdout ----

thread 'replay_events_handles_corrupt_payload' (2667048) panicked at crates/vo-storage/tests/integration_replay.rs:162:5:
assertion `left == right` failed
  left: 0
 right: 1

---- replay_events_isolates_different_instances stdout ----

thread 'replay_events_isolates_different_instances' (2667052) panicked at crates/vo-storage/tests/integration_replay.rs:207:5:
assertion `left == right` failed
  left: 0
 right: 3

---- replay_events_handles_unsupported_version stdout ----

thread 'replay_events_handles_unsupported_version' (2667051) panicked at crates/vo-storage/tests/integration_replay.rs:180:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    replay_events_accepts_non_one_starting_sequence
    replay_events_detects_sequence_gap
    replay_events_handles_corrupt_payload
    replay_events_handles_gap_at_start
    replay_events_handles_large_sequence_range
    replay_events_handles_unsupported_version
    replay_events_isolates_different_instances
    replay_events_returns_multiple_events_in_sequence
    replay_events_returns_single_event_in_order
    replay_events_stops_after_first_error

test result: FAILED. 1 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
