*** crates/vo-storage/src/query/mod.rs:174:26: replace < with <= in EventReplayIterator::process_kv

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace < with <= in EventReplayIterator::process_kv
@@ -166,17 +166,17 @@
 
 impl EventReplayIterator {
     fn process_kv(
         &mut self,
         k_bytes: &fjall::Slice,
         v_bytes: &fjall::Slice,
     ) -> Option<Result<EventEnvelope, StorageError>> {
         let seq_len: usize = 8;
-        if k_bytes.len() < seq_len {
+        if k_bytes.len() <= /* ~ changed by cargo-mutants ~ */ seq_len {
             self.inner = None;
             return Some(Err(StorageError::Storage));
         }
         let seq_bytes = &k_bytes[k_bytes.len() - seq_len..];
         let found_seq = match decode_key(seq_bytes) {
             Ok(s) => s,
             Err(e) => {
                 self.inner = None;

*** result: Success
