*** crates/vo-storage/src/query/mod.rs:36:5: replace decode_key -> Result<u64, StorageError> with Ok(0)

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace decode_key -> Result<u64, StorageError> with Ok(0)
@@ -28,22 +28,17 @@
 
 /// Decode a big-endian 8-byte slice into a sequence number.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::Storage` if the slice is not exactly 8 bytes.
 /// Returns `StorageError::InvalidArgument` if the slice decodes to zero.
 pub fn decode_key(bytes: &[u8]) -> Result<u64, StorageError> {
-    let arr: [u8; 8] = bytes.try_into().map_err(|_| StorageError::Storage)?;
-    let seq = u64::from_be_bytes(arr);
-    if seq == 0 {
-        return Err(StorageError::InvalidArgument);
-    }
-    Ok(seq)
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Produce the prefix bytes for range-scanning a given instance.
 ///
 /// Accepts the domain `InstanceId` type directly — callers should not
 /// pre-extract the string representation.
 ///
 /// # Errors

---- query::tests::decode_key_returns_error_for_empty_slice stdout ----

thread 'query::tests::decode_key_returns_error_for_empty_slice' (2613789) panicked at crates/vo-storage/src/query/tests.rs:48:5:
assertion `left == right` failed
  left: Ok(0)
 right: Err(Storage)

---- query::tests::decode_key_returns_error_for_zero_sequence stdout ----

thread 'query::tests::decode_key_returns_error_for_zero_sequence' (2613803) panicked at crates/vo-storage/src/query/tests.rs:58:5:
assertion `left == right` failed
  left: Ok(0)
 right: Err(InvalidArgument)

---- query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes stdout ----

thread 'query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes' (2613805) panicked at crates/vo-storage/src/query/tests.rs:43:5:
assertion `left == right` failed
  left: Ok(0)
 right: Ok(1)

failures:
    query::tests::decode_key_returns_error_for_empty_slice
    query::tests::decode_key_returns_error_for_short_slice
    query::tests::decode_key_returns_error_for_zero_sequence
    query::tests::decode_key_returns_sequence_for_valid_big_endian_bytes
    query::tests::decode_key_roundtrips_with_encode_key
    query::tests::proptest_encode_decode_roundtrip

test result: FAILED. 312 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
