*** crates/vo-storage/src/query/mod.rs:54:5: replace prefix_generator -> Result<Vec<u8>, StorageError> with Ok(vec![1])

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace prefix_generator -> Result<Vec<u8>, StorageError> with Ok(vec![1])
@@ -46,24 +46,17 @@
 /// Accepts the domain `InstanceId` type directly — callers should not
 /// pre-extract the string representation.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::InvalidArgument` if the instance ID exceeds 255 bytes.
 /// Returns `StorageError::InvalidArgument` if the instance ID contains null bytes.
 pub fn prefix_generator(instance_id: &InstanceId) -> Result<Vec<u8>, StorageError> {
-    let id_str = instance_id.as_str();
-    if id_str.len() > 255 {
-        return Err(StorageError::InvalidArgument);
-    }
-    if id_str.as_bytes().contains(&b'\0') {
-        return Err(StorageError::InvalidArgument);
-    }
-    Ok(id_str.as_bytes().to_vec())
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Map an envelope decode error into the storage-layer replay taxonomy.
 ///
 /// ## Why this intentionally collapses errors
 ///
 /// `replay_events` is a storage-boundary API. Its responsibility is to:
 /// - read bytes from storage,

---- query::tests::prefix_generator_returns_bytes_for_valid_instance_id stdout ----

thread 'query::tests::prefix_generator_returns_bytes_for_valid_instance_id' (2627742) panicked at crates/vo-storage/src/query/tests.rs:88:5:
assertion `left == right` failed
  left: [1]
 right: [48, 49, 48, 52, 48, 71, 50, 48, 56, 49, 48, 52, 48, 71, 50, 48, 56, 49, 48, 52, 48, 71, 50, 48, 56, 49]

---- query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id stdout ----

thread 'query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id' (2627741) panicked at crates/vo-storage/src/query/tests.rs:96:5:
assertion `left == right` failed
  left: 1
 right: 26

failures:
    query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id
    query::tests::prefix_generator_returns_bytes_for_valid_instance_id

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
