*** crates/vo-storage/src/query/mod.rs:55:21: replace > with < in prefix_generator

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ replace > with < in prefix_generator
@@ -47,17 +47,17 @@
 /// pre-extract the string representation.
 ///
 /// # Errors
 ///
 /// Returns `StorageError::InvalidArgument` if the instance ID exceeds 255 bytes.
 /// Returns `StorageError::InvalidArgument` if the instance ID contains null bytes.
 pub fn prefix_generator(instance_id: &InstanceId) -> Result<Vec<u8>, StorageError> {
     let id_str = instance_id.as_str();
-    if id_str.len() > 255 {
+    if id_str.len() < /* ~ changed by cargo-mutants ~ */ 255 {
         return Err(StorageError::InvalidArgument);
     }
     if id_str.as_bytes().contains(&b'\0') {
         return Err(StorageError::InvalidArgument);
     }
     Ok(id_str.as_bytes().to_vec())
 }

---- query::tests::prefix_generator_returns_bytes_for_valid_instance_id stdout ----

thread 'query::tests::prefix_generator_returns_bytes_for_valid_instance_id' (2631444) panicked at crates/vo-storage/src/query/tests.rs:86:9:
result should be Ok

---- query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id stdout ----

thread 'query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id' (2631443) panicked at crates/vo-storage/src/query/tests.rs:95:39:
called `Result::unwrap()` on an `Err` value: InvalidArgument

failures:
    query::tests::prefix_generator_returns_26_bytes_for_any_valid_instance_id
    query::tests::prefix_generator_returns_bytes_for_valid_instance_id

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
