*** crates/vo-storage/src/query/mod.rs:83:9: delete match arm EventError::UnsupportedEnvelopeVersion(_) in error_mapper

*** mutation diff:
--- crates/vo-storage/src/query/mod.rs
+++ delete match arm EventError::UnsupportedEnvelopeVersion(_) in error_mapper
@@ -75,17 +75,17 @@
 /// - `UnsupportedVersion`: the envelope is well-formed but from an unsupported version.
 /// - `CorruptEventPayload`: the stored envelope bytes are malformed or incomplete.
 ///
 /// This keeps the replay API stable while still distinguishing the only versioning
 /// concern that callers can reasonably react to differently.
 #[must_use]
 pub const fn error_mapper(error: &EventError) -> StorageError {
     match error {
-        EventError::UnsupportedEnvelopeVersion(_) => StorageError::UnsupportedVersion,
+         /* ~ changed by cargo-mutants ~ */
         _ => StorageError::CorruptEventPayload,
     }
 }
 
 // ---------------------------------------------------------------------------
 // Data layer — iterator state machine
 // ---------------------------------------------------------------------------

---- query::tests::error_mapper_maps_unsupported_envelope_version stdout ----

thread 'query::tests::error_mapper_maps_unsupported_envelope_version' (2636673) panicked at crates/vo-storage/src/query/tests.rs:104:5:
assertion `left == right` failed
  left: CorruptEventPayload
 right: UnsupportedVersion

failures:
    query::tests::error_mapper_maps_unsupported_envelope_version

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
