*** crates/vo-storage/src/snapshots/mod.rs:42:5: replace snapshot_load_latest -> Result<Option<(u64, InstanceState)>, StorageError> with Ok(None)

*** mutation diff:
--- crates/vo-storage/src/snapshots/mod.rs
+++ replace snapshot_load_latest -> Result<Option<(u64, InstanceState)>, StorageError> with Ok(None)
@@ -34,34 +34,17 @@
 /// Returns `StorageError::CorruptKey` if the instance ID cannot be serialized.
 /// Returns `StorageError::FjallError` if the storage engine fails.
 /// Returns `StorageError::InvalidKey` if a stored key is not exactly 24 bytes.
 /// Returns `StorageError::DeserializationFailed` if the stored value is not valid JSON.
 pub fn snapshot_load_latest(
     partition: &PartitionHandle,
     instance_id: &InstanceId,
 ) -> Result<Option<(u64, InstanceState)>, StorageError> {
-    let prefix = instance_id
-        .to_bytes()
-        .map_err(|_| StorageError::CorruptKey)?;
-
-    partition
-        .prefix(&prefix)
-        .next_back()
-        .map_or(Ok(None), |result| {
-            result
-                .map_err(|_| StorageError::FjallError)
-                .and_then(|(key, value)| {
-                    decode_snapshot_key(&key).and_then(|(_, sequence)| {
-                        serde_json::from_slice(&value)
-                            .map_err(|_| StorageError::DeserializationFailed)
-                            .map(|state| Some((sequence, state)))
-                    })
-                })
-        })
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes an `(InstanceId, u64)` pair into a 24-byte snapshot key.
 ///
 /// Layout: `[instance_id_16_bytes | sequence_u64_be_8_bytes]`.
 ///
 /// # Errors
 ///

---- snapshots::tests::snapshot_write_persists_state_in_populated_partition stdout ----

thread 'snapshots::tests::snapshot_write_persists_state_in_populated_partition' (2682042) panicked at crates/vo-storage/src/snapshots/tests.rs:134:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((100, InstanceState { counter: 42 })))

---- snapshots::tests::snapshot_write_boundary_instance_id_minimum stdout ----

thread 'snapshots::tests::snapshot_write_boundary_instance_id_minimum' (2682038) panicked at crates/vo-storage/src/snapshots/tests.rs:144:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((1, InstanceState { counter: 1 })))

---- snapshots::tests::snapshot_load_latest_boundary_instance_id_maximum stdout ----

thread 'snapshots::tests::snapshot_load_latest_boundary_instance_id_maximum' (2682025) panicked at crates/vo-storage/src/snapshots/tests.rs:229:5:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some((10, InstanceState { counter: 1 })))

failures:
    snapshots::tests::snapshot_load_latest_boundary_instance_id_maximum
    snapshots::tests::snapshot_load_latest_boundary_instance_id_minimum
    snapshots::tests::snapshot_load_latest_does_not_bleed_into_next_prefix_when_instance_a_is_less_than_b
    snapshots::tests::snapshot_load_latest_enforces_backward_seek_without_unbounded_iteration
    snapshots::tests::snapshot_load_latest_rejects_corrupted_key_from_storage
    snapshots::tests::snapshot_load_latest_returns_deserialization_failed_on_corrupt_json_value
    snapshots::tests::snapshot_load_latest_returns_the_snapshot_with_the_highest_sequence_number
    snapshots::tests::snapshot_write_boundary_instance_id_maximum
    snapshots::tests::snapshot_write_boundary_instance_id_minimum
    snapshots::tests::snapshot_write_overwrites_existing_data_idempotently
    snapshots::tests::snapshot_write_persists_state_in_populated_par

test result: FAILED. 306 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
