*** crates/vo-storage/src/status_store.rs:124:5: replace load_all_statuses -> Result<Vec<(WorkflowName, RegistrationStatus)>, StatusStoreError> with Ok(vec![])

*** mutation diff:
--- crates/vo-storage/src/status_store.rs
+++ replace load_all_statuses -> Result<Vec<(WorkflowName, RegistrationStatus)>, StatusStoreError> with Ok(vec![])
@@ -116,48 +116,17 @@
 /// Returns only non-Active entries (Active is the default and need not be persisted).
 ///
 /// # Errors
 /// Returns `StatusStoreError::Storage` on Fjall scan failure.
 /// Returns `StatusStoreError::CorruptValue` if any stored key or value is malformed.
 pub fn load_all_statuses(
     partition: &fjall::PartitionHandle,
 ) -> Result<Vec<(WorkflowName, RegistrationStatus)>, StatusStoreError> {
-    partition
-        .iter()
-        .map(|item| {
-            let (key_bytes, value_bytes) = item.map_err(|e| StatusStoreError::Storage {
-                reason: e.to_string(),
-            })?;
-
-            let key_str =
-                std::str::from_utf8(&key_bytes).map_err(|e| StatusStoreError::CorruptValue {
-                    reason: format!("invalid UTF-8 key: {e}"),
-                })?;
-
-            let workflow_name =
-                WorkflowName::parse(key_str).map_err(|e| StatusStoreError::CorruptValue {
-                    reason: format!("invalid workflow name: {e}"),
-                })?;
-
-            let status = decode_status(&value_bytes)?;
-
-            Ok((workflow_name, status))
-        })
-        .filter_map(
-            |result: Result<(WorkflowName, RegistrationStatus), StatusStoreError>| {
-                match result {
-                    // Only include non-Active entries (Active is default)
-                    Ok((_, RegistrationStatus::Active)) => None,
-                    Ok(pair) => Some(Ok(pair)),
-                    Err(e) => Some(Err(e)),
-                }
-            },
-        )
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 // ---------------------------------------------------------------------------
 // Unit tests — Calc layer
 // ---------------------------------------------------------------------------
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used, clippy::panic)]

---- status_store::tests::load_all_statuses_returns_corrupt_value_when_stored_status_is_invalid_json stdout ----

thread 'status_store::tests::load_all_statuses_returns_corrupt_value_when_stored_status_is_invalid_json' (2708129) panicked at crates/vo-storage/src/status_store.rs:312:9:
assertion `left == right` failed
  left: Ok([])
 right: Err(CorruptValue { reason: "expected value at line 1 column 1" })

---- status_store::tests::load_all_statuses_returns_corrupt_value_when_key_is_not_utf8 stdout ----

thread 'status_store::tests::load_all_statuses_returns_corrupt_value_when_key_is_not_utf8' (2708127) panicked at crates/vo-storage/src/status_store.rs:297:9:
assertion `left == right` failed
  left: Ok([])
 right: Err(CorruptValue { reason: "invalid UTF-8 key: invalid utf-8 sequence of 1 bytes from index 0" })

---- status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order stdout ----

thread 'status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order' (2708131) panicked at crates/vo-storage/src/status_store.rs:282:9:
assertion `left == right` failed
  left: Ok([])
 right: Ok([(WorkflowName("wf-deactivated"), Deactivated), (WorkflowName("wf-quarantined"), Quarantined)])

failures:
    status_store::tests::load_all_statuses_returns_corrupt_value_when_key_is_not_utf8
    status_store::tests::load_all_statuses_returns_corrupt_value_when_stored_status_is_invalid_json
    status_store::tests::load_all_statuses_returns_only_non_active_entries_in_key_order

test result: FAILED. 315 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
