*** crates/vo-storage/src/status_store.rs:82:5: replace read_registration_status -> Result<Option<RegistrationStatus>, StatusStoreError> with Ok(None)

*** mutation diff:
--- crates/vo-storage/src/status_store.rs
+++ replace read_registration_status -> Result<Option<RegistrationStatus>, StatusStoreError> with Ok(None)
@@ -74,27 +74,17 @@
 ///
 /// # Errors
 /// Returns `StatusStoreError::Storage` on Fjall failure.
 /// Returns `StatusStoreError::CorruptValue` if the stored value is malformed.
 pub fn read_registration_status(
     partition: &fjall::PartitionHandle,
     workflow_name: &WorkflowName,
 ) -> Result<Option<RegistrationStatus>, StatusStoreError> {
-    let key = workflow_name.as_str().as_bytes();
-    match partition.get(key) {
-        Ok(Some(value_bytes)) => {
-            let status = decode_status(&value_bytes)?;
-            Ok(Some(status))
-        }
-        Ok(None) => Ok(None),
-        Err(e) => Err(StatusStoreError::Storage {
-            reason: e.to_string(),
-        }),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Write a registration status for a workflow to Fjall.
 ///
 /// # Errors
 /// Returns `StatusStoreError::Storage` on Fjall failure.
 /// Returns `StatusStoreError::CorruptValue` if serialization fails.
 pub fn write_registration_status(

---- status_store::tests::read_registration_status_returns_written_status_for_existing_entry stdout ----

thread 'status_store::tests::read_registration_status_returns_written_status_for_existing_entry' (2704044) panicked at crates/vo-storage/src/status_store.rs:279:9:
assertion `left == right` failed
  left: Ok(None)
 right: Ok(Some(Quarantined))

failures:
    status_store::tests::read_registration_status_returns_written_status_for_existing_entry

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
