*** crates/vo-storage/src/timer_index.rs:104:23: replace != with == in TimerRecord::try_from_parts

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace != with == in TimerRecord::try_from_parts
@@ -96,17 +96,17 @@
         fire_at_ms: u64,
         trigger_time_ms: u64,
         duration_ms: u64,
     ) -> Result<Self, StorageError> {
         if duration_ms == 0 {
             return Err(StorageError::InvalidArgument);
         }
         // Dual-clock verification
-        if fire_at_ms != trigger_time_ms.saturating_add(duration_ms) {
+        if fire_at_ms == /* ~ changed by cargo-mutants ~ */ trigger_time_ms.saturating_add(duration_ms) {
             return Err(StorageError::InvalidArgument);
         }
         Ok(Self {
             timer_id,
             instance_id,
             fire_at_ms,
             trigger_time_ms,
             duration_ms,

---- timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_dual_clock_mismatches stdout ----

thread 'timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_dual_clock_mismatches' (2728794) panicked at crates/vo-storage/src/timer_index.rs:515:9:
assertion `left == right` failed
  left: Ok(TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 1001, trigger_time_ms: 900, duration_ms: 100 })
 right: Err(InvalidArgument)

---- timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches stdout ----

thread 'timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches' (2728796) panicked at crates/vo-storage/src/timer_index.rs:492:9:
assertion `left == right` failed
  left: Err(InvalidArgument)
 right: Ok(TimerRecord { timer_id: TimerId("02020202-0202-0202-0202-020202020202"), instance_id: InstanceId("01040G2081040G2081040G2081"), fire_at_ms: 1100, trigger_time_ms: 1000, duration_ms: 100 })

failures:
    timer_index::tests::fn_timer_record_try_from_parts_returns_invalid_argument_when_dual_clock_mismatches
    timer_index::tests::fn_timer_record_try_from_parts_returns_record_when_dual_clock_matches

test result: FAILED. 316 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
