*** crates/vo-storage/src/timer_index.rs:165:19: replace != with == in timer_set

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace != with == in timer_set
@@ -157,17 +157,17 @@
     now_ms: u64,
 ) -> Result<(), StorageError> {
     if fire_at_ms <= now_ms {
         return Err(StorageError::InvalidArgument);
     }
     if duration_ms == 0 {
         return Err(StorageError::InvalidArgument);
     }
-    if fire_at_ms != trigger_time_ms.saturating_add(duration_ms) {
+    if fire_at_ms == /* ~ changed by cargo-mutants ~ */ trigger_time_ms.saturating_add(duration_ms) {
         return Err(StorageError::InvalidArgument);
     }
 
     let key = TimerKey::new(fire_at_ms, instance_id, timer_id)?;
     let value = duration_ms.to_be_bytes();
     storage.put(key.as_bytes(), &value)
 }

---- timer_index::tests::fn_scan_due_timers_filters_out_different_instance_id stdout ----

thread 'timer_index::tests::fn_scan_due_timers_filters_out_different_instance_id' (2738873) panicked at crates/vo-storage/src/timer_index.rs:571:10:
called `Result::unwrap()` on an `Err` value: InvalidArgument

---- timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now stdout ----

thread 'timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now' (2738869) panicked at crates/vo-storage/src/timer_index.rs:400:10:
called `Result::unwrap()` on an `Err` value: InvalidArgument

---- timer_index::tests::fn_scan_due_timers_not_due_when_fire_at_greater_than_now stdout ----

thread 'timer_index::tests::fn_scan_due_timers_not_due_when_fire_at_greater_than_now' (2738875) panicked at crates/vo-storage/src/timer_index.rs:420:10:
called `Result::unwrap()` on an `Err` value: InvalidArgument

failures:
    timer_index::tests::fn_scan_due_timers_due_when_fire_at_equals_now
    timer_index::tests::fn_scan_due_timers_filters_out_different_instance_id
    timer_index::tests::fn_scan_due_timers_not_due_when_fire_at_greater_than_now
    timer_index::tests::fn_scan_due_timers_returns_trigger_time_reconstructed_from_duration
    timer_index::tests::fn_timer_delete_removes_existing_timer
    timer_index::tests::fn_timer_set_overwrites_existing_timer_when_same_key
    timer_index::tests::fn_timer_set_rejects_when_dual_clock_invariant_is_broken
    timer_index::tests::fn_timer_set_returns_storage_when_put_fails
    timer_index::tests::fn_timer_set_stores_timer_when_fire_at_ms_greater_than_now_ms

test result: FAILED. 309 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
