*** crates/vo-storage/src/timer_index.rs:70:9: replace TimerValue::duration_ms -> u64 with 0

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace TimerValue::duration_ms -> u64 with 0
@@ -62,17 +62,17 @@
     pub const fn new(duration_ms: u64) -> Result<Self, StorageError> {
         if duration_ms == 0 {
             return Err(StorageError::InvalidArgument);
         }
         Ok(Self(duration_ms))
     }
     #[must_use]
     pub const fn duration_ms(&self) -> u64 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
     #[must_use]
     pub const fn as_be_bytes(&self) -> [u8; 8] {
         self.0.to_be_bytes()
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]

---- timer_index::tests::fn_timer_value_returns_duration_when_duration_is_non_zero stdout ----

thread 'timer_index::tests::fn_timer_value_returns_duration_when_duration_is_non_zero' (2718290) panicked at crates/vo-storage/src/timer_index.rs:477:9:
assertion `left == right` failed
  left: 0
 right: 250

failures:
    timer_index::tests::fn_timer_value_returns_duration_when_duration_is_non_zero

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
