*** crates/vo-storage/src/timer_index.rs:74:9: replace TimerValue::as_be_bytes -> [u8; 8] with [1; 8]

*** mutation diff:
--- crates/vo-storage/src/timer_index.rs
+++ replace TimerValue::as_be_bytes -> [u8; 8] with [1; 8]
@@ -66,17 +66,17 @@
         Ok(Self(duration_ms))
     }
     #[must_use]
     pub const fn duration_ms(&self) -> u64 {
         self.0
     }
     #[must_use]
     pub const fn as_be_bytes(&self) -> [u8; 8] {
-        self.0.to_be_bytes()
+        [1; 8] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub struct TimerRecord {
     pub timer_id: TimerId,
     pub instance_id: InstanceId,
     pub fire_at_ms: u64,

---- timer_index::tests::fn_timer_value_returns_big_endian_bytes_for_duration stdout ----

thread 'timer_index::tests::fn_timer_value_returns_big_endian_bytes_for_duration' (2723765) panicked at crates/vo-storage/src/timer_index.rs:483:9:
assertion `left == right` failed
  left: [1, 1, 1, 1, 1, 1, 1, 1]
 right: [1, 2, 3, 4, 5, 6, 7, 8]

failures:
    timer_index::tests::fn_timer_value_returns_big_endian_bytes_for_duration

test result: FAILED. 317 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
