*** crates/vo-types/src/compensation.rs:150:9: replace CompensationRecord::effect_id -> &str with ""

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace CompensationRecord::effect_id -> &str with ""
@@ -142,17 +142,17 @@
             compensation_effect_id,
             started_at,
             completed_at,
         })
     }
 
     #[must_use]
     pub fn effect_id(&self) -> &str {
-        &self.effect_id
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn policy(&self) -> crate::effects::CompensationPolicy {
         self.policy
     }
 
     #[must_use]

*** result: Success
