*** crates/vo-types/src/compensation.rs:356:9: replace verification::verify_compensation_record_rejects_empty_effect_id with ()

*** mutation diff:
--- crates/vo-types/src/compensation.rs
+++ replace verification::verify_compensation_record_rejects_empty_effect_id with ()
@@ -348,20 +348,11 @@
 
         // Must not panic — all combinations handled
         let _ = apply_compensation_transition(current, evt);
     }
 
     /// K-02: Verify CompensationRecord::new rejects empty effect_id.
     #[kani::proof]
     fn verify_compensation_record_rejects_empty_effect_id() {
-        let effect_id = String::new();
-        let result = CompensationRecord::new(
-            effect_id,
-            crate::effects::CompensationPolicy::Automatic,
-            CompensationStatus::Pending,
-            None,
-            None,
-            None,
-        );
-        assert!(result.is_none());
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
